[
  {
    "id": "q-people-9-2-001",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a cross-functional cloud migration in healthcare where compliance reviewers want more detail and the team is mid-sprint, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "facilitate an alignment session to reconcile priorities against project objectives"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it brings stakeholders together to align needs with agreed objectives. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-002",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Given a hybrid data platform modernization in fintech where key stakeholders disagree on visibility and the sponsor wants faster decisions, which action best helps optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "co-create a trade-off matrix with stakeholders to balance scope, risk, and objectives"
      },
      {
        "id": "c",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "d",
        "label": "delay addressing conflicts until after the next phase"
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it makes explicit choices that align expectations to objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option c is incorrect because excluding stakeholders risks resistance and misalignment. Option d is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-003",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "While a cross-functional data platform modernization in manufacturing where operations wants fewer touchpoints and a regulatory deadline is four weeks away, what is the most effective next step to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "b",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "c",
        "label": "tie acceptance criteria to the objectives and review them with stakeholders"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it anchors expectations to measurable objectives. Option a is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option b is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-004",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Facing a matrixed ERP rollout in fintech where new sponsors joined mid-project and an audit is scheduled soon, what should the project manager do first to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "c",
        "label": "delay addressing conflicts until after the next phase"
      },
      {
        "id": "d",
        "label": "bring sponsors and key leads together to negotiate conflicting expectations"
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because it resolves conflicts collaboratively to protect objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option b is incorrect because excluding stakeholders risks resistance and misalignment. Option c is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-005",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a vendor-led cloud migration in manufacturing where key stakeholders disagree on visibility and the sponsor wants faster decisions, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "document a shared definition of success and validate it across groups"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it ensures everyone aligns to the same outcomes. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-006",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Given a matrixed CRM rebuild in healthcare where compliance reviewers want more detail and an audit is scheduled soon, which action best helps optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "facilitate an alignment session to reconcile priorities against project objectives"
      },
      {
        "id": "c",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "d",
        "label": "delay addressing conflicts until after the next phase"
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it brings stakeholders together to align needs with agreed objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option c is incorrect because excluding stakeholders risks resistance and misalignment. Option d is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-007",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "While a hybrid ERP rollout in healthcare where compliance reviewers want more detail and the team is mid-sprint, what is the most effective next step to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "b",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "c",
        "label": "co-create a trade-off matrix with stakeholders to balance scope, risk, and objectives"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it makes explicit choices that align expectations to objectives. Option a is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option b is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-008",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Facing a matrixed facility upgrade in healthcare where community reps feel unheard and the schedule buffer is nearly consumed, what should the project manager do first to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "c",
        "label": "delay addressing conflicts until after the next phase"
      },
      {
        "id": "d",
        "label": "tie acceptance criteria to the objectives and review them with stakeholders"
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because it anchors expectations to measurable objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option b is incorrect because excluding stakeholders risks resistance and misalignment. Option c is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "easy",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-009",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a vendor-led facility upgrade in retail where community reps feel unheard and the team is mid-sprint, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "bring sponsors and key leads together to negotiate conflicting expectations"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it resolves conflicts collaboratively to protect objectives. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-010",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Given a vendor-led cloud migration in fintech where community reps feel unheard and a regulatory deadline is four weeks away, which action best helps optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "document a shared definition of success and validate it across groups"
      },
      {
        "id": "c",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "d",
        "label": "delay addressing conflicts until after the next phase"
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it ensures everyone aligns to the same outcomes. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option c is incorrect because excluding stakeholders risks resistance and misalignment. Option d is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-011",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "While a matrixed facility upgrade in retail where operations wants fewer touchpoints and an audit is scheduled soon, what is the most effective next step to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "b",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "c",
        "label": "facilitate an alignment session to reconcile priorities against project objectives"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it brings stakeholders together to align needs with agreed objectives. Option a is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option b is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-012",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Facing a hybrid facility upgrade in public sector where compliance reviewers want more detail and a regulatory deadline is four weeks away, what should the project manager do first to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "c",
        "label": "delay addressing conflicts until after the next phase"
      },
      {
        "id": "d",
        "label": "co-create a trade-off matrix with stakeholders to balance scope, risk, and objectives"
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because it makes explicit choices that align expectations to objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option b is incorrect because excluding stakeholders risks resistance and misalignment. Option c is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-013",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a cross-functional facility upgrade in public sector where new sponsors joined mid-project and the sponsor wants faster decisions, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "tie acceptance criteria to the objectives and review them with stakeholders"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it anchors expectations to measurable objectives. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-014",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Given a matrixed CRM rebuild in retail where key stakeholders disagree on visibility and the schedule buffer is nearly consumed, which action best helps optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "bring sponsors and key leads together to negotiate conflicting expectations"
      },
      {
        "id": "c",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "d",
        "label": "delay addressing conflicts until after the next phase"
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it resolves conflicts collaboratively to protect objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option c is incorrect because excluding stakeholders risks resistance and misalignment. Option d is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-015",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "While a distributed agile facility upgrade in fintech where compliance reviewers want more detail and the sponsor wants faster decisions, what is the most effective next step to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "b",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "c",
        "label": "document a shared definition of success and validate it across groups"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it ensures everyone aligns to the same outcomes. Option a is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option b is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-016",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Facing a matrixed cloud migration in healthcare where key stakeholders disagree on visibility and the schedule buffer is nearly consumed, what should the project manager do first to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "c",
        "label": "delay addressing conflicts until after the next phase"
      },
      {
        "id": "d",
        "label": "facilitate an alignment session to reconcile priorities against project objectives"
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because it brings stakeholders together to align needs with agreed objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option b is incorrect because excluding stakeholders risks resistance and misalignment. Option c is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-017",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a matrixed facility upgrade in manufacturing where compliance reviewers want more detail and the schedule buffer is nearly consumed, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "co-create a trade-off matrix with stakeholders to balance scope, risk, and objectives"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it makes explicit choices that align expectations to objectives. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-018",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Given a cross-functional cloud migration in public sector where new sponsors joined mid-project and a regulatory deadline is four weeks away, which action best helps optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "tie acceptance criteria to the objectives and review them with stakeholders"
      },
      {
        "id": "c",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "d",
        "label": "delay addressing conflicts until after the next phase"
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it anchors expectations to measurable objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option c is incorrect because excluding stakeholders risks resistance and misalignment. Option d is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "medium",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-019",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "While a cross-functional CRM rebuild in manufacturing where key stakeholders disagree on visibility and the team is mid-sprint, what is the most effective next step to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "b",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "c",
        "label": "bring sponsors and key leads together to negotiate conflicting expectations"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it resolves conflicts collaboratively to protect objectives. Option a is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option b is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-020",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Facing a matrixed data platform modernization in retail where key stakeholders disagree on visibility and the schedule buffer is nearly consumed, what should the project manager do first to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "c",
        "label": "delay addressing conflicts until after the next phase"
      },
      {
        "id": "d",
        "label": "document a shared definition of success and validate it across groups"
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because it ensures everyone aligns to the same outcomes. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option b is incorrect because excluding stakeholders risks resistance and misalignment. Option c is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-021",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a vendor-led facility upgrade in fintech where new sponsors joined mid-project and the schedule buffer is nearly consumed, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "facilitate an alignment session to reconcile priorities against project objectives"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it brings stakeholders together to align needs with agreed objectives. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-022",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Given a matrixed facility upgrade in manufacturing where new sponsors joined mid-project and the team is mid-sprint, which action best helps optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "co-create a trade-off matrix with stakeholders to balance scope, risk, and objectives"
      },
      {
        "id": "c",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "d",
        "label": "delay addressing conflicts until after the next phase"
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it makes explicit choices that align expectations to objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option c is incorrect because excluding stakeholders risks resistance and misalignment. Option d is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-023",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "While a distributed agile facility upgrade in healthcare where compliance reviewers want more detail and the team is mid-sprint, what is the most effective next step to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "b",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "c",
        "label": "tie acceptance criteria to the objectives and review them with stakeholders"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it anchors expectations to measurable objectives. Option a is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option b is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-024",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "Facing a distributed agile facility upgrade in fintech where new sponsors joined mid-project and the team is mid-sprint, what should the project manager do first to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "focus only on communication cadence and ignore conflicting objectives"
      },
      {
        "id": "b",
        "label": "let the product owner decide alone and inform others later"
      },
      {
        "id": "c",
        "label": "delay addressing conflicts until after the next phase"
      },
      {
        "id": "d",
        "label": "bring sponsors and key leads together to negotiate conflicting expectations"
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because it resolves conflicts collaboratively to protect objectives. Option a is incorrect because cadence alone does not resolve misaligned expectations. Option b is incorrect because excluding stakeholders risks resistance and misalignment. Option c is incorrect because misalignment tends to worsen and becomes harder to fix later.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-9-2-025",
    "domainId": "people",
    "taskId": "people-9",
    "enablerIds": [
      "e-people-9-2"
    ],
    "text": "In a cross-functional ERP rollout in public sector where compliance reviewers want more detail and an audit is scheduled soon, what should the project manager do to optimize alignment between stakeholder needs, expectations, and project objectives?",
    "options": [
      {
        "id": "a",
        "label": "document a shared definition of success and validate it across groups"
      },
      {
        "id": "b",
        "label": "promise to deliver all requests to keep everyone satisfied"
      },
      {
        "id": "c",
        "label": "freeze scope without engaging stakeholders to resolve conflicts"
      },
      {
        "id": "d",
        "label": "escalate to the sponsor immediately without attempting facilitation"
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because it ensures everyone aligns to the same outcomes. Option b is incorrect because overcommitting without trade-offs risks scope creep and misalignment. Option c is incorrect because unilateral decisions erode buy-in and may miss priorities. Option d is incorrect because skipping facilitation misses a chance for collaborative alignment.",
    "difficulty": "hard",
    "topics": [
      "alignment",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]
