[
{
"front": "What is conflict in the context of project management?",
"back": "Conflict is a disagreement or struggle between parties resulting from opposing needs, ideas, beliefs, values, or goals.",
"tags": ["conflict", "definition"],
"difficulty": "easy"
},
{
"front": "What are the two primary categories of conflict based on their impact?",
"back": "Constructive conflict (beneficial) and destructive conflict (harmful).",
"tags": ["conflict-types", "impact"],
"difficulty": "easy"
},
{
"front": "What is constructive conflict?",
"back": "Conflict that yields positive results, such as innovation, better problem-solving, and improved relationships.",
"tags": ["constructive-conflict", "benefits"],
"difficulty": "easy"
},
{
"front": "What is destructive conflict?",
"back": "Conflict that leads to negative outcomes, such as poor communication, reduced team cohesion, and project delays.",
"tags": ["destructive-conflict", "impact"],
"difficulty": "easy"
},
{
"front": "What is the most common source of conflict in projects?",
"back": "Schedule (deadlines, timing, and sequencing of work).",
"tags": ["sources", "schedule"],
"difficulty": "easy"
},
{
"front": "After schedule, what is historically cited as a major source of project conflict?",
"back": "Project priorities.",
"tags": ["sources", "priorities"],
"difficulty": "easy"
},
{
"front": "What is 'Latent Conflict'?",
"back": "The first stage of conflict where the conditions for conflict exist (e.g., scarce resources), but no conflict has occurred yet.",
"tags": ["stages", "latent-conflict"],
"difficulty": "easy"
},
{
"front": "What characterizes the 'Perceived Conflict' stage?",
"back": "Parties become aware that a conflict exists, even if they have not yet felt an emotional reaction to it.",
"tags": ["stages", "perceived-conflict"],
"difficulty": "easy"
},
{
"front": "What characterizes the 'Felt Conflict' stage?",
"back": "Parties begin to feel stress, tension, anxiety, or hostility regarding the conflict.",
"tags": ["stages", "felt-conflict"],
"difficulty": "easy"
},
{
"front": "What is the 'Manifest Conflict' stage?",
"back": "The stage where conflict becomes open and observable through behavior, such as arguments, passive-aggression, or lack of communication.",
"tags": ["stages", "manifest-conflict"],
"difficulty": "easy"
},
{
"front": "What is the 'Conflict Aftermath' stage?",
"back": "The outcome of the conflict resolution, resulting in either a better relationship (resolution) or lingering tension (dissatisfaction).",
"tags": ["stages", "aftermath"],
"difficulty": "easy"
},
{
"front": "What is 'Task Conflict'?",
"back": "Disagreement regarding the content and goals of the work or technical approaches.",
"tags": ["sources", "task-conflict"],
"difficulty": "easy"
},
{
"front": "What is 'Relationship Conflict'?",
"back": "Conflict based on interpersonal incompatibilities, personality clashes, or emotional tension.",
"tags": ["sources", "relationship-conflict"],
"difficulty": "easy"
},
{
"front": "What is 'Process Conflict'?",
"back": "Disagreement about how the work gets done, including methodologies and delegation.",
"tags": ["sources", "process-conflict"],
"difficulty": "easy"
},
{
"front": "What are scarce resources as a source of conflict?",
"back": "Competition between team members or departments for limited budget, equipment, or personnel.",
"tags": ["sources", "resources"],
"difficulty": "easy"
},
{
"front": "How do unclear roles contribute to conflict?",
"back": "Ambiguity regarding who is responsible for specific tasks leads to gaps in work or stepping on toes.",
"tags": ["sources", "roles"],
"difficulty": "easy"
},
{
"front": "What is the Thomas-Kilmann Conflict Mode Instrument (TKI)?",
"back": "A model that categorizes conflict handling styles based on two dimensions: Assertiveness and Cooperativeness.",
"tags": ["models", "tki"],
"difficulty": "easy"
},
{
"front": "Which TKI mode is high in assertiveness and low in cooperativeness?",
"back": "Competing (forcing).",
"tags": ["models", "competing"],
"difficulty": "easy"
},
{
"front": "Which TKI mode is low in assertiveness and low in cooperativeness?",
"back": "Avoiding (withdrawing).",
"tags": ["models", "avoiding"],
"difficulty": "easy"
},
{
"front": "Which TKI mode is low in assertiveness and high in cooperativeness?",
"back": "Accommodating (smoothing).",
"tags": ["models", "accommodating"],
"difficulty": "easy"
},
{
"front": "Which TKI mode is high in assertiveness and high in cooperativeness?",
"back": "Collaborating (problem-solving).",
"tags": ["models", "collaborating"],
"difficulty": "easy"
},
{
"front": "What defines the 'Compromising' conflict style?",
"back": "Moderate assertiveness and cooperativeness; both sides give up something to reach a temporary or expedient solution.",
"tags": ["models", "compromising"],
"difficulty": "easy"
},
{
"front": "What is a Win-Win resolution?",
"back": "An outcome where all parties are satisfied, typically achieved through collaboration.",
"tags": ["resolution", "win-win"],
"difficulty": "easy"
},
{
"front": "What is a Win-Lose resolution?",
"back": "An outcome where one party gets what they want at the expense of the other, typical of competing.",
"tags": ["resolution", "win-lose"],
"difficulty": "easy"
},
{
"front": "What is a Lose-Lose resolution?",
"back": "An outcome where no party is satisfied, often resulting from avoidance or a poor compromise.",
"tags": ["resolution", "lose-lose"],
"difficulty": "easy"
},
{
"front": "How do cultural differences act as a conflict source?",
"back": "Differences in communication styles, values, and work ethic can lead to misunderstandings and friction.",
"tags": ["sources", "culture"],
"difficulty": "easy"
},
{
"front": "What is 'Level 1: Problem to Solve' in Speed Leas's model?",
"back": "The team focuses on the information and the problem itself; the atmosphere is open and constructive.",
"tags": ["levels", "speed-leas"],
"difficulty": "easy"
},
{
"front": "What is 'Level 5: World War' in Speed Leas's model?",
"back": "The objective shifts from resolving the issue to destroying the opponent; constructive communication is impossible.",
"tags": ["levels", "speed-leas"],
"difficulty": "easy"
},
{
"front": "What is the primary focus when interpreting the source of a conflict?",
"back": "Identifying the root cause (e.g., resource scarcity, personality, technical disagreement) rather than just the symptoms.",
"tags": ["diagnosis", "root-cause"],
"difficulty": "easy"
},
{
"front": "What does 'Withdraw/Avoid' involve?",
"back": "Retreating from an actual or potential conflict situation or postponing the issue to be better prepared.",
"tags": ["resolution", "avoiding"],
"difficulty": "easy"
},
{
"front": "What does 'Smooth/Accommodate' involve?",
"back": "Emphasizing areas of agreement rather than difference; conceding one's position to the needs of others.",
"tags": ["resolution", "accommodating"],
"difficulty": "easy"
},
{
"front": "What does 'Force/Direct' involve?",
"back": "Pushing one's viewpoint at the expense of others; offering only win-lose solutions.",
"tags": ["resolution", "forcing"],
"difficulty": "easy"
},
{
"front": "What is the danger of leaving a conflict in the 'Latent' stage?",
"back": "It creates an underlying tension that can suddenly erupt into manifest conflict if triggered.",
"tags": ["stages", "latent-conflict"],
"difficulty": "easy"
},
{
"front": "How do organizational constraints cause conflict?",
"back": "Policies, rigid hierarchies, or budget cuts restrict the team's ability to act, causing frustration.",
"tags": ["sources", "organizational"],
"difficulty": "easy"
},
{
"front": "What is the main characteristic of 'Collaborating'?",
"back": "Incorporating multiple viewpoints and insights from different perspectives to reach a consensus and commitment.",
"tags": ["resolution", "collaborating"],
"difficulty": "easy"
},
{
"front": "Why is 'Personality' often considered the most difficult conflict source to resolve?",
"back": "Because it is deeply rooted in individual behavior and values, rather than objective project constraints.",
"tags": ["sources", "personality"],
"difficulty": "easy"
},
{
"front": "What indicates that a conflict has moved from 'Perceived' to 'Felt'?",
"back": "The involvement of emotions such as anger, fear, or mistrust.",
"tags": ["stages", "emotional-intelligence"],
"difficulty": "easy"
},
{
"front": "What role does 'Active Listening' play in interpreting conflict?",
"back": "It helps the project manager understand the underlying message and emotions, not just the spoken words.",
"tags": ["communication", "active-listening"],
"difficulty": "easy"
},
{
"front": "What is a 'Zero-Sum' mindset in conflict?",
"back": "The belief that for one person to win, another must lose (fixed pie).",
"tags": ["mindset", "negotiation"],
"difficulty": "easy"
},
{
"front": "How does poor communication act as a source of conflict?",
"back": "Lack of information or misinformation leads to wrong assumptions and misalignment of expectations.",
"tags": ["sources", "communication"],
"difficulty": "easy"
},
{
"front": "What is 'Intergroup Conflict'?",
"back": "Conflict that occurs between two or more different teams or departments.",
"tags": ["types", "intergroup"],
"difficulty": "easy"
},
{
"front": "What is 'Intragroup Conflict'?",
"back": "Conflict that occurs among members of the same team.",
"tags": ["types", "intragroup"],
"difficulty": "easy"
},
{
"front": "What is the 'Storming' phase of team development?",
"back": "A stage where conflict is expected as team members push against boundaries and defined roles.",
"tags": ["team-development", "storming"],
"difficulty": "easy"
},
{
"front": "True or False: All conflict should be eliminated from a project.",
"back": "False. Constructive conflict is healthy and necessary for high-performance teams.",
"tags": ["principles", "constructive-conflict"],
"difficulty": "easy"
},
{
"front": "What is the risk of overusing the 'Compromising' style?",
"back": "It may lead to sub-optimal solutions where neither party is truly satisfied, and root causes are ignored.",
"tags": ["pitfalls", "compromising"],
"difficulty": "easy"
},
{
"front": "What is the primary goal of conflict management?",
"back": "To channel conflict into constructive outcomes rather than suppressing it.",
"tags": ["goals", "management"],
"difficulty": "easy"
},
{
"front": "What is 'emotional intelligence' in the context of conflict?",
"back": "The ability to recognize and manage one's own emotions and the emotions of others during a dispute.",
"tags": ["skills", "emotional-intelligence"],
"difficulty": "easy"
},
{
"front": "What usually happens if a project manager ignores 'Manifest' conflict?",
"back": "The conflict escalates, productivity drops, and relationships may be permanently damaged.",
"tags": ["stages", "escalation"],
"difficulty": "easy"
},
{
"front": "Which conflict source is related to disagreement on technical specifications?",
"back": "Technical beliefs or opinions (often a form of Task Conflict).",
"tags": ["sources", "technical"],
"difficulty": "easy"
},
{
"front": "What defines the 'Problem to Solve' level of conflict?",
"back": "The focus is on the issue, information is shared freely, and language is specific to the problem.",
"tags": ["levels", "speed-leas"],
"difficulty": "easy"
},
{
"front": "How does 'Task Conflict' differ from 'Relationship Conflict'?",
"back": "Task conflict focuses on 'what' and 'how' work is done; Relationship conflict focuses on 'who' and personal friction.",
"tags": ["diagnosis", "types"],
"difficulty": "medium"
},
{
"front": "Why might a Project Manager misdiagnose a structural conflict as a personality conflict?",
"back": "If two people constantly argue, it may look personal, but the root cause might be conflicting KPIs or shared resource constraints.",
"tags": ["diagnosis", "root-cause"],
"difficulty": "medium"
},
{
"front": "When is the 'Competing' (Forcing) style appropriate?",
"back": "When quick, decisive action is needed (emergencies) or when an unpopular decision must be enforced.",
"tags": ["application", "competing"],
"difficulty": "medium"
},
{
"front": "When is the 'Collaborating' style most appropriate?",
"back": "When the objective is to learn, merge different perspectives, and gain commitment by incorporating concerns.",
"tags": ["application", "collaborating"],
"difficulty": "medium"
},
{
"front": "When should you use the 'Avoiding' style?",
"back": "When the issue is trivial, cooling off is needed, or others can resolve the conflict more effectively.",
"tags": ["application", "avoiding"],
"difficulty": "medium"
},
{
"front": "When is 'Accommodating' the best choice?",
"back": "When you realize you are wrong, when the issue is more important to the other party, or to build social credits.",
"tags": ["application", "accommodating"],
"difficulty": "medium"
},
{
"front": "When is 'Compromising' the best choice?",
"back": "When goals are important but not worth the effort of collaborating, or to achieve temporary settlements for complex issues.",
"tags": ["application", "compromising"],
"difficulty": "medium"
},
{
"front": "How does the 'Perceived' stage differ from the 'Felt' stage?",
"back": "Perceived is intellectual awareness of disagreement; Felt implies emotional involvement (anxiety, anger).",
"tags": ["stages", "nuance"],
"difficulty": "medium"
},
{
"front": "If a team member agrees to a solution but uses sarcastic language, what does this indicate about the conflict?",
"back": "The conflict is likely still in the 'Felt' or 'Manifest' stage and has not been genuinely resolved.",
"tags": ["diagnosis", "behavior"],
"difficulty": "medium"
},
{
"front": "How does a 'matrix environment' contribute to conflict sources?",
"back": "It often creates role ambiguity and resource conflict because team members report to both functional and project managers.",
"tags": ["context", "matrix-organization"],
"difficulty": "medium"
},
{
"front": "What signifies that a conflict has escalated from 'Problem to Solve' to 'Disagreement' (Level 2)?",
"back": "Team members start guarding information and the language shifts from specific problems to generalizations.",
"tags": ["levels", "escalation"],
"difficulty": "medium"
},
{
"front": "Why is 'Collaborating' often difficult to apply in late-stage projects?",
"back": "Collaborating requires significant time, which may not be available near a deadline.",
"tags": ["application", "constraints"],
"difficulty": "medium"
},
{
"front": "How can a Project Manager distinguish between 'constructive' and 'destructive' task conflict?",
"back": "Constructive focuses on the best idea; destructive becomes personal or cyclical without resolution.",
"tags": ["diagnosis", "types"],
"difficulty": "medium"
},
{
"front": "If a stakeholder is bypassing the PM to give orders to the team, what is the likely conflict source?",
"back": "Unclear roles/authority or process conflict regarding communication channels.",
"tags": ["diagnosis", "stakeholder"],
"difficulty": "medium"
},
{
"front": "What happens if a Project Manager habitually uses 'Smoothing'?",
"back": "Real issues are never resolved, leading to recurring conflicts and a potential explosion of frustration later.",
"tags": ["pitfalls", "smoothing"],
"difficulty": "medium"
},
{
"front": "In the 'Aftermath' stage, what constitutes a 'dysfunctional' outcome?",
"back": "If the resolution suppressed the conflict rather than solving it, leading to resentment or dormancy (latent conflict).",
"tags": ["stages", "aftermath"],
"difficulty": "medium"
},
{
"front": "How does 'Ambiguity' act as a source of conflict?",
"back": "Lack of clarity regarding goals, scope, or roles leads to differing interpretations and friction.",
"tags": ["sources", "ambiguity"],
"difficulty": "medium"
},
{
"front": "If two experts disagree on a technical approach, why might 'Compromise' be a poor choice?",
"back": "Compromising on technical engineering might lead to a non-functional or unstable product; Collaboration is better.",
"tags": ["application", "technical"],
"difficulty": "medium"
},
{
"front": "What is the relationship between 'Storming' and conflict interpretation?",
"back": "During Storming, conflict is normal and usually stems from role definition and authority testing, not necessarily failure.",
"tags": ["team-development", "storming"],
"difficulty": "medium"
},
{
"front": "How does 'Virtual/Remote' work impact conflict diagnosis?",
"back": "It makes detecting 'Felt' conflict harder because non-verbal cues (body language, tone) are often missing.",
"tags": ["context", "virtual-teams"],
"difficulty": "medium"
},
{
"front": "Why might a Project Manager choose 'Competing' during a safety violation?",
"back": "Safety is non-negotiable; immediate compliance is required to prevent harm.",
"tags": ["application", "safety"],
"difficulty": "medium"
},
{
"front": "What indicates a conflict is in the 'Contest' level (Level 3)?",
"back": "The aim shifts to winning; language uses distorted facts and logic to support one side over the other.",
"tags": ["levels", "speed-leas"],
"difficulty": "medium"
},
{
"front": "How does diversity in a team affect conflict sources?",
"back": "It increases the potential for conflict due to varied perspectives (values/norms) but also increases the potential for innovation.",
"tags": ["sources", "diversity"],
"difficulty": "medium"
},
{
"front": "If a conflict reappears shortly after being 'resolved', what does this imply about the resolution?",
"back": "The root cause was not addressed, or the wrong conflict management style (like smoothing or avoiding) was used.",
"tags": ["diagnosis", "recurrence"],
"difficulty": "medium"
},
{
"front": "Why is 'Collaborating' referred to as 'Problem Solving'?",
"back": "Because it treats the conflict as an external problem to be solved by the group, rather than a fight between individuals.",
"tags": ["models", "collaborating"],
"difficulty": "medium"
},
{
"front": "What is the primary difference between 'Compromising' and 'Collaborating'?",
"back": "Compromising splits the difference (lose-lose/partial win); Collaborating expands the options (win-win).",
"tags": ["comparison", "models"],
"difficulty": "medium"
},
{
"front": "When interpreting conflict, why is it important to assess 'Power Dynamics'?",
"back": "If one party has significantly more power, the other may default to 'Accommodating' or 'Avoiding' out of fear, hiding the true issue.",
"tags": ["diagnosis", "power"],
"difficulty": "medium"
},
{
"front": "If a conflict is based on value systems (e.g., ethics), why is 'Collaborating' difficult?",
"back": "Core values are rarely negotiable; finding a consensus that violates neither side's conscience is extremely challenging.",
"tags": ["sources", "values"],
"difficulty": "medium"
},
{
"front": "How does 'Resource Levelling' potentially act as a conflict source?",
"back": "It may delay tasks or move people around, causing friction with functional managers or team members attached to the schedule.",
"tags": ["sources", "scheduling"],
"difficulty": "medium"
},
{
"front": "Scenario: Two team members are not speaking to each other. Productivity is fine, but the atmosphere is tense. What stage is this?",
"back": "Manifest conflict. Even though it is 'silent', the behavior (ignoring each other) is observable and affects the environment.",
"tags": ["diagnosis", "scenario"],
"difficulty": "medium"
},
{
"front": "Scenario: A functional manager refuses to release a key resource because of a 'rush job' in another department. What is the source?",
"back": "Resources and Priorities (competing demands for a limited resource).",
"tags": ["diagnosis", "scenario"],
"difficulty": "hard"
},
{
"front": "Scenario: You observe a team member hoarding information to ensure they are the only one who can solve a problem. Which Speed Leas level is this likely approaching?",
"back": "Level 3 (Contest) or Level 4 (Crusade), as they are positioning themselves to win or protect their territory rather than solve the project problem.",
"tags": ["diagnosis", "scenario"],
"difficulty": "hard"
},
{
"front": "Scenario: A stakeholder demands a change. The team argues it's out of scope. The sponsor says 'Just do it.' What type of conflict is this?",
"back": "Scope/Process conflict exacerbated by Power dynamics (Forcing style by sponsor).",
"tags": ["diagnosis", "scenario"],
"difficulty": "hard"
},
{
"front": "Scenario: A team is arguing over 'Agile' vs 'Waterfall' for a specific module. Both sides have valid technical points. What is the conflict source?",
"back": "Methodology/Technical approach (Task Conflict).",
"tags": ["diagnosis", "scenario"],
"difficulty": "hard"
},
{
"front": "Scenario: A conflict regarding a deadline is resolved by splitting the difference: the team works overtime, and the stakeholder accepts a small delay. What technique was used?",
"back": "Compromising.",
"tags": ["diagnosis", "resolution-style"],
"difficulty": "hard"
},
{
"front": "Why might a Project Manager allow a 'Task Conflict' to continue rather than resolving it immediately?",
"back": "If the conflict is constructive, it may lead to a better technical solution or innovation. The PM monitors to ensure it doesn't become personal.",
"tags": ["strategy", "constructive-conflict"],
"difficulty": "hard"
},
{
"front": "Scenario: During a meeting, Team Member A attacks Team Member B's character instead of their idea. What should the PM do immediately?",
"back": "Intervene immediately. This is destructive relationship conflict that violates team ground rules and requires facilitation.",
"tags": ["action", "destructive-conflict"],
"difficulty": "hard"
},
{
"front": "Scenario: Two departments have historical bad blood. A new project requires them to work together. What is the likely stage of conflict at the project start?",
"back": "Latent Conflict. The history suggests the conditions for conflict exist before the first meeting occurs.",
"tags": ["diagnosis", "latent"],
"difficulty": "hard"
},
{
"front": "How does the 'Halo Effect' complicate conflict interpretation?",
"back": "A PM might overlook a high-performer's destructive conflict behavior because of their technical competence.",
"tags": ["psychology", "bias"],
"difficulty": "hard"
},
{
"front": "Scenario: A remote team member stops contributing to chats and turns off video. When asked, they say 'Everything is fine.' What is the diagnosis?",
"back": "Withdrawal/Avoidance. The conflict exists (likely felt or manifest) but the member is refusing to engage.",
"tags": ["diagnosis", "virtual"],
"difficulty": "hard"
},
{
"front": "If a conflict has reached Level 4 (Crusade) in Speed Leas's model, what is the typical resolution approach required?",
"back": "De-escalation via professional mediation or diplomacy; the parties are too entrenched to collaborate without third-party help.",
"tags": ["levels", "resolution"],
"difficulty": "hard"
},
{
"front": "Scenario: A PM interprets a conflict as a 'Schedule' issue, but the real issue is that the team feels the deadline was set disrespectfully. What is the risk?",
"back": "Addressing the schedule (logical) won't fix the feeling of disrespect (emotional/relationship), leading to recurring conflict.",
"tags": ["diagnosis", "root-cause"],
"difficulty": "hard"
},
{
"front": "When interpreting conflict sources, how do 'Goal Incompatibility' and 'differentiation' relate?",
"back": "Different departments (e.g., Quality vs. Speed) have naturally opposing goals (differentiation) which structurally creates conflict regardless of personality.",
"tags": ["theory", "structural-conflict"],
"difficulty": "hard"
},
{
"front": "Scenario: A senior architect dominates all design meetings. Junior staff are silent. The architect believes there is consensus. What is the reality?",
"back": "Groupthink or artificial harmony driven by Avoiding/Accommodating. The conflict is latent or felt but suppressed.",
"tags": ["diagnosis", "group-dynamics"],
"difficulty": "hard"
},
{
"front": "Why is 'Compromise' considered a 'lose-lose' in some advanced conflict theories?",
"back": "Because both parties give up something they value, often resulting in a solution that isn't fully effective for either side.",
"tags": ["theory", "compromising"],
"difficulty": "hard"
},
{
"front": "Scenario: You notice two team members constantly cc'ing you on email arguments. What is the source and what does this behavior signify?",
"back": "Source is likely Process/Communication; Behavior signifies an attempt to drag authority (the PM) into the fight (escalation).",
"tags": ["diagnosis", "behavior"],
"difficulty": "hard"
},
{
"front": "How does 'attribution error' affect conflict interpretation?",
"back": "People tend to attribute their own bad behavior to the situation (pressure), but others' bad behavior to their character (laziness).",
"tags": ["psychology", "bias"],
"difficulty": "hard"
},
{
"front": "Scenario: A vendor refuses to deliver without a contract addendum. The project will stop in 2 days. What style is the vendor using, and what might the PM need to use?",
"back": "Vendor is Competing (Forcing). PM may need to Accommodate or Compromise short-term to save the critical path, then renegotiate.",
"tags": ["scenario", "procurement"],
"difficulty": "hard"
},
{
"front": "What is the correlation between 'High Uncertainty' projects and conflict frequency?",
"back": "High uncertainty increases conflict frequency due to constant changes, ambiguity, and the need for frequent re-alignment.",
"tags": ["context", "uncertainty"],
"difficulty": "hard"
},
{
"front": "Scenario: Team A wants to use expensive software X; Team B wants cheap software Y. Budget is fixed. What is the constraint-based source?",
"back": "Cost/Resource constraint (finite budget).",
"tags": ["diagnosis", "cost"],
"difficulty": "hard"
}
]