[
  {
    "id": "q-process-1-3-001",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project team is developing a new e-commerce platform. The project manager wants to support the team in subdividing project tasks to find the Minimum Viable Product (MVP). What should be the primary consideration?",
    "options": [
      {
        "id": "a",
        "label": "The technical complexity of each feature."
      },
      {
        "id": "b",
        "label": "Which features provide the most value to users when delivered together."
      },
      {
        "id": "c",
        "label": "The availability of development resources."
      },
      {
        "id": "d",
        "label": "The preferences of the development team."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Identifying which features provide the most value to users when delivered together is the primary consideration when determining the MVP. The MVP should deliver maximum value with minimum functionality. Technical complexity, resource availability, and team preferences are important but secondary to delivering value to users.",
    "difficulty": "easy",
    "topics": [
      "minimum viable product",
      "value delivery"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-002",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "During an agile project, the team has identified 20 potential features for the first release. How should the project manager support the team in subdividing these features to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all features that have been requested by stakeholders."
      },
      {
        "id": "b",
        "label": "Select the features that can be developed most quickly."
      },
      {
        "id": "c",
        "label": "Choose a subset that delivers core value and can function independently."
      },
      {
        "id": "d",
        "label": "Prioritize features based on the technical architecture requirements."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Choosing a subset of features that delivers core value and can function independently is the correct approach to finding the MVP. This ensures that users receive meaningful functionality early. Including all requested features would not create a minimal product, and selecting based on speed or technical architecture might not deliver the most value.",
    "difficulty": "medium",
    "topics": [
      "agile development",
      "MVP"
    ],
    "process": "define-scope",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-003",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A product owner is working with the development team to define the MVP for a new mobile application. Which approach best supports subdividing project tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Focus on the most visually appealing features first."
      },
      {
        "id": "b",
        "label": "Identify the smallest set of features that solves the core user problem."
      },
      {
        "id": "c",
        "label": "Include all features that can be developed with existing technology."
      },
      {
        "id": "d",
        "label": "Choose features based on the development team's expertise."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Focusing on the most visually appealing features first is not the best approach for identifying an MVP. The correct approach is to identify the smallest set of features that solves the core user problem. Option A prioritizes appearance over value delivery.",
    "difficulty": "medium",
    "topics": [
      "mobile development",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-004",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project manager is working with a team to subdivide tasks for a complex software project. What should be their primary focus when helping the team find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Minimizing the total development time regardless of value delivered."
      },
      {
        "id": "b",
        "label": "Delivering the most requested features first."
      },
      {
        "id": "c",
        "label": "Creating a functional product that demonstrates core value."
      },
      {
        "id": "d",
        "label": "Using the newest available technology to build the product."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Minimizing the total development time regardless of value delivered is not the correct approach to finding an MVP. The focus should be on creating a functional product that demonstrates core value. Option A prioritizes speed over value, which contradicts MVP principles.",
    "difficulty": "medium",
    "topics": [
      "software development",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-005",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A startup is developing a new service and wants to launch quickly with an MVP. How should the project manager support the team in subdividing project tasks?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible features to make the product competitive."
      },
      {
        "id": "b",
        "label": "Focus on core functionality that validates the business hypothesis."
      },
      {
        "id": "c",
        "label": "Implement features that are easiest to develop first."
      },
      {
        "id": "d",
        "label": "Add premium features to justify the product's price point."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Adding premium features to justify the product's price point contradicts MVP principles of delivering minimal functionality that provides value. The correct approach is focusing on core functionality that validates the business hypothesis. Option D adds complexity rather than creating a minimal viable product.",
    "difficulty": "easy",
    "topics": [
      "startup development",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-006",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project team is tasked with developing a new customer portal. The sponsor wants to see results quickly. How should the project manager guide the team in subdividing project tasks to find an MVP?",
    "options": [
      {
        "id": "a",
        "label": "Deliver all planned security features before any functionality."
      },
      {
        "id": "b",
        "label": "Focus on the most essential features that provide customer value."
      },
      {
        "id": "c",
        "label": "Build the most complex features first to resolve technical risks."
      },
      {
        "id": "d",
        "label": "Complete the entire user interface before implementing functionality."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Building the most complex features first to resolve technical risks doesn't necessarily align with MVP principles. The correct approach is focusing on the most essential features that provide customer value. Option C prioritizes technical risk over business value delivery.",
    "difficulty": "medium",
    "topics": [
      "customer portal",
      "MVP"
    ],
    "process": "define-scope",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-007",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A development team is working on a project with a tight deadline. How should the project manager support subdividing tasks to identify the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all features that are easy to implement."
      },
      {
        "id": "b",
        "label": "Focus on essential features that meet the core project objectives."
      },
      {
        "id": "c",
        "label": "Deliver features in the order they were originally planned."
      },
      {
        "id": "d",
        "label": "Add extra features that might be useful in the future."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Adding extra features that might be useful in the future contradicts the MVP principle of delivering minimal functionality. The correct approach is focusing on essential features that meet the core project objectives. Option D increases scope rather than identifying the minimum viable product.",
    "difficulty": "easy",
    "topics": [
      "tight deadline",
      "MVP"
    ],
    "process": "develop-schedule",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-008",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is working on a project to implement a new workflow system. How should the project manager support subdividing tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible workflow variations from the beginning."
      },
      {
        "id": "b",
        "label": "Start with the most common workflow that delivers core value."
      },
      {
        "id": "c",
        "label": "Implement all integration points before core functionality."
      },
      {
        "id": "d",
        "label": "Focus on complex workflows to demonstrate system capabilities."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all integration points before core functionality violates MVP principles by deferring value delivery. The correct approach is starting with the most common workflow that delivers core value. Option C prioritizes technical integration over value delivery.",
    "difficulty": "medium",
    "topics": [
      "workflow system",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-009",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project manager is guiding a team through MVP development for an analytics platform. What approach should they use to support subdividing project tasks?",
    "options": [
      {
        "id": "a",
        "label": "Include advanced analytics features to make the platform powerful."
      },
      {
        "id": "b",
        "label": "Focus on basic reporting that addresses the primary user need."
      },
      {
        "id": "c",
        "label": "Implement the most visually appealing reports first."
      },
      {
        "id": "d",
        "label": "Build all data integration capabilities before any reporting."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including advanced analytics features to make the platform powerful contradicts MVP principles of minimal functionality. The correct approach is focusing on basic reporting that addresses the primary user need. Option A adds complexity rather than delivering minimal viable functionality.",
    "difficulty": "hard",
    "topics": [
      "analytics platform",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-010",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is developing a platform that connects service providers with customers. How should the project manager help subdivide tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Build the payment processing system before user matching."
      },
      {
        "id": "b",
        "label": "Create the core matching functionality with basic payment processing."
      },
      {
        "id": "c",
        "label": "Implement all possible service categories initially."
      },
      {
        "id": "d",
        "label": "Focus on the most complex service matching algorithms first."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all possible service categories initially contradicts MVP principles by increasing scope unnecessarily. The correct approach is creating the core matching functionality with basic payment processing. Option C adds scope rather than finding the minimal viable product.",
    "difficulty": "hard",
    "topics": [
      "service platform",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-011",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project team is developing a new internal tool for project management. How should the project manager guide them in subdividing tasks to identify the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all project management processes from the PMBOK Guide."
      },
      {
        "id": "b",
        "label": "Focus on essential features that address the primary user pain points."
      },
      {
        "id": "c",
        "label": "Build the most advanced reporting features first."
      },
      {
        "id": "d",
        "label": "Implement all integration capabilities before basic functionality."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all project management processes from the PMBOK Guide would create an overcomplicated MVP. The correct approach is focusing on essential features that address the primary user pain points. Option A significantly overscopes the minimum viable product.",
    "difficulty": "hard",
    "topics": [
      "project management tool",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-012",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is working on creating a mobile app for restaurant ordering. Which approach best supports subdividing project tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible restaurant categories in the initial version."
      },
      {
        "id": "b",
        "label": "Focus on the ordering flow for a single restaurant type."
      },
      {
        "id": "c",
        "label": "Implement all loyalty program features upfront."
      },
      {
        "id": "d",
        "label": "Add sophisticated recommendation algorithms from the start."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all loyalty program features upfront adds unnecessary complexity to the MVP. The correct approach is focusing on the ordering flow for a single restaurant type. Option C increases scope beyond what's needed for a minimum viable product.",
    "difficulty": "medium",
    "topics": [
      "restaurant app",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-013",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project manager is helping a team subdivide tasks for a document management system. What should be their guidance for identifying the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Implement all possible file format conversions initially."
      },
      {
        "id": "b",
        "label": "Focus on core functions: upload, store, and retrieve documents."
      },
      {
        "id": "c",
        "label": "Build advanced workflow capabilities before basic storage."
      },
      {
        "id": "d",
        "label": "Include all possible security features from the beginning."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Implementing all possible file format conversions initially violates MVP principles by adding unnecessary features. The correct approach is focusing on core functions: upload, store, and retrieve documents. Option A adds scope beyond the minimum viable functionality needed.",
    "difficulty": "medium",
    "topics": [
      "document management",
      "MVP"
    ],
    "process": "define-scope",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-014",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is developing an IoT platform for monitoring industrial equipment. How should the project manager support subdividing tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible sensor types and monitoring capabilities initially."
      },
      {
        "id": "b",
        "label": "Focus on monitoring a single critical parameter for one equipment type."
      },
      {
        "id": "c",
        "label": "Implement all alert and notification features upfront."
      },
      {
        "id": "d",
        "label": "Build all data visualization capabilities before basic monitoring."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all possible sensor types and monitoring capabilities initially contradicts MVP principles. The correct approach is focusing on monitoring a single critical parameter for one equipment type. Option A significantly overscopes the initial product by including everything at once.",
    "difficulty": "hard",
    "topics": [
      "IoT platform",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-015",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A company is creating a platform for online learning. How should the project manager guide the team in subdividing tasks for the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible course formats and delivery methods."
      },
      {
        "id": "b",
        "label": "Focus on delivering a single course format with core functionality."
      },
      {
        "id": "c",
        "label": "Build all advanced assessment capabilities first."
      },
      {
        "id": "d",
        "label": "Implement all social learning features immediately."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all possible course formats and delivery methods violates MVP principles by creating excessive scope. The correct approach is focusing on delivering a single course format with core functionality. Option A overcomplicates the minimum viable product.",
    "difficulty": "medium",
    "topics": [
      "online learning",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-016",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is building a platform for freelance professionals. How should the project manager help subdivide tasks to identify the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible payment methods and currencies."
      },
      {
        "id": "b",
        "label": "Focus on the core functionality for connecting freelancers and clients."
      },
      {
        "id": "c",
        "label": "Implement all possible communication channels upfront."
      },
      {
        "id": "d",
        "label": "Build all rating and review features initially."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all possible communication channels upfront adds unnecessary complexity to the MVP. The correct approach is focusing on the core functionality for connecting freelancers and clients. Option C overextends the initial product scope.",
    "difficulty": "medium",
    "topics": [
      "freelance platform",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-017",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project team is creating a system for managing remote work. How should the project manager support subdividing tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Implement all possible collaboration tools and integrations."
      },
      {
        "id": "b",
        "label": "Focus on core features like time tracking and basic communication."
      },
      {
        "id": "c",
        "label": "Build all security and compliance features before any functionality."
      },
      {
        "id": "d",
        "label": "Include all possible reporting and analytics capabilities."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Implementing all possible collaboration tools and integrations contradicts MVP principles by adding excessive scope. The correct approach is focusing on core features like time tracking and basic communication. Option A overcomplicates the initial product.",
    "difficulty": "hard",
    "topics": [
      "remote work management",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-018",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is developing a food delivery platform. How should the project manager guide them in subdividing project tasks for the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible restaurant types and cuisines initially."
      },
      {
        "id": "b",
        "label": "Focus on delivery for a single cuisine type within a small area."
      },
      {
        "id": "c",
        "label": "Implement all possible payment methods upfront."
      },
      {
        "id": "d",
        "label": "Build all advanced recommendation features from the start."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all possible payment methods upfront adds unnecessary complexity to the MVP. The correct approach is focusing on delivery for a single cuisine type within a small area. Option C increases scope beyond what's needed for the initial minimum viable product.",
    "difficulty": "medium",
    "topics": [
      "food delivery platform",
      "MVP"
    ],
    "process": "define-scope",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-019",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project manager is helping a team subdivide tasks for a healthcare appointment scheduling system. What is the best approach for identifying the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible medical specialties and appointment types."
      },
      {
        "id": "b",
        "label": "Focus on scheduling for one medical specialty with basic features."
      },
      {
        "id": "c",
        "label": "Implement all compliance and security features before functionality."
      },
      {
        "id": "d",
        "label": "Add all possible reminder and notification methods initially."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all possible medical specialties and appointment types violates MVP principles by creating excessive scope. The correct approach is focusing on scheduling for one medical specialty with basic features. Option A significantly overscopes the minimum viable product.",
    "difficulty": "hard",
    "topics": [
      "healthcare scheduling",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-020",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is building a platform for event management. How should the project manager support subdividing tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible event types and formats initially."
      },
      {
        "id": "b",
        "label": "Focus on managing one type of event with core functionality."
      },
      {
        "id": "c",
        "label": "Build all payment and invoicing capabilities upfront."
      },
      {
        "id": "d",
        "label": "Implement all social media integration features immediately."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Building all payment and invoicing capabilities upfront adds unnecessary complexity to the MVP. The correct approach is focusing on managing one type of event with core functionality. Option C overcomplicates the initial product with advanced financial features before establishing core value.",
    "difficulty": "hard",
    "topics": [
      "event management",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-021",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project team is creating a system for managing customer support tickets. How should the project manager guide subdividing tasks to identify the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible ticket categories and resolution workflows."
      },
      {
        "id": "b",
        "label": "Focus on basic ticket creation, assignment, and resolution flow."
      },
      {
        "id": "c",
        "label": "Implement all possible reporting and analytics features initially."
      },
      {
        "id": "d",
        "label": "Add all integration capabilities with existing systems upfront."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all possible ticket categories and resolution workflows overcomplicates the MVP. The correct approach is focusing on basic ticket creation, assignment, and resolution flow. Option A adds excessive scope beyond what's needed for a minimum viable product.",
    "difficulty": "medium",
    "topics": [
      "customer support",
      "MVP"
    ],
    "process": "define-scope",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-022",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is developing a platform for managing personal finances. How should the project manager help subdivide tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible financial instruments and investment options."
      },
      {
        "id": "b",
        "label": "Focus on basic expense tracking and budgeting features."
      },
      {
        "id": "c",
        "label": "Implement all security and privacy features before basic functionality."
      },
      {
        "id": "d",
        "label": "Build all possible visualization and reporting capabilities initially."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all possible financial instruments and investment options significantly overscopes the MVP. The correct approach is focusing on basic expense tracking and budgeting features. Option A adds complexity beyond the minimum viable functionality needed.",
    "difficulty": "hard",
    "topics": [
      "personal finance",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-023",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project manager is working with a team to develop a fitness tracking app. What guidance should they provide for subdividing tasks to identify the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include tracking for all possible exercises and activities."
      },
      {
        "id": "b",
        "label": "Focus on tracking one primary activity with basic features."
      },
      {
        "id": "c",
        "label": "Implement all possible social features and community aspects."
      },
      {
        "id": "d",
        "label": "Add all possible wearable device integrations initially."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all possible social features and community aspects adds unnecessary complexity to the MVP. The correct approach is focusing on tracking one primary activity with basic features. Option C prioritizes social features over core functionality.",
    "difficulty": "medium",
    "topics": [
      "fitness tracking",
      "MVP"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-1-3-024",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A team is creating a platform for managing home services. How should the project manager support subdividing tasks to find the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible home service types from the beginning."
      },
      {
        "id": "b",
        "label": "Focus on scheduling and managing one type of home service."
      },
      {
        "id": "c",
        "label": "Implement all payment and billing features before basic functionality."
      },
      {
        "id": "d",
        "label": "Build all possible customer communication methods initially."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Including all possible home service types from the beginning overcomplicates the MVP. The correct approach is focusing on scheduling and managing one type of home service. Option A adds excessive scope rather than finding the minimum viable functionality.",
    "difficulty": "medium",
    "topics": [
      "home services",
      "MVP"
    ],
    "process": "define-scope",
    "knowledgeAreaId": "scope"
  },
  {
    "id": "q-process-1-3-025",
    "domainId": "process",
    "taskId": "process-1",
    "enablerIds": [
      "e-process-1-3"
    ],
    "text": "A project team is developing a platform for online tutoring. How should the project manager guide them in subdividing tasks to identify the MVP?",
    "options": [
      {
        "id": "a",
        "label": "Include all possible subjects and grade levels initially."
      },
      {
        "id": "b",
        "label": "Focus on one subject area with core tutoring functionality."
      },
      {
        "id": "c",
        "label": "Implement all possible assessment and evaluation tools upfront."
      },
      {
        "id": "d",
        "label": "Build all scheduling and calendar integration features immediately."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Implementing all possible assessment and evaluation tools upfront adds unnecessary complexity to the MVP. The correct approach is focusing on one subject area with core tutoring functionality. Option C overcomplicates the initial product with advanced assessment features.",
    "difficulty": "hard",
    "topics": [
      "online tutoring",
      "MVP"
    ],
    "process": "collect-requirements",
    "knowledgeAreaId": "scope"
  }
]