[
  {
    "id": "q-people-2-1-001",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A new cross-functional team is unsure how their work contributes to the bigger picture. What should the project manager do first to set a clear vision and mission?",
    "options": [
      {
        "id": "a",
        "label": "Share a concise vision statement that links the project to organizational strategy and expected outcomes."
      },
      {
        "id": "b",
        "label": "Ask each team member to create their own separate vision and follow it."
      },
      {
        "id": "c",
        "label": "Focus only on detailed task lists and avoid discussing strategy."
      },
      {
        "id": "d",
        "label": "Tell the team that vision is the sponsor’s concern and not relevant to daily work."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a shared, concise vision that connects the project to strategy helps everyone understand purpose and direction. Option b is incorrect because separate visions fragment alignment. Option c is incorrect because only focusing on tasks misses why the work matters. Option d is incorrect because dismissing vision undermines engagement and ownership.",
    "difficulty": "easy",
    "topics": [
      "vision setting",
      "strategy alignment"
    ]
  },
  {
    "id": "q-people-2-1-002",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A project is approved, but different stakeholders describe the project purpose differently. How should the project manager lead the team to a shared mission?",
    "options": [
      {
        "id": "a",
        "label": "Facilitate a workshop to refine a mission statement that reconciles stakeholder objectives and constraints."
      },
      {
        "id": "b",
        "label": "Let each stakeholder communicate their own version of the mission to the team."
      },
      {
        "id": "c",
        "label": "Avoid discussing mission and focus only on the schedule."
      },
      {
        "id": "d",
        "label": "Ask the team to guess the mission based on initial tasks."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a facilitated mission workshop aligns stakeholders and gives the team a coherent purpose. Option b is incorrect because multiple versions confuse the team. Option c is incorrect because ignoring mission fails to resolve misalignment. Option d is incorrect because guessing mission risks divergent assumptions.",
    "difficulty": "medium",
    "topics": [
      "mission statement",
      "stakeholder alignment"
    ]
  },
  {
    "id": "q-people-2-1-003",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "The team’s work feels like a series of unconnected tasks. What should the project manager do to reinforce the vision?",
    "options": [
      {
        "id": "a",
        "label": "Regularly restate how sprint goals and deliverables advance the project vision and benefits."
      },
      {
        "id": "b",
        "label": "Tell the team the vision is documented and does not need to be repeated."
      },
      {
        "id": "c",
        "label": "Stop discussing goals to avoid taking time away from execution."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to keep the vision confidential."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because continuously linking work to vision keeps purpose visible and motivates the team. Option b is incorrect because a one-time statement is not enough. Option c is incorrect because dropping goal discussions makes work feel transactional. Option d is incorrect because secrecy about vision undermines transparency and engagement.",
    "difficulty": "easy",
    "topics": [
      "vision communication",
      "motivation"
    ]
  },
  {
    "id": "q-people-2-1-004",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "New stakeholders join mid-project and question why the current scope matters. How can the project manager reinforce the mission for both team and stakeholders?",
    "options": [
      {
        "id": "a",
        "label": "Update and share a brief mission narrative that connects current scope to strategic outcomes."
      },
      {
        "id": "b",
        "label": "Ask stakeholders to review old emails to infer the mission."
      },
      {
        "id": "c",
        "label": "Avoid revisiting mission to prevent reopening prior decisions."
      },
      {
        "id": "d",
        "label": "Focus only on budget details and skip mission discussion."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a refreshed mission narrative helps new and existing participants understand why current work matters. Option b is incorrect because expecting stakeholders to infer mission from old messages is inefficient and error-prone. Option c is incorrect because not revisiting mission with new stakeholders prolongs confusion. Option d is incorrect because budget explanation alone does not answer purpose.",
    "difficulty": "medium",
    "topics": [
      "onboarding",
      "mission reinforcement"
    ]
  },
  {
    "id": "q-people-2-1-005",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "The organization’s strategy changes, and the project’s original mission is partially outdated. What should the project manager do to lead the team effectively?",
    "options": [
      {
        "id": "a",
        "label": "Work with sponsors to refresh the mission, then clearly communicate the revised direction and impacts to the team."
      },
      {
        "id": "b",
        "label": "Continue using the original mission to avoid rework."
      },
      {
        "id": "c",
        "label": "Let each team lead interpret the new strategy independently."
      },
      {
        "id": "d",
        "label": "Pause all communication until the strategy stabilizes completely."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because aligning mission with new strategy and communicating changes allows the team to adjust correctly. Option b is incorrect because an outdated mission misdirects effort. Option c is incorrect because fragmented interpretations cause inconsistency. Option d is incorrect because going silent increases uncertainty and anxiety.",
    "difficulty": "hard",
    "topics": [
      "strategy changes",
      "mission update"
    ]
  },
  {
    "id": "q-people-2-1-006",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "During a kickoff, the sponsor provides a long technical overview. Team members later say they still do not understand the project’s purpose. What should the project manager do to clarify the mission?",
    "options": [
      {
        "id": "a",
        "label": "Translate the sponsor’s message into a short, plain-language mission that explains who is served and what success looks like."
      },
      {
        "id": "b",
        "label": "Ask team members to reread the entire charter without additional clarification."
      },
      {
        "id": "c",
        "label": "Tell the team that purpose will become clear once they start coding."
      },
      {
        "id": "d",
        "label": "Delay clarification until after the first release so the mission can be refined."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because converting technical detail into a concise, audience-appropriate mission gives the team a usable mental model of success. Option b is incorrect because rereading the same complex material does not address the clarity gap. Option c is incorrect because waiting for purpose to emerge wastes early alignment opportunities. Option d is incorrect because postponing mission clarity until after a release risks misdirected work.",
    "difficulty": "medium",
    "topics": [
      "mission clarity",
      "kickoff"
    ]
  },
  {
    "id": "q-people-2-1-007",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A team member asks how their current tasks help customers, and the project manager cannot answer clearly. What is the best next step to strengthen the project mission?",
    "options": [
      {
        "id": "a",
        "label": "Work with the product owner to map backlog items to customer outcomes and share this mapping with the team."
      },
      {
        "id": "b",
        "label": "Explain that customer impact is handled by another department and not relevant to the team."
      },
      {
        "id": "c",
        "label": "Tell the team member to focus on tasks and stop questioning value."
      },
      {
        "id": "d",
        "label": "Respond that customer outcomes will be defined after deployment."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because linking work items to outcomes clarifies how daily tasks support the mission and improves engagement. Option b is incorrect because distancing the team from customers undermines purpose. Option c is incorrect because discouraging value questions suppresses healthy curiosity. Option d is incorrect because defining outcomes only after deployment is too late to influence direction.",
    "difficulty": "easy",
    "topics": [
      "backlog to outcomes",
      "mission alignment"
    ]
  },
  {
    "id": "q-people-2-1-008",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "The project has a mission statement, but it is long and full of jargon. Team members do not remember it. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Co-create a shorter, memorable mission phrase with the team that keeps the core intent."
      },
      {
        "id": "b",
        "label": "Require everyone to memorize the existing statement verbatim."
      },
      {
        "id": "c",
        "label": "Stop referencing the mission and rely on deadlines instead."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to send more detailed emails about the mission."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because involving the team in simplifying the mission improves understanding and ownership. Option b is incorrect because rote memorization of jargon does not create real alignment. Option c is incorrect because abandoning mission guidance reduces purpose to schedule pressure. Option d is incorrect because more long emails repeat the original problem.",
    "difficulty": "medium",
    "topics": [
      "mission design",
      "team co-creation"
    ]
  },
  {
    "id": "q-people-2-1-009",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "In a portfolio review, leadership questions whether the project still fits the organization’s mission. How should the project manager respond to maintain a clear project mission?",
    "options": [
      {
        "id": "a",
        "label": "Present how current and planned outcomes align with strategic objectives and propose mission adjustments if misalignment is found."
      },
      {
        "id": "b",
        "label": "Insist the project is important without showing links to strategy."
      },
      {
        "id": "c",
        "label": "Avoid engaging in the discussion to prevent changes."
      },
      {
        "id": "d",
        "label": "Shift the mission to whatever seems easiest to deliver, regardless of strategy."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because demonstrating alignment and being open to mission refinement keeps the project relevant and purposeful. Option b is incorrect because assertions without evidence do not address leadership’s concerns. Option c is incorrect because avoiding the conversation risks cancellation or drift. Option d is incorrect because optimizing for ease rather than strategy undermines value.",
    "difficulty": "hard",
    "topics": [
      "strategic alignment",
      "mission review"
    ]
  },
  {
    "id": "q-people-2-1-010",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "Different subteams have created their own informal mission statements that do not fully align. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Facilitate a session to consolidate subteam perspectives into a single, unified mission that everyone supports."
      },
      {
        "id": "b",
        "label": "Allow each subteam to keep its mission without alignment, since autonomy is more important."
      },
      {
        "id": "c",
        "label": "Discard all mission statements and focus solely on scope statements."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to define the mission alone without team input."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because co-creating a unified mission ensures coherence while valuing input from all subteams. Option b is incorrect because divergent missions can lead to conflicting priorities. Option c is incorrect because removing mission guidance reduces clarity of purpose. Option d is incorrect because excluding the team diminishes ownership and may miss practical insights.",
    "difficulty": "medium",
    "topics": [
      "mission unification",
      "team alignment"
    ]
  },
  {
    "id": "q-people-2-1-011",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A new regulation impacts the project, and the team wonders if their mission has changed. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Review the regulation with key stakeholders and update the mission statement if necessary, then communicate the implications clearly."
      },
      {
        "id": "b",
        "label": "Tell the team the mission is unchanged without checking the impact."
      },
      {
        "id": "c",
        "label": "Ask the team to interpret the regulation on their own and adjust work independently."
      },
      {
        "id": "d",
        "label": "Ignore the regulation until an audit occurs."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because confirming the impact and updating the mission keeps the team aligned with new constraints. Option b is incorrect because assuming no change can lead to noncompliance. Option c is incorrect because delegating interpretation to the team without guidance risks inconsistent responses. Option d is incorrect because ignoring regulations invites serious risk.",
    "difficulty": "hard",
    "topics": [
      "regulatory impact",
      "mission adjustment"
    ]
  },
  {
    "id": "q-people-2-1-012",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "The team is split between focusing on technical elegance and business deadlines. How can the project manager use the mission to guide them?",
    "options": [
      {
        "id": "a",
        "label": "Revisit the mission to emphasize the balance of value, quality, and timeliness, and use it to evaluate trade-offs."
      },
      {
        "id": "b",
        "label": "Let technical staff decide alone based on preferred tools."
      },
      {
        "id": "c",
        "label": "Let business stakeholders decide alone based on the earliest possible date."
      },
      {
        "id": "d",
        "label": "Avoid discussing the mission to prevent conflict."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because using the mission as a decision lens helps reconcile technical and business priorities. Option b is incorrect because tool preferences may not reflect business needs. Option c is incorrect because focusing only on dates can harm quality and long-term value. Option d is incorrect because avoiding mission discussion forfeits a shared basis for decisions.",
    "difficulty": "medium",
    "topics": [
      "trade-offs",
      "mission as lens"
    ]
  },
  {
    "id": "q-people-2-1-013",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "During onboarding, new team members receive detailed technical training but no explanation of the project’s mission. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Add a mission and vision overview to onboarding materials and personally walk new members through it."
      },
      {
        "id": "b",
        "label": "Assume new members will learn the mission informally over time."
      },
      {
        "id": "c",
        "label": "Rely solely on the HR orientation to cover mission topics."
      },
      {
        "id": "d",
        "label": "Delay mission discussions until the new members have completed several sprints."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because early exposure to mission helps new members connect their work to purpose. Option b is incorrect because informal learning can be inconsistent or inaccurate. Option c is incorrect because HR orientation may not cover project-specific mission. Option d is incorrect because postponing until later wastes an important engagement window.",
    "difficulty": "easy",
    "topics": [
      "onboarding",
      "mission communication"
    ]
  },
  {
    "id": "q-people-2-1-014",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "Stakeholders are pushing for additional features that do not align with the stated mission. How should the project manager respond?",
    "options": [
      {
        "id": "a",
        "label": "Use the mission to explain why some requests may dilute focus and propose alternatives that support the mission."
      },
      {
        "id": "b",
        "label": "Accept all feature requests to keep stakeholders satisfied, regardless of mission fit."
      },
      {
        "id": "c",
        "label": "Reject all requests without explanation because they seem off-mission."
      },
      {
        "id": "d",
        "label": "Ignore the mission and prioritize based on who has the most influence."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because referencing the mission helps negotiate scope while preserving stakeholder relationships. Option b is incorrect because accepting everything risks scope creep and diluted value. Option c is incorrect because rejecting without explanation harms trust. Option d is incorrect because prioritizing by influence alone may move the project away from its purpose.",
    "difficulty": "hard",
    "topics": [
      "scope vs mission",
      "stakeholder negotiation"
    ]
  },
  {
    "id": "q-people-2-1-015",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "Midway through the project, team members say they are unsure whether the mission has changed after several scope adjustments. What is the best action for the project manager?",
    "options": [
      {
        "id": "a",
        "label": "Review changes with sponsors, confirm whether the mission has shifted, and communicate any updated mission clearly to the team."
      },
      {
        "id": "b",
        "label": "Tell the team that the mission never changes, regardless of scope updates."
      },
      {
        "id": "c",
        "label": "Ask team members to infer mission changes from the backlog without guidance."
      },
      {
        "id": "d",
        "label": "Avoid discussing mission to prevent confusion."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because validating and communicating mission changes maintains alignment. Option b is incorrect because missions can legitimately evolve with scope. Option c is incorrect because unguided inference risks inconsistent interpretations. Option d is incorrect because silence increases confusion.",
    "difficulty": "medium",
    "topics": [
      "mission evolution",
      "communication"
    ]
  },
  {
    "id": "q-people-2-1-016",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "The mission statement focuses heavily on internal efficiency, but the organization is shifting to customer-centric metrics. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Engage sponsors to revise the mission so it reflects both internal efficiency and customer impact, then align metrics accordingly."
      },
      {
        "id": "b",
        "label": "Leave the mission unchanged and only adjust metrics quietly."
      },
      {
        "id": "c",
        "label": "Ignore the organizational shift and focus solely on efficiency."
      },
      {
        "id": "d",
        "label": "Stop using metrics to avoid misalignment."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because updating mission and metrics together ensures the team aims at the right outcomes. Option b is incorrect because misaligned mission and metrics confuse priorities. Option c is incorrect because disregarding the shift risks delivering less relevant value. Option d is incorrect because abandoning metrics removes an important feedback mechanism.",
    "difficulty": "hard",
    "topics": [
      "mission and metrics",
      "customer focus"
    ]
  },
  {
    "id": "q-people-2-1-017",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A distributed team works on several products and is confused about which project mission applies to which work. How should the project manager respond?",
    "options": [
      {
        "id": "a",
        "label": "Clearly label work items by project, review each project’s mission, and ensure assignments align with the correct mission."
      },
      {
        "id": "b",
        "label": "Tell the team that all work shares the same mission regardless of project."
      },
      {
        "id": "c",
        "label": "Ask team members to decide individually which mission they prefer to follow."
      },
      {
        "id": "d",
        "label": "Reduce communication about mission to avoid confusion."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clarifying which mission applies to which work helps people focus and make consistent decisions. Option b is incorrect because assuming a single mission across projects may not reflect reality. Option c is incorrect because personal preference cannot override project boundaries. Option d is incorrect because less communication increases misunderstanding.",
    "difficulty": "medium",
    "topics": [
      "multi-project context",
      "mission clarity"
    ]
  },
  {
    "id": "q-people-2-1-018",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "During a town hall, a leader describes the organizational mission in terms that differ slightly from the project’s mission. Team members are confused. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Clarify how the project mission supports the broader organizational mission and adjust wording if needed for consistency."
      },
      {
        "id": "b",
        "label": "Ignore the discrepancy and hope team members do not notice."
      },
      {
        "id": "c",
        "label": "Change the project mission immediately without consulting sponsors."
      },
      {
        "id": "d",
        "label": "Tell the team to focus only on the organizational mission and forget the project mission."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because positioning the project mission as a specific expression of the organizational mission resolves confusion. Option b is incorrect because ignoring differences can create doubt. Option c is incorrect because unilateral changes without sponsor input may misrepresent intent. Option d is incorrect because discarding the project mission removes needed focus.",
    "difficulty": "hard",
    "topics": [
      "organizational vs project mission",
      "alignment"
    ]
  },
  {
    "id": "q-people-2-1-019",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "Developers complain that requirements feel like isolated tasks rather than part of a cohesive story. How can the project manager reinforce mission during refinement?",
    "options": [
      {
        "id": "a",
        "label": "Ask the product owner to frame user stories around personas and mission-driven outcomes, not only technical changes."
      },
      {
        "id": "b",
        "label": "Shorten refinement sessions and focus only on estimates."
      },
      {
        "id": "c",
        "label": "Stop inviting developers to refinement to simplify discussions."
      },
      {
        "id": "d",
        "label": "Treat requirements purely as technical tickets with no context."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because connecting stories to users and mission helps the team see how pieces fit into the whole. Option b is incorrect because rushing refinement reduces understanding. Option c is incorrect because excluding developers removes critical insight. Option d is incorrect because technical-only tickets undermine purpose.",
    "difficulty": "medium",
    "topics": [
      "user stories",
      "mission framing"
    ]
  },
  {
    "id": "q-people-2-1-020",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A new initiative competes for the same team and budget as the current project. Leadership asks why the current project should continue. How can the project manager use the mission to respond?",
    "options": [
      {
        "id": "a",
        "label": "Explain how the current mission addresses specific strategic gaps and what would be lost if the project stops."
      },
      {
        "id": "b",
        "label": "Insist the project continue because of the effort already invested."
      },
      {
        "id": "c",
        "label": "Avoid answering the question and refer leadership to the team instead."
      },
      {
        "id": "d",
        "label": "Focus only on technical challenges without mentioning mission."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because articulating mission-driven value helps leadership weigh trade-offs between initiatives. Option b is incorrect because sunk cost is not a valid justification. Option c is incorrect because deflecting the question signals lack of ownership. Option d is incorrect because technical details alone do not explain strategic importance.",
    "difficulty": "hard",
    "topics": [
      "portfolio trade-offs",
      "mission justification"
    ]
  },
  {
    "id": "q-people-2-1-021",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "The project has multiple external partners with different expectations. How can the project manager keep the team focused on a coherent mission?",
    "options": [
      {
        "id": "a",
        "label": "Create a single mission statement that reflects shared outcomes and use it to evaluate partner requests."
      },
      {
        "id": "b",
        "label": "Adopt a different mission for each partner and switch focus frequently."
      },
      {
        "id": "c",
        "label": "Avoid defining a mission to stay flexible for all partners."
      },
      {
        "id": "d",
        "label": "Let each partner define the mission independently for the team."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a unified mission prevents the team from being pulled in incompatible directions. Option b is incorrect because competing missions create confusion. Option c is incorrect because no mission leads to reactive behavior. Option d is incorrect because multiple independent missions erode clarity.",
    "difficulty": "hard",
    "topics": [
      "multi-partner alignment",
      "mission focus"
    ]
  },
  {
    "id": "q-people-2-1-022",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A mid-level manager challenges the team’s mission as being \"too ambitious\" for the available time. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Re-examine scope, constraints, and mission with key stakeholders and adjust scope or mission to maintain feasibility and integrity."
      },
      {
        "id": "b",
        "label": "Ignore the concern because the mission was already approved."
      },
      {
        "id": "c",
        "label": "Relax all quality standards to meet the ambitious mission without change."
      },
      {
        "id": "d",
        "label": "Increase overtime expectations instead of revisiting mission or scope."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because mission and scope must be realistic within constraints; revisiting them protects delivery credibility. Option b is incorrect because ignoring feasibility feedback can lead to failure. Option c is incorrect because sacrificing quality may undermine mission outcomes. Option d is incorrect because relying on overtime is not sustainable.",
    "difficulty": "hard",
    "topics": [
      "feasibility",
      "mission and scope"
    ]
  },
  {
    "id": "q-people-2-1-023",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "A team in another region works on a similar initiative with a slightly different mission. Confusion arises during collaboration. How should the project manager address this?",
    "options": [
      {
        "id": "a",
        "label": "Align with the other team’s leadership to clarify boundaries and ensure both missions complement rather than conflict with each other."
      },
      {
        "id": "b",
        "label": "Tell your team to ignore the other team’s mission completely."
      },
      {
        "id": "c",
        "label": "Adopt the other team’s mission without consulting sponsors."
      },
      {
        "id": "d",
        "label": "Avoid joint meetings so the differences do not surface."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because coordinating missions across teams clarifies how efforts fit together and reduces duplication or conflict. Option b is incorrect because ignoring related work risks misalignment. Option c is incorrect because unilateral adoption may diverge from local sponsor intent. Option d is incorrect because avoiding collaboration hides issues instead of resolving them.",
    "difficulty": "hard",
    "topics": [
      "cross-team alignment",
      "mission coordination"
    ]
  },
  {
    "id": "q-people-2-1-024",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "Team members suggest a new opportunity that would significantly expand the project’s mission. What is the best first step for the project manager?",
    "options": [
      {
        "id": "a",
        "label": "Assess how the expanded mission aligns with strategy, capacity, and benefits, then discuss options with sponsors."
      },
      {
        "id": "b",
        "label": "Immediately adopt the expanded mission without analysis."
      },
      {
        "id": "c",
        "label": "Reject the idea outright to avoid any change in mission."
      },
      {
        "id": "d",
        "label": "Ask the team to start work on the new opportunity informally, outside the project."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because evaluating strategic fit and feasibility ensures any mission expansion is intentional and supported. Option b is incorrect because jumping in without analysis can overload the team. Option c is incorrect because dismissing ideas without consideration may stifle innovation. Option d is incorrect because informal work outside governance creates risk.",
    "difficulty": "medium",
    "topics": [
      "mission expansion",
      "benefits analysis"
    ]
  },
  {
    "id": "q-people-2-1-025",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-1"
    ],
    "text": "After a major pivot, some long-standing team members feel the project’s mission no longer matches why they joined. How should the project manager respond?",
    "options": [
      {
        "id": "a",
        "label": "Explain the reasons for the pivot, restate the new mission, and discuss how roles can still contribute meaningfully."
      },
      {
        "id": "b",
        "label": "Tell team members that their feelings are irrelevant because the plan has changed."
      },
      {
        "id": "c",
        "label": "Avoid acknowledging the pivot to prevent further questions."
      },
      {
        "id": "d",
        "label": "Ask dissatisfied team members to leave the project immediately without conversation."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because transparent communication and connecting roles to the new mission help team members re-engage or make informed choices. Option b is incorrect because dismissing concerns harms trust. Option c is incorrect because ignoring the pivot increases confusion. Option d is incorrect because pushing people out without discussion may lose valuable talent unnecessarily.",
    "difficulty": "medium",
    "topics": [
      "mission pivot",
      "change leadership"
    ]
  }
]
