[
  {
    "id": "q-people-2-5-001",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team is facing a tight deadline and morale is dropping. How can the project manager inspire and motivate the team?",
    "options": [
      {
        "id": "b",
        "label": "Acknowledge the challenge, connect the work to meaningful outcomes, and celebrate small wins along the way."
      },
      {
        "id": "a",
        "label": "Ignore morale and focus only on reminding them of the deadline."
      },
      {
        "id": "c",
        "label": "Threaten penalties if the deadline is missed."
      },
      {
        "id": "d",
        "label": "Avoid communicating to reduce pressure on the team."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because recognizing effort, reinforcing purpose, and celebrating progress boost intrinsic motivation. Option a is incorrect because ignoring morale can lead to burnout. Option c is incorrect because threats create fear rather than engagement. Option d is incorrect because silence increases uncertainty.",
    "difficulty": "easy",
    "topics": [
      "motivation",
      "recognition"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-002",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A high-performing team member feels their contributions are not visible. What should the project manager do to influence and motivate effectively?",
    "options": [
      {
        "id": "b",
        "label": "Publicly recognize their contributions while also acknowledging the team, and discuss growth opportunities."
      },
      {
        "id": "a",
        "label": "Tell them that recognition is not important as long as work is done."
      },
      {
        "id": "c",
        "label": "Ask them to stop seeking feedback about their impact."
      },
      {
        "id": "d",
        "label": "Give them additional tasks without discussing recognition."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because visible recognition and development discussions support motivation and retention. Option a is incorrect because dismissing recognition needs is demotivating. Option c is incorrect because discouraging feedback closes communication. Option d is incorrect because more tasks without recognition can feel like exploitation.",
    "difficulty": "medium",
    "topics": [
      "recognition",
      "influence"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-003",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "Some stakeholders are skeptical about the project's value. How can the project manager influence them positively?",
    "options": [
      {
        "id": "b",
        "label": "Share evidence of benefits, listen to concerns, and adjust messaging to address their priorities."
      },
      {
        "id": "a",
        "label": "Ignore the stakeholders and hope they will see value later."
      },
      {
        "id": "c",
        "label": "Confront them publicly and label them as blockers."
      },
      {
        "id": "d",
        "label": "Avoid discussing benefits to prevent debate."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because influencing involves understanding concerns and tailoring messages to stakeholder interests. Option a is incorrect because ignoring skeptics can lead to resistance later. Option c is incorrect because public confrontation can damage relationships. Option d is incorrect because avoiding benefit discussions misses an opportunity to build support.",
    "difficulty": "medium",
    "topics": [
      "stakeholder influence",
      "benefits communication"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-004",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team appears disengaged during sprint reviews. What should the project manager do to re-energize them?",
    "options": [
      {
        "id": "b",
        "label": "Invite the team to showcase their work, share user feedback, and involve them in discussing impact."
      },
      {
        "id": "a",
        "label": "Run the reviews alone and present on behalf of the team."
      },
      {
        "id": "c",
        "label": "Shorten reviews to remove all discussion and only show metrics."
      },
      {
        "id": "d",
        "label": "Stop sprint reviews entirely to free up time."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because giving the team ownership in demonstrating value and hearing user reactions increases engagement. Option a is incorrect because sidelining the team reduces visibility and pride. Option c is incorrect because removing discussion reduces connection to outcomes. Option d is incorrect because cancelling reviews removes an important feedback loop.",
    "difficulty": "easy",
    "topics": [
      "engagement",
      "sprint review"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-005",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "After several setbacks, the team doubts they can still succeed. How should the project manager influence and motivate them?",
    "options": [
      {
        "id": "b",
        "label": "Acknowledge the setbacks, highlight past successes, and co-create a realistic plan that restores confidence."
      },
      {
        "id": "a",
        "label": "Deny the setbacks and insist everything is fine."
      },
      {
        "id": "c",
        "label": "Blame the team for the setbacks in front of stakeholders."
      },
      {
        "id": "d",
        "label": "Avoid discussing performance to keep conversations comfortable."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because honest acknowledgement, recognition of strengths, and a credible plan help rebuild belief. Option a is incorrect because denial erodes trust. Option c is incorrect because public blame damages morale and relationships. Option d is incorrect because avoiding performance discussions prevents learning and improvement.",
    "difficulty": "hard",
    "topics": [
      "resilience",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-006",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team completed a challenging release, but leaders quickly move to the next project without acknowledging their effort. How should the project manager respond to sustain motivation?",
    "options": [
      {
        "id": "b",
        "label": "Organize a brief celebration, highlight specific contributions, and share positive feedback from stakeholders."
      },
      {
        "id": "a",
        "label": "Tell the team that recognition is unnecessary because delivery is expected."
      },
      {
        "id": "c",
        "label": "Avoid mentioning the release to keep focus on upcoming work."
      },
      {
        "id": "d",
        "label": "Privately praise only the top performers and ignore the rest."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because recognizing effort and sharing appreciation reinforces commitment and morale. Option a is incorrect because dismissing recognition needs can make work feel thankless. Option c is incorrect because skipping acknowledgment overlooks a chance to reinforce positive behavior. Option d is incorrect because singling out only a few people can demotivate others who contributed.",
    "difficulty": "easy",
    "topics": [
      "recognition",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-007",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A key stakeholder is lukewarm about the project. What influencing approach should the project manager take?",
    "options": [
      {
        "id": "c",
        "label": "Understand the stakeholder's goals, show how project benefits align with them, and involve them in shaping outcomes."
      },
      {
        "id": "b",
        "label": "Demand support because the project is approved and funded."
      },
      {
        "id": "a",
        "label": "Ignore the stakeholder since they are not enthusiastic."
      },
      {
        "id": "d",
        "label": "Rely only on formal status reports to change their mind."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because effective influence focuses on the other party's interests and co-creation. Option b is incorrect because forcing support can create resistance. Option a is incorrect because lukewarm stakeholders can significantly impact success. Option d is incorrect because one-way reporting is rarely enough to shift attitudes.",
    "difficulty": "medium",
    "topics": [
      "stakeholder influence",
      "benefits"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-008",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team is losing energy during long planning sessions. What should the project manager do to keep them engaged?",
    "options": [
      {
        "id": "c",
        "label": "Break sessions into shorter blocks, reconnect discussions to customer outcomes, and vary facilitation techniques."
      },
      {
        "id": "b",
        "label": "Increase the length of planning sessions so all details are covered at once."
      },
      {
        "id": "a",
        "label": "Remove team participation and perform planning alone."
      },
      {
        "id": "d",
        "label": "Ignore engagement levels because planning is mandatory."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because structuring sessions for energy and linking topics to impact keeps people involved. Option b is incorrect because longer sessions can further reduce focus. Option a is incorrect because excluding the team undermines ownership. Option d is incorrect because disregarding engagement hurts quality.",
    "difficulty": "medium",
    "topics": [
      "engagement",
      "planning"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-009",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A team member is demotivated after their proposal was not selected. How can the project manager keep them engaged?",
    "options": [
      {
        "id": "c",
        "label": "Explain the decision respectfully, acknowledge the value of their idea, and invite them to contribute to future options."
      },
      {
        "id": "b",
        "label": "Tell them their idea was poor and they should accept it."
      },
      {
        "id": "a",
        "label": "Avoid discussing the decision to prevent discomfort."
      },
      {
        "id": "d",
        "label": "Exclude them from future ideation sessions to avoid conflict."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because transparent, respectful feedback and ongoing involvement maintain motivation. Option b is incorrect because belittling ideas damages confidence. Option a is incorrect because silence leaves concerns unresolved. Option d is incorrect because exclusion reduces engagement further.",
    "difficulty": "easy",
    "topics": [
      "motivation",
      "feedback"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-010",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The project requires a temporary push to meet a critical date. How can the project manager motivate the team ethically?",
    "options": [
      {
        "id": "c",
        "label": "Explain the importance of the deadline, agree on a time-bound effort, and commit to recovery time afterward."
      },
      {
        "id": "b",
        "label": "Impose mandatory overtime indefinitely without discussion."
      },
      {
        "id": "a",
        "label": "Use fear of negative performance reviews to force extra work."
      },
      {
        "id": "d",
        "label": "Promise unspecified rewards that may not materialize."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because honest framing and time-bounded effort respect the team while addressing urgency. Option b is incorrect because open-ended overtime is unsustainable. Option a is incorrect because fear-based tactics harm trust. Option d is incorrect because vague promises can feel manipulative.",
    "difficulty": "medium",
    "topics": [
      "ethical motivation",
      "deadlines"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-011",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "Stakeholders seem disengaged from demos and rarely attend reviews. What can the project manager do to influence greater engagement?",
    "options": [
      {
        "id": "c",
        "label": "Discuss with stakeholders what they need from demos and adjust format, timing, or content to better meet their interests."
      },
      {
        "id": "b",
        "label": "Continue running demos the same way, assuming attendance will improve on its own."
      },
      {
        "id": "a",
        "label": "Cancel demos and rely only on written reports."
      },
      {
        "id": "d",
        "label": "Publicly criticize stakeholders for not attending."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because tailoring interactions to stakeholder needs increases perceived value and participation. Option b is incorrect because repeating an ineffective format is unlikely to change engagement. Option a is incorrect because removing demos reduces live feedback. Option d is incorrect because criticism may damage relationships.",
    "difficulty": "medium",
    "topics": [
      "stakeholder engagement",
      "influence"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-012",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A team member who used to be highly engaged has become quiet and withdrawn. What should the project manager do to support them?",
    "options": [
      {
        "id": "c",
        "label": "Have a private conversation to understand what changed and explore how to re-engage them."
      },
      {
        "id": "b",
        "label": "Assume they will return to normal without any discussion."
      },
      {
        "id": "a",
        "label": "Publicly call them out in meetings for not speaking enough."
      },
      {
        "id": "d",
        "label": "Assign the least interesting tasks to push them to leave."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because caring inquiry can surface issues and allow supportive actions. Option b is incorrect because inaction may let problems worsen. Option a is incorrect because public criticism can embarrass them and reduce trust. Option d is incorrect because intentionally pushing someone away is unethical.",
    "difficulty": "easy",
    "topics": [
      "motivation",
      "one-on-one"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-013",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team's work directly impacts end users, but they rarely hear user stories. How can the project manager inspire them?",
    "options": [
      {
        "id": "d",
        "label": "Share user feedback, stories, and metrics that show how the product improves users' lives."
      },
      {
        "id": "b",
        "label": "Keep user information limited to the product owner."
      },
      {
        "id": "c",
        "label": "Focus only on technical metrics like defect counts."
      },
      {
        "id": "a",
        "label": "Avoid discussing users to stay neutral."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because connecting work to real user impact strengthens purpose and motivation. Option b is incorrect because hoarding user insight reduces meaning for the team. Option c is incorrect because technical metrics alone do not convey impact. Option a is incorrect because avoiding user context misses an inspiration opportunity.",
    "difficulty": "medium",
    "topics": [
      "purpose",
      "user impact"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-014",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "Some team members feel that decisions are made only based on cost, not on value. How can the project manager influence decision making?",
    "options": [
      {
        "id": "d",
        "label": "Introduce value-based discussions, including benefits and risks, when presenting options to decision makers."
      },
      {
        "id": "b",
        "label": "Focus exclusively on cost in all analysis."
      },
      {
        "id": "c",
        "label": "Avoid participating in decisions to remain neutral."
      },
      {
        "id": "a",
        "label": "Discourage team members from questioning decision criteria."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because presenting balanced information about value helps shift decisions beyond cost alone. Option b is incorrect because cost-only analysis can lead to suboptimal choices. Option c is incorrect because withdrawing influence forfeits a chance to improve decisions. Option a is incorrect because discouraging questions stifles constructive challenge.",
    "difficulty": "hard",
    "topics": [
      "value-based decisions",
      "influence"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-015",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "Two teams must collaborate, but they each think their work is more important. How can the project manager influence both teams toward shared goals?",
    "options": [
      {
        "id": "d",
        "label": "Facilitate a joint session to clarify shared outcomes and how each team's contributions are essential."
      },
      {
        "id": "b",
        "label": "Tell each team separately that their work is the top priority."
      },
      {
        "id": "c",
        "label": "Avoid intervening and let competition continue."
      },
      {
        "id": "a",
        "label": "Assign blame to one team for the tension."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because focusing on shared outcomes helps both teams see interdependence and align efforts. Option b is incorrect because conflicting messages undermine trust. Option c is incorrect because unmanaged competition can harm collaboration. Option a is incorrect because blame does not resolve misalignment.",
    "difficulty": "medium",
    "topics": [
      "shared goals",
      "cross-team influence"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-016",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A sponsor is concerned about slow progress. How can the project manager influence their perception constructively?",
    "options": [
      {
        "id": "d",
        "label": "Explain progress in terms of delivered value, show plans to address bottlenecks, and agree on realistic expectations."
      },
      {
        "id": "b",
        "label": "Downplay issues and provide only optimistic updates."
      },
      {
        "id": "c",
        "label": "Blame the team for delays in front of the sponsor."
      },
      {
        "id": "a",
        "label": "Avoid meeting with the sponsor to minimize difficult conversations."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because transparent, value-focused communication can rebuild confidence and align expectations. Option b is incorrect because sugarcoating erodes trust when reality surfaces. Option c is incorrect because blaming the team damages morale and does not solve problems. Option a is incorrect because avoiding engagement leaves concerns unaddressed.",
    "difficulty": "hard",
    "topics": [
      "sponsor influence",
      "status communication"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-017",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team finds a repetitive manual task frustrating. How can the project manager use this to inspire improvement?",
    "options": [
      {
        "id": "d",
        "label": "Challenge the team to propose automation or process changes and support experiments to reduce the manual work."
      },
      {
        "id": "b",
        "label": "Tell them to accept the task as part of the job permanently."
      },
      {
        "id": "c",
        "label": "Rotate the task among members without exploring improvements."
      },
      {
        "id": "a",
        "label": "Ignore the frustration because the task is low risk."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because turning frustration into a continuous improvement opportunity engages the team's creativity. Option b is incorrect because resignation undermines motivation. Option c is incorrect because rotation alone does not remove the waste. Option a is incorrect because ignoring frustration can lead to disengagement.",
    "difficulty": "medium",
    "topics": [
      "continuous improvement",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-018",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A core team member is considering leaving due to lack of growth opportunities. How should the project manager respond to influence retention?",
    "options": [
      {
        "id": "d",
        "label": "Discuss their goals, identify stretch assignments or training, and create a development plan aligned with project needs."
      },
      {
        "id": "b",
        "label": "Remind them that leaving will create more work for the team."
      },
      {
        "id": "c",
        "label": "Discourage them from discussing career aspirations at work."
      },
      {
        "id": "a",
        "label": "Ignore their concern because retention is HR's responsibility."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because supporting growth is a powerful motivator and can improve retention. Option b is incorrect because guilt-based arguments may backfire. Option c is incorrect because suppressing career discussions reduces openness. Option a is incorrect because leaders share responsibility for engagement and retention.",
    "difficulty": "hard",
    "topics": [
      "retention",
      "development"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-019",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team is proud of a prototype, but leadership questions its value. How can the project manager advocate effectively?",
    "options": [
      {
        "id": "a",
        "label": "Explain how the prototype tests assumptions, share early feedback, and propose next steps that balance risk and value."
      },
      {
        "id": "b",
        "label": "Dismiss leadership concerns and insist the prototype is valuable."
      },
      {
        "id": "c",
        "label": "Avoid mentioning the prototype in future discussions."
      },
      {
        "id": "d",
        "label": "Ask the team to stop sharing prototypes with leadership."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because framing prototypes in terms of validated learning and risk reduction makes value more visible. Option b is incorrect because dismissing concerns harms credibility. Option c is incorrect because hiding work reduces transparency. Option d is incorrect because withholding prototypes removes opportunities for feedback.",
    "difficulty": "medium",
    "topics": [
      "advocacy",
      "influence"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-020",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The project manager wants to encourage more peer-to-peer recognition on the team. What approach is most effective?",
    "options": [
      {
        "id": "a",
        "label": "Introduce simple ways for team members to recognize each other and model this behavior regularly."
      },
      {
        "id": "b",
        "label": "Rely solely on annual performance reviews for recognition."
      },
      {
        "id": "c",
        "label": "Expect peers to recognize each other without any prompts or examples."
      },
      {
        "id": "d",
        "label": "Limit recognition to formal management announcements only."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because creating channels and role-modeling peer recognition embeds it in the culture. Option b is incorrect because yearly reviews are too infrequent to sustain motivation. Option c is incorrect because without prompts, recognition habits may not form. Option d is incorrect because top-down recognition alone misses the power of peer appreciation.",
    "difficulty": "easy",
    "topics": [
      "peer recognition",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-021",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The team is overwhelmed by a long list of priorities and cannot see progress. How can the project manager re-inspire focus?",
    "options": [
      {
        "id": "a",
        "label": "Help the team identify a small number of high-impact goals and track visible progress against them."
      },
      {
        "id": "b",
        "label": "Remind the team that all tasks are equally important and must be done at once."
      },
      {
        "id": "c",
        "label": "Avoid discussing priorities and let the team choose work randomly."
      },
      {
        "id": "d",
        "label": "Set goals privately and not share them, to reduce pressure."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because narrowing focus and making progress visible helps restore a sense of momentum. Option b is incorrect because treating everything as equally urgent increases stress and confusion. Option c is incorrect because random work selection undermines outcomes. Option d is incorrect because hidden goals do not motivate the team.",
    "difficulty": "medium",
    "topics": [
      "focus",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-022",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A new vision from leadership significantly raises expectations. How should the project manager influence the team's response?",
    "options": [
      {
        "id": "a",
        "label": "Translate the vision into clear, achievable milestones and involve the team in shaping how to reach them."
      },
      {
        "id": "b",
        "label": "Announce the vision without details and expect the team to \"figure it out\"."
      },
      {
        "id": "c",
        "label": "Downplay the vision to avoid worrying the team."
      },
      {
        "id": "d",
        "label": "Tell the team that the vision is aspirational and does not affect their work."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because connecting high-level vision to practical steps and inviting input helps the team engage constructively. Option b is incorrect because vague expectations cause confusion. Option c is incorrect because minimizing change may lead to misalignment. Option d is incorrect because suggesting the vision does not matter undermines leadership and clarity.",
    "difficulty": "hard",
    "topics": [
      "vision",
      "influence"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-023",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "Feedback from users reveals that a feature the team was excited about is rarely used. How can the project manager use this to motivate improvement instead of discouragement?",
    "options": [
      {
        "id": "a",
        "label": "Frame the feedback as learning, involve the team in analyzing why usage is low, and co-create options to increase value."
      },
      {
        "id": "b",
        "label": "Ignore the feedback because it might demotivate the team."
      },
      {
        "id": "c",
        "label": "Tell the team their work was a failure and move on."
      },
      {
        "id": "d",
        "label": "Avoid sharing user data to prevent difficult conversations."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because viewing feedback as a chance to improve engages the team in problem solving. Option b is incorrect because hiding feedback wastes insight. Option c is incorrect because labeling work a failure can demoralize the team. Option d is incorrect because withholding data disconnects the team from impact.",
    "difficulty": "medium",
    "topics": [
      "feedback",
      "continuous improvement"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-024",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "A new initiative competes with your project for resources. How can the project manager influence stakeholders to keep the team motivated?",
    "options": [
      {
        "id": "a",
        "label": "Clearly present the project's benefits, trade-offs, and risks of de-prioritizing it, and advocate for a balanced decision."
      },
      {
        "id": "b",
        "label": "Tell the team that senior leaders do not value their project."
      },
      {
        "id": "c",
        "label": "Avoid talking about the competition to keep the team uninformed."
      },
      {
        "id": "d",
        "label": "Promise the team that their project will win without engaging stakeholders."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because principled advocacy helps stakeholders make informed decisions and shows the team that leadership is representing them. Option b is incorrect because suggesting leaders do not care undermines trust. Option c is incorrect because lack of transparency can increase anxiety. Option d is incorrect because promises without stakeholder engagement may be unrealistic.",
    "difficulty": "hard",
    "topics": [
      "stakeholder advocacy",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-2-5-025",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-5"
    ],
    "text": "The project is nearing completion and some team members worry that their work will no longer be needed. How can the project manager support and influence them positively?",
    "options": [
      {
        "id": "a",
        "label": "Discuss transition plans, highlight the value of their contributions, and explore future opportunities or projects with them."
      },
      {
        "id": "b",
        "label": "Avoid the topic of project end to prevent discomfort."
      },
      {
        "id": "c",
        "label": "Tell them that concern about the future is unprofessional."
      },
      {
        "id": "d",
        "label": "Inform them that their work is finished and leave career discussions to others."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because acknowledging concerns and supporting next steps helps maintain trust and motivation through closure. Option b is incorrect because silence can increase uncertainty. Option c is incorrect because dismissing concerns is unsupportive. Option d is incorrect because leaders play a role in helping people transition, not only in delivering scope.",
    "difficulty": "medium",
    "topics": [
      "transition",
      "motivation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]
