[
  {
    "id": "q-people-2-3-001",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team is experiencing low morale and feels unsupported. How can the project manager demonstrate servant leadership?",
    "options": [
      {
        "id": "a",
        "label": "Ask what is blocking the team, remove impediments, and provide resources they identify as needed."
      },
      {
        "id": "b",
        "label": "Increase oversight and micromanage daily tasks."
      },
      {
        "id": "c",
        "label": "Tell the team to \"just work harder\" without changes."
      },
      {
        "id": "d",
        "label": "Delegate all leadership responsibilities to the sponsor."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders focus on enabling the team by removing obstacles and providing support. Option b is incorrect because micromanagement reduces autonomy and motivation. Option c is incorrect because demanding more effort without support ignores root causes. Option d is incorrect because abdicating leadership removes local support.",
    "difficulty": "easy",
    "topics": [
      "servant leadership",
      "impediment removal"
    ]
  },
  {
    "id": "q-people-2-3-002",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Team members are hesitant to raise impediments. What servant leadership behavior should the project manager show?",
    "options": [
      {
        "id": "a",
        "label": "Model vulnerability by sharing their own challenges and inviting open discussion of issues."
      },
      {
        "id": "b",
        "label": "Criticize anyone who mentions problems in public."
      },
      {
        "id": "c",
        "label": "Tell the team that impediments are a sign of weakness."
      },
      {
        "id": "d",
        "label": "Ignore impediments and rely on escalation only through formal channels."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because modeling openness and vulnerability encourages others to speak up. Option b is incorrect because criticism discourages transparency. Option c is incorrect because equating impediments with weakness reduces learning. Option d is incorrect because relying only on formal escalations delays action.",
    "difficulty": "medium",
    "topics": [
      "servant leadership",
      "psychological safety"
    ]
  },
  {
    "id": "q-people-2-3-003",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A senior leader suggests taking credit for the team’s success without mentioning them. How should a servant leader respond?",
    "options": [
      {
        "id": "a",
        "label": "Highlight the team’s contributions and insist on sharing credit with them."
      },
      {
        "id": "b",
        "label": "Agree to take credit alone to improve personal visibility."
      },
      {
        "id": "c",
        "label": "Avoid mentioning the team to keep reports simple."
      },
      {
        "id": "d",
        "label": "Ignore the suggestion and submit reports without acknowledging anyone."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders elevate the team and recognize their contributions. Option b is incorrect because taking sole credit undermines trust. Option c is incorrect because omitting the team hides their effort. Option d is incorrect because ignoring recognition misses an opportunity to motivate.",
    "difficulty": "hard",
    "topics": [
      "recognition",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-004",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team is struggling with a blocker that requires cross-functional coordination. What is a servant leadership response?",
    "options": [
      {
        "id": "a",
        "label": "Use your network to connect the right people and stay engaged until the blocker is removed."
      },
      {
        "id": "b",
        "label": "Tell the team to handle it alone without support."
      },
      {
        "id": "c",
        "label": "Wait for someone else in the organization to notice the issue."
      },
      {
        "id": "d",
        "label": "Document the blocker but take no action."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders actively help remove cross-team obstacles. Option b is incorrect because abandoning the team contradicts servant leadership. Option c is incorrect because waiting passively delays resolution. Option d is incorrect because documentation alone does not clear the blocker.",
    "difficulty": "medium",
    "topics": [
      "impediments",
      "cross-functional support"
    ]
  },
  {
    "id": "q-people-2-3-005",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Several team members ask for clearer growth opportunities. What should a servant leader project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Discuss development goals individually and look for ways to align work assignments with growth."
      },
      {
        "id": "b",
        "label": "Explain that growth is outside the scope of project leadership."
      },
      {
        "id": "c",
        "label": "Discourage discussions about development to keep focus on tasks."
      },
      {
        "id": "d",
        "label": "Assign extra work without considering development goals."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because serving the team includes supporting their development when possible. Option b is incorrect because leadership influences growth even if HR owns formal paths. Option c is incorrect because avoiding development discussions limits engagement. Option d is incorrect because extra work without purpose can demotivate.",
    "difficulty": "medium",
    "topics": [
      "servant leadership",
      "development"
    ]
  },
  {
    "id": "q-people-2-3-006",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team reports that their biggest pain point is slow access to test environments, which leadership has not prioritized. What should a servant leader project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Collect evidence of the impact, advocate for improvement with leadership, and help remove the environment bottleneck."
      },
      {
        "id": "b",
        "label": "Tell the team to be patient because environment issues are common."
      },
      {
        "id": "c",
        "label": "Ask the team to work overtime to compensate without addressing the cause."
      },
      {
        "id": "d",
        "label": "Avoid raising the issue to maintain a good relationship with leadership."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders act to remove obstacles that slow the team, using data to build a case for change. Option b is incorrect because accepting chronic pain points keeps productivity low. Option c is incorrect because overtime treats symptoms instead of root causes and risks burnout. Option d is incorrect because avoiding escalation leaves the team unsupported.",
    "difficulty": "medium",
    "topics": [
      "servant leadership",
      "impediment advocacy"
    ]
  },
  {
    "id": "q-people-2-3-007",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Team members say they rarely receive recognition except when things go wrong. How should a servant leader respond?",
    "options": [
      {
        "id": "a",
        "label": "Introduce regular, specific recognition of positive behaviors and outcomes during ceremonies and updates."
      },
      {
        "id": "b",
        "label": "Explain that pay is their only form of recognition and nothing else is needed."
      },
      {
        "id": "c",
        "label": "Reserve feedback solely for failures to keep standards high."
      },
      {
        "id": "d",
        "label": "Delegate all recognition to HR and avoid direct involvement."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because consistent, specific recognition from leaders supports motivation and morale. Option b is incorrect because relying only on pay ignores intrinsic motivators. Option c is incorrect because focusing on failures creates a negative culture. Option d is incorrect because servant leaders are directly engaged in appreciating the team.",
    "difficulty": "easy",
    "topics": [
      "servant leadership",
      "recognition"
    ]
  },
  {
    "id": "q-people-2-3-008",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team is unclear which impediments the project manager will handle versus what they should solve themselves. What is a servant leadership action?",
    "options": [
      {
        "id": "a",
        "label": "Clarify expectations, encourage the team to solve what they can, and commit to escalating issues beyond their reach."
      },
      {
        "id": "b",
        "label": "Take over all problem solving personally to show leadership."
      },
      {
        "id": "c",
        "label": "Ask the team to resolve every issue without support."
      },
      {
        "id": "d",
        "label": "Wait for the team to clarify roles on their own over time."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because defining shared responsibilities empowers the team while ensuring support where needed. Option b is incorrect because doing everything yourself undermines team ownership. Option c is incorrect because abandoning them contradicts servant leadership. Option d is incorrect because passively waiting prolongs confusion.",
    "difficulty": "medium",
    "topics": [
      "role clarity",
      "impediment ownership"
    ]
  },
  {
    "id": "q-people-2-3-009",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A cross-functional team struggles to coordinate work across functions. What would a servant leader do?",
    "options": [
      {
        "id": "a",
        "label": "Facilitate cross-functional planning and daily collaboration until the team builds better coordination habits."
      },
      {
        "id": "b",
        "label": "Assign blame to whichever function seems to be late most often."
      },
      {
        "id": "c",
        "label": "Avoid joining cross-functional sessions so the team can \"figure it out\" alone."
      },
      {
        "id": "d",
        "label": "Reduce cross-functional work by re-introducing strict silos."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders help teams establish practices that improve collaboration and then gradually step back. Option b is incorrect because blame creates defensiveness rather than improvement. Option c is incorrect because complete absence may leave teams stuck. Option d is incorrect because re-creating silos undermines agile and collaborative principles.",
    "difficulty": "medium",
    "topics": [
      "cross-functional teams",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-010",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A team member shares that they feel overloaded but worries about disappointing the project manager. What is a servant leader response?",
    "options": [
      {
        "id": "a",
        "label": "Listen without judgment, adjust workload where possible, and thank them for raising the concern."
      },
      {
        "id": "b",
        "label": "Tell them that workload is fixed and they should manage stress privately."
      },
      {
        "id": "c",
        "label": "Suggest they stop raising concerns if they want good evaluations."
      },
      {
        "id": "d",
        "label": "Ignore the comment and continue assigning tasks as before."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because supporting wellbeing and responding to concerns demonstrates care and encourages openness. Option b is incorrect because dismissing stress fosters burnout. Option c is incorrect because linking concerns to negative evaluations discourages transparency. Option d is incorrect because inaction ignores a clear signal.",
    "difficulty": "easy",
    "topics": [
      "wellbeing",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-011",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The project manager notices that they speak first in every meeting, and the team rarely disagrees. What should a servant leader do?",
    "options": [
      {
        "id": "a",
        "label": "Deliberately speak last, invite alternative views, and create space for others to lead discussions."
      },
      {
        "id": "b",
        "label": "Maintain the pattern because it keeps meetings efficient."
      },
      {
        "id": "c",
        "label": "Discourage team members from bringing different perspectives to avoid conflict."
      },
      {
        "id": "d",
        "label": "Reduce the number of meetings to limit team input."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because stepping back and encouraging others to contribute fosters ownership and better ideas. Option b is incorrect because over-dominance suppresses contributions. Option c is incorrect because discouraging differing views reduces learning. Option d is incorrect because fewer meetings without changed behavior does not solve the underlying issue.",
    "difficulty": "medium",
    "topics": [
      "servant leadership",
      "facilitation"
    ]
  },
  {
    "id": "q-people-2-3-012",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Leadership suggests imposing a solution on the team for a complex problem. How would a servant leader prefer to approach this?",
    "options": [
      {
        "id": "a",
        "label": "Advocate for involving the team in exploring options and present their insights to leadership."
      },
      {
        "id": "b",
        "label": "Accept the imposed solution immediately without consulting the team."
      },
      {
        "id": "c",
        "label": "Keep the team unaware of leadership’s ideas to avoid debate."
      },
      {
        "id": "d",
        "label": "Ask the team to implement the solution without explaining the reasoning."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because engaging the team respects their expertise and can improve the solution while still aligning with leadership. Option b is incorrect because bypassing the team reduces buy-in. Option c is incorrect because withholding information erodes trust. Option d is incorrect because lack of context undermines motivation and quality.",
    "difficulty": "hard",
    "topics": [
      "servant leadership",
      "leadership alignment"
    ]
  },
  {
    "id": "q-people-2-3-013",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A team member suggests an improvement that could reduce manual work, but the project manager is busy. What should a servant leader do?",
    "options": [
      {
        "id": "a",
        "label": "Prioritize understanding the suggestion, help evaluate it, and support implementation if it benefits the team."
      },
      {
        "id": "b",
        "label": "Dismiss the idea because it was not in the original plan."
      },
      {
        "id": "c",
        "label": "Ask the team member to drop the idea to avoid distraction."
      },
      {
        "id": "d",
        "label": "Delegate the suggestion to another project without follow-up."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders value team-generated improvements that remove waste. Option b is incorrect because rigidity hampers continuous improvement. Option c is incorrect because discouraging ideas diminishes engagement. Option d is incorrect because passing it off without follow-up may stall progress.",
    "difficulty": "medium",
    "topics": [
      "continuous improvement",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-014",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Team members are unclear about how decisions are made and feel excluded. What is a servant leader’s action?",
    "options": [
      {
        "id": "a",
        "label": "Clarify decision-making processes, share who is involved for which decisions, and invite feedback on the approach."
      },
      {
        "id": "b",
        "label": "Keep decision processes opaque to maintain control."
      },
      {
        "id": "c",
        "label": "Inform the team that decisions are confidential and not their concern."
      },
      {
        "id": "d",
        "label": "Reduce communication about decisions to avoid questions."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because transparency and feedback about decisions build trust and engagement. Option b is incorrect because opacity breeds mistrust. Option c is incorrect because declaring decisions off-limits signals disregard for the team. Option d is incorrect because reducing communication worsens exclusion.",
    "difficulty": "medium",
    "topics": [
      "decision transparency",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-015",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team is hesitant to experiment with new ideas because they fear blame if experiments fail. How can the project manager act as a servant leader?",
    "options": [
      {
        "id": "a",
        "label": "Frame experiments as learning opportunities, protect the team when outcomes are not ideal, and focus on what was learned."
      },
      {
        "id": "b",
        "label": "Discourage experiments and require only proven approaches."
      },
      {
        "id": "c",
        "label": "Punish failed experiments to reinforce high standards."
      },
      {
        "id": "d",
        "label": "Avoid discussing experiments to keep risk low."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because psychological safety around experiments helps teams innovate. Option b is incorrect because banning experimentation limits improvement. Option c is incorrect because punishment discourages future learning. Option d is incorrect because not discussing experiments hides risk-taking and learning.",
    "difficulty": "medium",
    "topics": [
      "experimentation",
      "safety"
    ]
  },
  {
    "id": "q-people-2-3-016",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "During a retrospective, most actions identified require management support. What should a servant leader do?",
    "options": [
      {
        "id": "a",
        "label": "Help prioritize actions, sponsor them with leadership, and communicate progress back to the team."
      },
      {
        "id": "b",
        "label": "Advise the team to ignore actions that need management involvement."
      },
      {
        "id": "c",
        "label": "Tell the team that management concerns will be handled, but never follow up."
      },
      {
        "id": "d",
        "label": "Ask the team to stop proposing actions that require support."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders bridge the gap between team needs and management, ensuring actions move forward. Option b is incorrect because ignoring these actions wastes insight. Option c is incorrect because unfulfilled promises erode trust. Option d is incorrect because limiting suggestions restricts improvement.",
    "difficulty": "medium",
    "topics": [
      "retrospective actions",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-017",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A new project manager joins a team with existing practices. What is a servant leader’s first step?",
    "options": [
      {
        "id": "a",
        "label": "Observe and listen to understand current practices and needs before suggesting changes."
      },
      {
        "id": "b",
        "label": "Immediately replace existing practices with their preferred methods."
      },
      {
        "id": "c",
        "label": "Avoid meeting the team to stay objective."
      },
      {
        "id": "d",
        "label": "Ask the sponsor which practices to remove without consulting the team."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders seek to understand before changing systems, showing respect for existing experience. Option b is incorrect because imposing changes can create resistance. Option c is incorrect because avoiding the team prevents understanding. Option d is incorrect because removing practices without team input may discard what works.",
    "difficulty": "easy",
    "topics": [
      "servant leadership",
      "joining a team"
    ]
  },
  {
    "id": "q-people-2-3-018",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A team member often volunteers to support others but is not getting help when they are stuck. How should a servant leader respond?",
    "options": [
      {
        "id": "a",
        "label": "Highlight the importance of mutual support and ensure the team makes time to assist them as well."
      },
      {
        "id": "b",
        "label": "Encourage the member to keep helping others without expecting support."
      },
      {
        "id": "c",
        "label": "Advise them to stop helping others to protect their capacity."
      },
      {
        "id": "d",
        "label": "Ignore the imbalance and let team dynamics evolve on their own."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because promoting reciprocity and balanced support strengthens team cohesion. Option b is incorrect because one-sided support can lead to burnout. Option c is incorrect because advising withdrawal removes a positive behavior rather than fixing imbalance. Option d is incorrect because inaction allows unfair patterns to persist.",
    "difficulty": "medium",
    "topics": [
      "team support",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-019",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Leadership asks the project manager to prioritize status updates over time with the team. How should a servant leader respond?",
    "options": [
      {
        "id": "a",
        "label": "Explain the importance of time with the team, seek balance, and streamline status reporting where possible."
      },
      {
        "id": "b",
        "label": "Reduce time spent with the team to focus almost entirely on reporting upward."
      },
      {
        "id": "c",
        "label": "Ignore leadership’s request without discussion."
      },
      {
        "id": "d",
        "label": "Stop providing updates to leadership to focus only on the team."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because servant leaders protect time with the team while still meeting organizational needs, negotiating where needed. Option b is incorrect because distancing from the team undermines support. Option c is incorrect because ignoring leadership damages trust. Option d is incorrect because eliminating updates cuts necessary communication.",
    "difficulty": "hard",
    "topics": [
      "time balance",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-020",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team is unsure how their feedback from retrospectives is used. What servant leadership behavior should the project manager demonstrate?",
    "options": [
      {
        "id": "a",
        "label": "Close the loop by showing which actions were taken from feedback and explaining constraints when changes are not possible."
      },
      {
        "id": "b",
        "label": "Collect feedback but never share what happens with it."
      },
      {
        "id": "c",
        "label": "Stop collecting feedback to avoid raising expectations."
      },
      {
        "id": "d",
        "label": "Ask team members to send feedback anonymously without any follow-up."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because demonstrating responsiveness to feedback builds trust and encourages continued sharing. Option b is incorrect because silence suggests feedback is ignored. Option c is incorrect because ceasing feedback removes an improvement channel. Option d is incorrect because feedback without follow-up still leaves the team in the dark.",
    "difficulty": "medium",
    "topics": [
      "feedback loop",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-021",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A critical dependency on another team repeatedly causes delays. What would a servant leader project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Build relationships with the other team, jointly explore solutions, and help create a more reliable working agreement."
      },
      {
        "id": "b",
        "label": "Publicly blame the other team in every status report."
      },
      {
        "id": "c",
        "label": "Instruct the team to ignore the dependency and proceed regardless."
      },
      {
        "id": "d",
        "label": "Ask the team to work around the dependency entirely by taking on all the extra work."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because collaborating across boundaries to improve agreements addresses the root cause. Option b is incorrect because ongoing blame damages cross-team relationships. Option c is incorrect because ignoring dependencies is unrealistic. Option d is incorrect because absorbing all extra work may overload the team.",
    "difficulty": "hard",
    "topics": [
      "dependencies",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-022",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "Team members say they do not have enough context to make decisions. How can the project manager act as a servant leader?",
    "options": [
      {
        "id": "a",
        "label": "Share relevant background, constraints, and goals more transparently so the team can decide effectively."
      },
      {
        "id": "b",
        "label": "Retain all context and continue making decisions alone to save time."
      },
      {
        "id": "c",
        "label": "Remove decision-making responsibilities from the team altogether."
      },
      {
        "id": "d",
        "label": "Advise the team that context is not necessary for their role."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because providing context empowers the team, a core aspect of servant leadership. Option b is incorrect because hoarding information centralizes control unnecessarily. Option c is incorrect because removing decision-making reduces engagement. Option d is incorrect because context is essential for good decisions.",
    "difficulty": "medium",
    "topics": [
      "context sharing",
      "empowerment"
    ]
  },
  {
    "id": "q-people-2-3-023",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "A team member makes a mistake that impacts delivery. What is a servant leader’s response?",
    "options": [
      {
        "id": "a",
        "label": "Focus on understanding the system causes, support learning, and avoid public blame."
      },
      {
        "id": "b",
        "label": "Single them out publicly to deter future mistakes."
      },
      {
        "id": "c",
        "label": "Assign all future risky tasks to someone else without explanation."
      },
      {
        "id": "d",
        "label": "Ignore the incident and hope it does not recur."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because addressing systemic issues and fostering learning aligns with servant leadership. Option b is incorrect because public blame damages trust. Option c is incorrect because reassigning tasks quietly can feel punitive and does not improve the system. Option d is incorrect because ignoring issues invites repetition.",
    "difficulty": "medium",
    "topics": [
      "mistakes",
      "learning culture"
    ]
  },
  {
    "id": "q-people-2-3-024",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "The team’s improvement backlog is growing, but little time is dedicated to it. What should a servant leader do?",
    "options": [
      {
        "id": "a",
        "label": "Work with the team to reserve capacity for improvement items and remove obstacles to implementing them."
      },
      {
        "id": "b",
        "label": "Advise the team to stop proposing improvements and focus only on delivery."
      },
      {
        "id": "c",
        "label": "Treat the improvement backlog as optional and rarely review it."
      },
      {
        "id": "d",
        "label": "Defer all improvements to a future, unspecified phase."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because dedicating capacity and supporting improvements shows commitment to making work better for the team. Option b is incorrect because shutting down improvement ideas harms engagement. Option c is incorrect because rarely reviewing improvements prevents progress. Option d is incorrect because indefinite deferral is equivalent to inaction.",
    "difficulty": "medium",
    "topics": [
      "improvement backlog",
      "servant leadership"
    ]
  },
  {
    "id": "q-people-2-3-025",
    "domainId": "people",
    "taskId": "people-2",
    "enablerIds": [
      "e-people-2-3"
    ],
    "text": "After a period of heavy change, the team feels exhausted. What should a servant leader project manager prioritize?",
    "options": [
      {
        "id": "a",
        "label": "Discuss sustainable pace with the team, adjust plans where possible, and advocate for realistic expectations with stakeholders."
      },
      {
        "id": "b",
        "label": "Encourage working even longer hours to \"push through\" fatigue."
      },
      {
        "id": "c",
        "label": "Ignore feedback about exhaustion and continue at the same pace."
      },
      {
        "id": "d",
        "label": "Tell the team that rest can wait until after all changes are complete."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because supporting a sustainable pace and advocating for the team are central to servant leadership. Option b is incorrect because more hours worsen fatigue and risk quality. Option c is incorrect because disregarding exhaustion signals lack of care. Option d is incorrect because postponing rest indefinitely is not sustainable.",
    "difficulty": "medium",
    "topics": [
      "sustainable pace",
      "servant leadership"
    ]
  }
]
