[
  {
    "id": "q-people-4-2-001",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A key deliverable is behind schedule because tasks are started but not finished. What is the best first action for the project manager to support team task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Clarify task ownership, due dates, and completion criteria with the team and update the task board accordingly."
      },
      {
        "id": "b",
        "label": "Assign all remaining tasks to the project manager to ensure completion."
      },
      {
        "id": "c",
        "label": "Extend the deadline without discussing why tasks remain unfinished."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to decide who should own each task without consulting the team."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear ownership and completion criteria are foundational for accountability. Option b is incorrect because centralizing work undermines team ownership. Option c is incorrect because changing dates without addressing causes will not fix accountability issues. Option d is incorrect because bypassing the team reduces engagement.",
    "difficulty": "easy",
    "topics": [
      "ownership",
      "completion criteria"
    ]
  },
  {
    "id": "q-people-4-2-002",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "During standups, team members report vague progress such as \"working on it\" for several days. How can the project manager best support task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Ask for specific updates on what was completed, what remains, and whether any blockers require help."
      },
      {
        "id": "b",
        "label": "Accept vague updates and move on quickly to keep the meeting short."
      },
      {
        "id": "c",
        "label": "Stop holding standups and rely solely on email summaries."
      },
      {
        "id": "d",
        "label": "Assign a single team member to speak for everyone during standups."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because prompting for concrete progress and blockers reinforces accountability and transparency. Option b is incorrect because vague updates hide risk. Option c is incorrect because removing standups can reduce coordination. Option d is incorrect because one spokesperson limits individual accountability.",
    "difficulty": "easy",
    "topics": [
      "standups",
      "progress clarity"
    ]
  },
  {
    "id": "q-people-4-2-003",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A team member frequently takes on new work without finishing existing tasks. This creates bottlenecks. What should the project manager do to reinforce task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Discuss work-in-progress limits with the team member, agree on finishing existing tasks before starting new ones, and monitor follow-through."
      },
      {
        "id": "b",
        "label": "Praise the team member for enthusiasm and ignore the unfinished tasks."
      },
      {
        "id": "c",
        "label": "Assign all unfinished tasks to other team members without explanation."
      },
      {
        "id": "d",
        "label": "Reduce the visibility of tasks on the board to avoid drawing attention to the problem."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because setting expectations around limiting work and finishing tasks supports accountability and flow. Option b is incorrect because ignoring the issue will perpetuate it. Option c is incorrect because silently reassigning work may cause resentment. Option d is incorrect because hiding tasks reduces transparency.",
    "difficulty": "medium",
    "topics": [
      "WIP limits",
      "task completion"
    ]
  },
  {
    "id": "q-people-4-2-004",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The team agreed on a definition of done, but some members mark tasks as done without meeting all criteria. How can the project manager best support task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Review the definition of done with the team, reinforce why each item matters, and ensure everyone applies it consistently before closing tasks."
      },
      {
        "id": "b",
        "label": "Allow each team member to interpret \"done\" according to their personal preferences."
      },
      {
        "id": "c",
        "label": "Remove the definition of done to simplify the process."
      },
      {
        "id": "d",
        "label": "Close tasks for the team regardless of criteria to keep the board clean."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because common standards and shared understanding are central to accountability. Option b is incorrect because inconsistent definitions lead to quality issues. Option c is incorrect because removing standards reduces clarity. Option d is incorrect because closing tasks prematurely hides work and risk.",
    "difficulty": "medium",
    "topics": [
      "definition of done",
      "quality accountability"
    ]
  },
  {
    "id": "q-people-4-2-005",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "Several tasks were assigned verbally and later forgotten, leading to missed dependencies. What should the project manager do to reinforce task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Ensure all tasks are recorded in a visible system with clear owners and dates, and review them regularly with the team."
      },
      {
        "id": "b",
        "label": "Continue using verbal assignments and expect people to remember them."
      },
      {
        "id": "c",
        "label": "Rely on email threads as the only source of task information."
      },
      {
        "id": "d",
        "label": "Ask each person to track tasks privately in their own notebooks only."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a shared, visible task system with owners and dates supports accountability and coordination. Option b is incorrect because verbal tasks are easily forgotten. Option c is incorrect because emails are dispersed and hard to track. Option d is incorrect because private tracking reduces transparency.",
    "difficulty": "easy",
    "topics": [
      "task tracking",
      "visibility"
    ]
  },
  {
    "id": "q-people-4-2-006",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "Two team members jointly own an integration task. Each assumes the other will handle risk mitigation activities, and none are done. How should the project manager address accountability?",
    "options": [
      {
        "id": "a",
        "label": "Clarify specific responsibilities within the shared task so each person knows which activities they own."
      },
      {
        "id": "b",
        "label": "Tell both team members that shared ownership means no one is accountable."
      },
      {
        "id": "c",
        "label": "Remove both team members from the task and take it over personally."
      },
      {
        "id": "d",
        "label": "Ignore the gap as long as integration eventually completes."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because breaking down responsibilities within shared tasks restores clear accountability. Option b is incorrect because it undermines responsibility. Option c is incorrect because taking over may not be sustainable. Option d is incorrect because unmitigated risks can harm the project.",
    "difficulty": "medium",
    "topics": [
      "shared ownership",
      "responsibility clarity"
    ]
  },
  {
    "id": "q-people-4-2-007",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A senior team member repeatedly fails to update the status of tasks, making project reporting inaccurate. What should the project manager do to support accountability?",
    "options": [
      {
        "id": "a",
        "label": "Discuss the impact of missing updates with the senior member and agree on specific expectations and reminders for keeping status current."
      },
      {
        "id": "b",
        "label": "Manually update their tasks without informing them to avoid confrontation."
      },
      {
        "id": "c",
        "label": "Stop tracking task status because it is too difficult to maintain."
      },
      {
        "id": "d",
        "label": "Ask junior team members to update status on behalf of the senior member."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because direct dialogue and clear expectations are necessary to align behavior with accountability needs, even for senior staff. Option b is incorrect because silently correcting issues hides the problem. Option c is incorrect because abandoning tracking reduces control. Option d is incorrect because shifting responsibility without addressing the root cause is unfair.",
    "difficulty": "hard",
    "topics": [
      "status updates",
      "senior accountability"
    ]
  },
  {
    "id": "q-people-4-2-008",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The team has a kanban board, but cards often move directly from \"in progress\" to \"done\" without code review. What step can the project manager take to support task accountability for quality checks?",
    "options": [
      {
        "id": "a",
        "label": "Add an explicit \"code review\" column or policy and ensure tasks cannot be marked done until review is completed."
      },
      {
        "id": "b",
        "label": "Trust that developers are informally reviewing each other's work without verification."
      },
      {
        "id": "c",
        "label": "Remove the \"done\" column to simplify the board."
      },
      {
        "id": "d",
        "label": "Allow tasks to be marked done as soon as code compiles, without review."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because making review steps visible and required strengthens accountability for quality. Option b is incorrect because informal practices may be inconsistent. Option c is incorrect because less visibility reduces control. Option d is incorrect because compilation alone does not ensure quality.",
    "difficulty": "medium",
    "topics": [
      "kanban",
      "quality gates"
    ]
  },
  {
    "id": "q-people-4-2-009",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "When issues arise, team members often say \"someone\" will handle them, but no one follows up. What should the project manager do to support accountability for these tasks?",
    "options": [
      {
        "id": "a",
        "label": "Ensure each issue has a named owner, a target date, and clear next steps captured in a visible tracker."
      },
      {
        "id": "b",
        "label": "Accept \"someone\" as the owner to keep discussions informal."
      },
      {
        "id": "c",
        "label": "Assume the most experienced team member will take ownership without assigning it."
      },
      {
        "id": "d",
        "label": "Wait to see if issues resolve themselves without assigning owners."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear ownership, dates, and visibility are essential for accountability on issues. Option b is incorrect because anonymous ownership leads to inaction. Option c is incorrect because assumptions about ownership can fail. Option d is incorrect because many issues need active resolution.",
    "difficulty": "easy",
    "topics": [
      "issue ownership",
      "tracking"
    ]
  },
  {
    "id": "q-people-4-2-010",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A distributed team across time zones struggles to hand off work. Tasks are frequently left without clear next owners overnight. How can the project manager support task accountability in this context?",
    "options": [
      {
        "id": "a",
        "label": "Introduce structured handoff notes and assign explicit next owners before each time zone shift."
      },
      {
        "id": "b",
        "label": "Leave handoffs informal and trust that the next shift will pick up tasks automatically."
      },
      {
        "id": "c",
        "label": "Ask one time zone to handle all tasks independently without handoffs."
      },
      {
        "id": "d",
        "label": "Avoid assigning tasks across time zones to minimize coordination needs."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear handoff procedures and ownership support accountability across time zones. Option b is incorrect because informal handoffs lead to gaps. Option c is incorrect because it underuses global capacity. Option d is incorrect because avoiding cross-zone work limits flexibility.",
    "difficulty": "hard",
    "topics": [
      "time zones",
      "handoffs"
    ]
  },
  {
    "id": "q-people-4-2-011",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The sponsor has requested more transparency on who is responsible for each milestone. Currently, only the project manager's plan lists owners. What should the project manager do to support accountability?",
    "options": [
      {
        "id": "a",
        "label": "Share a milestone responsibility view with the team and sponsor, showing accountable owners and contributors for each milestone."
      },
      {
        "id": "b",
        "label": "Keep owner information private to avoid putting pressure on individuals."
      },
      {
        "id": "c",
        "label": "List the project manager as the sole owner of all milestones."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to determine ownership without team input."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because shared visibility of responsibilities reinforces accountability and aligns expectations. Option b is incorrect because hidden ownership reduces transparency. Option c is incorrect because milestones often require distributed ownership. Option d is incorrect because top-down assignment alone may not reflect actual capabilities.",
    "difficulty": "medium",
    "topics": [
      "milestone ownership",
      "transparency"
    ]
  },
  {
    "id": "q-people-4-2-012",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "In retrospectives, the same people always volunteer for action items, while others remain silent. This creates uneven accountability. How should the project manager respond?",
    "options": [
      {
        "id": "a",
        "label": "Encourage diverse participation by asking who is best placed to own each action and supporting quieter members to take on manageable items."
      },
      {
        "id": "b",
        "label": "Let the same volunteers take all actions to simplify coordination."
      },
      {
        "id": "c",
        "label": "Assign all actions randomly, ignoring capability and interest."
      },
      {
        "id": "d",
        "label": "Stop assigning owners to actions and leave them as team responsibilities."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because expanding ownership and aligning actions with capabilities balances accountability and avoids overloading a few people. Option b is incorrect because over-reliance on volunteers can lead to burnout. Option c is incorrect because random assignment may reduce quality. Option d is incorrect because unowned actions are likely to be ignored.",
    "difficulty": "medium",
    "topics": [
      "action items",
      "shared accountability"
    ]
  },
  {
    "id": "q-people-4-2-013",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A team member missed a critical deadline but cites unclear priorities as the reason. How can the project manager adjust processes to better support task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Implement visible prioritization (such as ordered backlogs) and ensure each person understands the priority of their tasks."
      },
      {
        "id": "b",
        "label": "Continue assigning tasks verbally without indicating priority."
      },
      {
        "id": "c",
        "label": "Tell team members that all tasks are equally important without further guidance."
      },
      {
        "id": "d",
        "label": "Allow each individual to set their own priorities without alignment."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear, shared prioritization enables accountable decisions about where to focus effort. Option b is incorrect because informal assignment without priority leads to confusion. Option c is incorrect because claiming equal importance prevents effective choices. Option d is incorrect because unaligned priorities can conflict.",
    "difficulty": "easy",
    "topics": [
      "prioritization",
      "deadlines"
    ]
  },
  {
    "id": "q-people-4-2-014",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The team uses story points, but some members commit to more work than they can complete, repeatedly spilling tasks into the next iteration. What should the project manager do to support accountability for commitments?",
    "options": [
      {
        "id": "a",
        "label": "Review historical velocity with the team and adjust sprint commitments to be realistic, emphasizing shared responsibility for the commitment."
      },
      {
        "id": "b",
        "label": "Blame individual team members for failing to complete their stories."
      },
      {
        "id": "c",
        "label": "Stop tracking velocity and allow any commitment levels."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to set the number of stories in each sprint."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because using historical data to guide realistic commitments reinforces team-level accountability. Option b is incorrect because focusing on individuals alone may ignore systemic issues. Option c is incorrect because losing velocity tracking removes a useful planning tool. Option d is incorrect because external quotas may ignore capacity.",
    "difficulty": "medium",
    "topics": [
      "velocity",
      "sprint commitments"
    ]
  },
  {
    "id": "q-people-4-2-015",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "There is confusion between accountable and consulted roles on a RACI matrix. Tasks slip because people assume others are responsible. How should the project manager strengthen accountability?",
    "options": [
      {
        "id": "a",
        "label": "Clarify and communicate the RACI roles, ensuring exactly one accountable owner for each key task."
      },
      {
        "id": "b",
        "label": "Allow multiple accountable owners for each task to increase coverage."
      },
      {
        "id": "c",
        "label": "Eliminate the RACI matrix to simplify documentation."
      },
      {
        "id": "d",
        "label": "Mark all tasks as \"team accountable\" without naming individuals."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clearly defining a single accountable owner per task reduces ambiguity. Option b is incorrect because multiple accountables dilute responsibility. Option c is incorrect because removing clarity tools may worsen confusion. Option d is incorrect because generic team accountability often becomes no one's responsibility.",
    "difficulty": "hard",
    "topics": [
      "RACI",
      "role clarity"
    ]
  },
  {
    "id": "q-people-4-2-016",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A team member regularly delivers high-quality work but rarely communicates delays until the due date. How can the project manager support better accountability for communicating status?",
    "options": [
      {
        "id": "a",
        "label": "Set clear expectations for early escalation when delays are likely and discuss preferred channels and timing for updates."
      },
      {
        "id": "b",
        "label": "Accept last-minute updates because the work is high quality."
      },
      {
        "id": "c",
        "label": "Stop assigning important tasks to this team member."
      },
      {
        "id": "d",
        "label": "Ask the team member to send updates only if the sponsor asks for them."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability includes timely communication of risks and issues. Option b is incorrect because surprises reduce the ability to respond. Option c is incorrect because abandoning a strong performer may not fix the underlying behavior. Option d is incorrect because waiting for sponsor prompts is reactive.",
    "difficulty": "medium",
    "topics": [
      "status communication",
      "early escalation"
    ]
  },
  {
    "id": "q-people-4-2-017",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "Some team members feel that accountability is used to assign blame rather than support success. What should the project manager do to reposition accountability constructively?",
    "options": [
      {
        "id": "a",
        "label": "Emphasize accountability as clear ownership plus support, focus on learning from issues, and ensure follow-up discussions are solution-oriented."
      },
      {
        "id": "b",
        "label": "Stop talking about accountability entirely to avoid discomfort."
      },
      {
        "id": "c",
        "label": "Use accountability discussions mainly to document failures."
      },
      {
        "id": "d",
        "label": "Shift all accountability discussions to HR so the project manager stays neutral."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because reframing accountability as supportive and improvement-focused builds trust. Option b is incorrect because removing the concept does not solve ownership issues. Option c is incorrect because blame-focused approaches damage morale. Option d is incorrect because outsourcing accountability conversations may reduce effectiveness.",
    "difficulty": "hard",
    "topics": [
      "psychological safety",
      "supportive accountability"
    ]
  },
  {
    "id": "q-people-4-2-018",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The project manager notices that tasks involving external approvals often stall. No one tracks their status. How can accountability be strengthened for these tasks?",
    "options": [
      {
        "id": "a",
        "label": "Assign a specific owner for each external approval and include checkpoints in the schedule to review their progress."
      },
      {
        "id": "b",
        "label": "Assume external parties will respond without follow-up."
      },
      {
        "id": "c",
        "label": "Group all approval tasks under a generic \"external\" label with no owner."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to chase all approvals personally."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because named owners and scheduled reviews support accountability for dependency management. Option b is incorrect because approvals often require active follow-up. Option c is incorrect because generic labels obscure responsibility. Option d is incorrect because overloading the sponsor is not appropriate.",
    "difficulty": "medium",
    "topics": [
      "external approvals",
      "dependency accountability"
    ]
  },
  {
    "id": "q-people-4-2-019",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A complex task spans multiple sprints. The owner changes due to rotations, and important context is lost. How should the project manager support accountability during these transitions?",
    "options": [
      {
        "id": "a",
        "label": "Require structured handovers between owners, including documented status, decisions, and next steps."
      },
      {
        "id": "b",
        "label": "Change owners informally and expect them to \"figure it out\" as they go."
      },
      {
        "id": "c",
        "label": "Avoid changing ownership at all, regardless of rotation policies."
      },
      {
        "id": "d",
        "label": "Assign the same owner to all long-running tasks across the project, regardless of workload."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because structured handovers maintain accountability and context when ownership changes. Option b is incorrect because informal transitions lose information. Option c is incorrect because fixed ownership may conflict with rotation needs. Option d is incorrect because concentrating ownership can overload individuals.",
    "difficulty": "hard",
    "topics": [
      "handover",
      "long-running tasks"
    ]
  },
  {
    "id": "q-people-4-2-020",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The project manager wants to periodically assess how well the team is meeting commitments. What is the best practice to support accountability while doing this?",
    "options": [
      {
        "id": "a",
        "label": "Review planned versus completed work with the team at the end of each iteration, discussing causes and improvement actions."
      },
      {
        "id": "b",
        "label": "Track deviations privately and bring them up only in annual performance reviews."
      },
      {
        "id": "c",
        "label": "Focus only on aggregate project status and ignore team-level commitments."
      },
      {
        "id": "d",
        "label": "Avoid discussing deviations to keep meetings positive."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because regular, transparent reviews of commitments support learning and future accountability. Option b is incorrect because delayed feedback reduces effectiveness. Option c is incorrect because team-level commitments matter. Option d is incorrect because avoiding issues hinder improvement.",
    "difficulty": "easy",
    "topics": [
      "iteration review",
      "commitment tracking"
    ]
  },
  {
    "id": "q-people-4-2-021",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "A critical path task depends on input from several stakeholders. The team is unclear who is accountable for coordinating the inputs. How should the project manager address this?",
    "options": [
      {
        "id": "a",
        "label": "Assign a single coordination owner responsible for gathering inputs and keep the team informed of progress."
      },
      {
        "id": "b",
        "label": "Assume each stakeholder will coordinate their own input on time."
      },
      {
        "id": "c",
        "label": "Ask the team to collectively coordinate inputs with no primary owner."
      },
      {
        "id": "d",
        "label": "Hope that inputs will arrive organically as the deadline approaches."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear coordination ownership is needed when multiple stakeholders contribute to a critical task. Option b is incorrect because unmanaged dependencies are risky. Option c is incorrect because collective ownership without a lead can lead to diffusion of responsibility. Option d is incorrect because relying on hope is not sound management.",
    "difficulty": "hard",
    "topics": [
      "critical path",
      "coordination accountability"
    ]
  },
  {
    "id": "q-people-4-2-022",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "Some team members feel micromanaged when the project manager frequently checks on task status. How can the project manager support accountability while reducing this perception?",
    "options": [
      {
        "id": "a",
        "label": "Agree on a cadence and format for status updates that gives visibility while allowing autonomy."
      },
      {
        "id": "b",
        "label": "Stop asking for status updates entirely and hope tasks are completed."
      },
      {
        "id": "c",
        "label": "Increase the frequency of status checks to ensure control."
      },
      {
        "id": "d",
        "label": "Ask only senior management to check status directly with team members."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because mutually agreed update practices can reinforce accountability without micromanagement. Option b is incorrect because lack of visibility can hide issues. Option c is incorrect because more intrusive checks may increase frustration. Option d is incorrect because direct senior checks may feel even more controlling.",
    "difficulty": "medium",
    "topics": [
      "autonomy",
      "status cadence"
    ]
  },
  {
    "id": "q-people-4-2-023",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The project manager wants to ensure that accountability also includes learning from missed commitments. What is the best way to incorporate this into team practices?",
    "options": [
      {
        "id": "a",
        "label": "Hold short, non-blaming reviews when commitments are missed to analyze causes and adapt processes or estimates."
      },
      {
        "id": "b",
        "label": "Record missed commitments only in a private log without team discussion."
      },
      {
        "id": "c",
        "label": "Treat each missed commitment as an individual performance failure without examining systemic factors."
      },
      {
        "id": "d",
        "label": "Ignore missed commitments unless they affect senior stakeholders directly."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because constructive reviews help the team learn and adjust, making accountability developmental rather than punitive. Option b is incorrect because hidden logs do not promote learning. Option c is incorrect because blaming individuals alone may overlook process issues. Option d is incorrect because unaddressed misses can accumulate.",
    "difficulty": "medium",
    "topics": [
      "learning review",
      "missed commitments"
    ]
  },
  {
    "id": "q-people-4-2-024",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "At project closeout, the project manager wants to demonstrate that task accountability contributed to success. What evidence best supports this?",
    "options": [
      {
        "id": "a",
        "label": "Consistent tracking of task ownership, completion rates aligned with commitments, and timely resolution of issues with named owners."
      },
      {
        "id": "b",
        "label": "A large number of tasks started but only a few finished."
      },
      {
        "id": "c",
        "label": "A minimal number of tasks recorded, regardless of completion."
      },
      {
        "id": "d",
        "label": "A perception that the project went smoothly, without supporting data."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear ownership, fulfillment of commitments, and issue resolution show that accountability mechanisms worked. Option b is incorrect because unfinished tasks signal problems. Option c is incorrect because few recorded tasks may indicate poor tracking. Option d is incorrect because perceptions without data are incomplete.",
    "difficulty": "easy",
    "topics": [
      "evidence of accountability",
      "closure"
    ]
  },
  {
    "id": "q-people-4-2-025",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": [
      "e-people-4-2"
    ],
    "text": "The team is about to start a complex phase with many interdependent tasks. What proactive step should the project manager take to support accountability from the beginning?",
    "options": [
      {
        "id": "a",
        "label": "Facilitate a planning session to assign clear owners, define acceptance criteria, and identify checkpoints for each critical task."
      },
      {
        "id": "b",
        "label": "Let task owners emerge informally as the work progresses."
      },
      {
        "id": "c",
        "label": "Assign all tasks to the project manager and delegate later if time permits."
      },
      {
        "id": "d",
        "label": "Delay assigning owners until tasks are nearly complete to avoid pressure."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because early clarity on ownership, criteria, and checkpoints sets a solid foundation for accountability. Option b is incorrect because informal emergence can be chaotic. Option c is incorrect because it overloads the manager. Option d is incorrect because late ownership limits control.",
    "difficulty": "medium",
    "topics": [
      "proactive planning",
      "complex phase"
    ]
  }
]
