[
  {
    "id": "q-people-4-3-001",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The team agreed that tasks would not be marked done until peer review is complete. After several sprints, build quality has improved. What is the best way for the project manager to evaluate demonstration of task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Check whether tasks consistently show peer review evidence before completion and confirm reduced defects are linked to this behavior."
      },
      {
        "id": "b",
        "label": "Assume accountability has improved because build quality is better, without checking behaviors."
      },
      {
        "id": "c",
        "label": "Ask only the product owner whether they feel more confident, without reviewing task histories."
      },
      {
        "id": "d",
        "label": "Focus solely on schedule adherence and ignore process compliance."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because evaluating accountability requires checking that agreed behaviors (peer reviews) are being followed and connected to outcomes. Option b is incorrect because outcomes alone do not confirm specific behavior. Option c is incorrect because one stakeholder perspective is insufficient. Option d is incorrect because accountability includes process adherence, not just dates.",
    "difficulty": "medium",
    "topics": ["peer review", "behavior verification"]
  },
  {
    "id": "q-people-4-3-002",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "A developer commits to handling stakeholder communication for a feature but later delegates all updates to others. How should the project manager evaluate their demonstration of accountability?",
    "options": [
      {
        "id": "a",
        "label": "Review whether the developer fulfilled the communication responsibilities they accepted and discuss any gaps between commitment and actions."
      },
      {
        "id": "b",
        "label": "Ignore the delegation and assume communication happened somehow."
      },
      {
        "id": "c",
        "label": "Judge accountability only based on whether the feature was technically delivered."
      },
      {
        "id": "d",
        "label": "Wait for stakeholders to complain before considering it an accountability issue."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability includes owning agreed responsibilities and being evaluated on follow-through. Option b is incorrect because ignoring delegations may hide issues. Option c is incorrect because task accountability includes communication, not just technical delivery. Option d is incorrect because relying on complaints is reactive.",
    "difficulty": "easy",
    "topics": ["commitment vs action", "stakeholder updates"]
  },
  {
    "id": "q-people-4-3-003",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "A quality improvement initiative assigned each team member responsibility for a specific metric (such as defect density or cycle time). Some metrics improved, while others did not. How should the project manager evaluate task accountability in this case?",
    "options": [
      {
        "id": "a",
        "label": "Compare metrics to targets and review actions taken by each owner to understand whether they actively managed their metric."
      },
      {
        "id": "b",
        "label": "Assume lack of improvement is solely due to external factors and ignore owner behavior."
      },
      {
        "id": "c",
        "label": "Evaluate accountability only for metrics that improved, ignoring the rest."
      },
      {
        "id": "d",
        "label": "Judge accountability solely on how often owners mentioned their metrics in meetings."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because evaluating accountability involves looking at both results and whether owners took meaningful actions. Option b is incorrect because disregarding behavior prevents learning. Option c is incorrect because ignoring underperforming metrics misses improvement opportunities. Option d is incorrect because frequent mentions do not guarantee action.",
    "difficulty": "hard",
    "topics": ["metric ownership", "result evaluation"]
  },
  {
    "id": "q-people-4-3-004",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The team agreed that blockers must be raised within one working day. In practice, some team members struggle silently for several days before asking for help. How should the project manager evaluate accountability for this agreement?",
    "options": [
      {
        "id": "a",
        "label": "Review specific cases where blockers were raised late, discuss with the individuals, and assess whether the agreement is understood and followed."
      },
      {
        "id": "b",
        "label": "Judge accountability only on whether work eventually gets completed, regardless of delays."
      },
      {
        "id": "c",
        "label": "Assume the agreement is being followed because it was documented."
      },
      {
        "id": "d",
        "label": "Treat early escalation as optional guidance, not as part of accountability."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because evaluating accountability includes checking adherence to team agreements and addressing gaps. Option b is incorrect because ignoring delays undermines the agreement. Option c is incorrect because documents alone do not ensure behavior. Option d is incorrect because optionalizing agreements weakens accountability.",
    "difficulty": "medium",
    "topics": ["blocker escalation", "agreement adherence"]
  },
  {
    "id": "q-people-4-3-005",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "A newly appointed task owner inherited a partially completed work package. They successfully delivered it on time and documented key decisions. How should the project manager evaluate their demonstration of accountability?",
    "options": [
      {
        "id": "a",
        "label": "Recognize that the owner took responsibility for both completion and documentation despite inheriting work midstream."
      },
      {
        "id": "b",
        "label": "Evaluate only whether the final deadline was met, ignoring documentation."
      },
      {
        "id": "c",
        "label": "Attribute the success solely to the previous owner."
      },
      {
        "id": "d",
        "label": "Discount the owner’s contribution because they did not own the work from the start."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability includes effectively taking over and completing tasks, including capturing decisions. Option b is incorrect because documentation is part of responsibility. Option c and d are incorrect because they minimize the current owner's contribution.",
    "difficulty": "easy",
    "topics": ["ownership transition", "recognition"]
  },
  {
    "id": "q-people-4-3-006",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The project manager wants to evaluate whether the team demonstrates accountability for retrospective action items. Which evidence is most relevant?",
    "options": [
      {
        "id": "a",
        "label": "Action items have clear owners, completion dates are met, and related process metrics show improvement."
      },
      {
        "id": "b",
        "label": "Action items are documented, but owners and dates are left blank."
      },
      {
        "id": "c",
        "label": "Retrospectives are held regularly, regardless of whether actions are completed."
      },
      {
        "id": "d",
        "label": "Team members say they will \"try\" to act on items without tracking them."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability is demonstrated by owned actions that lead to change. Option b is incorrect because lack of owners and dates undermines ownership. Option c is incorrect because frequency of meetings alone does not show accountability. Option d is incorrect because vague intentions without tracking are weak.",
    "difficulty": "easy",
    "topics": ["retrospective actions", "evidence"]
  },
  {
    "id": "q-people-4-3-007",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The sponsor notes that a few team members always step in to fix critical issues, even when they are not the assigned owners. How should the project manager evaluate task accountability in this situation?",
    "options": [
      {
        "id": "a",
        "label": "Review whether original owners are consistently failing to fulfill responsibilities and whether reliance on a few \"heroes\" indicates gaps in accountability."
      },
      {
        "id": "b",
        "label": "Praise the heroes and ignore the original owners' lack of follow-through."
      },
      {
        "id": "c",
        "label": "Reassign all future tasks to the heroes exclusively."
      },
      {
        "id": "d",
        "label": "Evaluate accountability only based on whether issues eventually get resolved."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because effective accountability requires that assigned owners deliver, not just that work gets done by volunteers. Option b is incorrect because it overlooks systemic issues. Option c is incorrect because concentrating work on a few people is unsustainable. Option d is incorrect because timing and ownership matter.",
    "difficulty": "hard",
    "topics": ["hero culture", "owner performance"]
  },
  {
    "id": "q-people-4-3-008",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "A task owner is responsible for collecting sign-offs but repeatedly submits documents for approval with incomplete sections. How should the project manager evaluate accountability for this task?",
    "options": [
      {
        "id": "a",
        "label": "Consider that the owner is not fully meeting task expectations and discuss specific gaps and support needed."
      },
      {
        "id": "b",
        "label": "Evaluate accountability solely based on whether sign-offs are eventually obtained."
      },
      {
        "id": "c",
        "label": "Assume approvers should complete the missing sections themselves."
      },
      {
        "id": "d",
        "label": "Ignore the pattern because deadlines are being met."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability includes delivering complete inputs to stakeholders, not just meeting dates. Option b is incorrect because quality of handoffs is important. Option c is incorrect because shifting work to approvers is outside the task's scope. Option d is incorrect because repeated issues should be addressed.",
    "difficulty": "medium",
    "topics": ["sign-offs", "handoff quality"]
  },
  {
    "id": "q-people-4-3-009",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The team implemented a policy where task owners must present their work during sprint reviews. Some owners delegate the presentation to others. How should the project manager evaluate accountability under this policy?",
    "options": [
      {
        "id": "a",
        "label": "Assess whether owners are fulfilling the intent of the policy by standing behind their work, even if they share presentation duties."
      },
      {
        "id": "b",
        "label": "Judge accountability only on who speaks, not on who owns the work."
      },
      {
        "id": "c",
        "label": "Cancel the policy since delegation occurs."
      },
      {
        "id": "d",
        "label": "Treat presentations as unrelated to accountability."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because the key is that owners remain visible and answerable for results, regardless of presentation help. Option b is incorrect because focusing only on the speaker may misrepresent ownership. Option c is incorrect because policy adjustments, not removal, may be needed. Option d is incorrect because review presentations are part of demonstrating ownership.",
    "difficulty": "medium",
    "topics": ["sprint reviews", "owner visibility"]
  },
  {
    "id": "q-people-4-3-010",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "Several tasks were delivered on time, but dependencies were not fully considered, leading to rework for another team. How should the project manager evaluate demonstration of task accountability for the original team?",
    "options": [
      {
        "id": "a",
        "label": "Recognize that accountability includes considering downstream impacts and coordination, not just local delivery."
      },
      {
        "id": "b",
        "label": "Evaluate accountability only based on whether deadlines were met."
      },
      {
        "id": "c",
        "label": "Treat dependency management as solely the other team's responsibility."
      },
      {
        "id": "d",
        "label": "Ignore the impact on other teams when assessing performance."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because true accountability includes end-to-end effects on other teams, not just isolated tasks. Option b is incorrect because schedule alone is insufficient. Option c is incorrect because upstream teams share responsibility for dependencies. Option d is incorrect because ignoring cross-team impacts gives an incomplete picture.",
    "difficulty": "hard",
    "topics": ["end-to-end accountability", "dependencies"]
  },
  {
    "id": "q-people-4-3-011",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The project manager wants to evaluate whether task accountability improved after introducing a RACI matrix. Which indicator would be most relevant?",
    "options": [
      {
        "id": "a",
        "label": "Fewer tasks fall through gaps, decision-making is faster, and conflicts over who owns work decrease."
      },
      {
        "id": "b",
        "label": "The RACI matrix was created, regardless of whether it is used."
      },
      {
        "id": "c",
        "label": "Stakeholders can recite the RACI roles from memory."
      },
      {
        "id": "d",
        "label": "The number of emails about tasks increases after the RACI is introduced."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because improved accountability is reflected in fewer gaps, faster decisions, and less ownership confusion. Option b is incorrect because documentation alone does not show behavioral change. Option c is incorrect because memorization does not guarantee use. Option d is incorrect because more emails may signal confusion.",
    "difficulty": "medium",
    "topics": ["RACI outcomes", "task gaps"]
  },
  {
    "id": "q-people-4-3-012",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "A team member owns a risk mitigation task but has not started it by the due date. The risk remains open. How should the project manager evaluate this person's accountability for the task?",
    "options": [
      {
        "id": "a",
        "label": "Recognize that accountability was not demonstrated as agreed and discuss why the task was not started and how to prevent recurrence."
      },
      {
        "id": "b",
        "label": "Assume the risk is minor and dismiss the missed task as unimportant."
      },
      {
        "id": "c",
        "label": "Evaluate only whether the risk eventually causes an issue, ignoring the missed task."
      },
      {
        "id": "d",
        "label": "Shift responsibility to another team member without addressing the original owner."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because missing a mitigation task indicates an accountability gap that must be addressed. Option b is incorrect because risk severity should be assessed, not assumed. Option c is incorrect because waiting for an issue to occur is reactive. Option d is incorrect because transferring tasks without discussion hides the problem.",
    "difficulty": "medium",
    "topics": ["risk mitigation tasks", "missed actions"]
  },
  {
    "id": "q-people-4-3-013",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "After clarifying roles, the team reports that they can better see who owns which work. The project manager now wants to evaluate demonstration of accountability. Which approach is best?",
    "options": [
      {
        "id": "a",
        "label": "Monitor whether tasks are completed by their owners as expected, and whether escalations happen when needed."
      },
      {
        "id": "b",
        "label": "Ask only whether team members like the updated roles, without checking behavior."
      },
      {
        "id": "c",
        "label": "Assume accountability improved because the role document exists."
      },
      {
        "id": "d",
        "label": "Focus only on overall project success metrics and ignore task-level behavior."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability is shown in behavior, such as task completion and escalation, not just awareness. Option b is incorrect because sentiment alone is incomplete. Option c is incorrect because documentation alone does not confirm practice. Option d is incorrect because project-level metrics may hide local issues.",
    "difficulty": "easy",
    "topics": ["role clarity", "behavior monitoring"]
  },
  {
    "id": "q-people-4-3-014",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "Team members agreed to update the kanban board daily. After a month, some columns reflect reality, while others are outdated. How should the project manager evaluate task accountability for board maintenance?",
    "options": [
      {
        "id": "a",
        "label": "Assess which owners reliably update their items, discuss inconsistencies, and reinforce that board accuracy is part of their accountability."
      },
      {
        "id": "b",
        "label": "Judge accountability only on task completion, not on board accuracy."
      },
      {
        "id": "c",
        "label": "Assume board data is always correct and use it for decisions without verification."
      },
      {
        "id": "d",
        "label": "Stop using the board because some columns are inaccurate."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because maintaining accurate boards is part of task accountability and should be evaluated and improved. Option b is incorrect because inaccurate boards hinder coordination. Option c is incorrect because unverified data may mislead decisions. Option d is incorrect because abandoning the board removes a useful tool instead of fixing usage.",
    "difficulty": "medium",
    "topics": ["board maintenance", "information accountability"]
  },
  {
    "id": "q-people-4-3-015",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The project manager wants to include task accountability in performance reviews. What is the best way to evaluate it fairly?",
    "options": [
      {
        "id": "a",
        "label": "Use objective evidence such as task completion records, behavior around commitments, and contributions to resolving issues."
      },
      {
        "id": "b",
        "label": "Base evaluations on general impressions of reliability without data."
      },
      {
        "id": "c",
        "label": "Focus only on the number of tasks assigned, not on completion or quality."
      },
      {
        "id": "d",
        "label": "Evaluate accountability solely based on peer popularity."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because fair evaluation relies on observable evidence of taking ownership and following through. Option b is incorrect because impressions are biased. Option c is incorrect because assignment count does not show follow-through. Option d is incorrect because popularity is not a reliable indicator.",
    "difficulty": "hard",
    "topics": ["performance reviews", "objective evidence"]
  },
  {
    "id": "q-people-4-3-016",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "Two teams share responsibility for integration testing. Each assumes the other will write the tests. Few tests are created, and defects escape. How should the project manager evaluate task accountability across the teams?",
    "options": [
      {
        "id": "a",
        "label": "Identify whether clear owners were assigned, evaluate gaps in shared accountability, and adjust responsibilities to remove ambiguity."
      },
      {
        "id": "b",
        "label": "Blame the testers alone without reviewing role agreements."
      },
      {
        "id": "c",
        "label": "Consider accountability adequate since integration eventually happens."
      },
      {
        "id": "d",
        "label": "Assume accountability is solely an issue for line managers, not the project."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because examining and clarifying shared responsibilities is key to evaluating and improving accountability. Option b is incorrect because blaming individuals ignores structural ambiguity. Option c is incorrect because escape defects show a problem. Option d is incorrect because project-level accountability is essential.",
    "difficulty": "hard",
    "topics": ["shared accountability", "integration testing"]
  },
  {
    "id": "q-people-4-3-017",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "After introducing daily checklists for deployment tasks, rollbacks decreased. However, some team members report skipping checklist steps when under time pressure. What should the project manager evaluate regarding accountability?",
    "options": [
      {
        "id": "a",
        "label": "Examine how consistently checklists are followed and discuss with the team why steps are skipped and how to support adherence."
      },
      {
        "id": "b",
        "label": "Ignore skipped steps as long as rollbacks remain low."
      },
      {
        "id": "c",
        "label": "Consider checklists optional suggestions rather than accountability tools."
      },
      {
        "id": "d",
        "label": "Judge accountability only on the number of checklists created, not used."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because evaluating accountability requires checking adherence to agreed safeguards and addressing barriers to use. Option b is incorrect because skipped steps may lead to future issues. Option c is incorrect because optionalizing safeguards weakens them. Option d is incorrect because unused checklists do not demonstrate accountable behavior.",
    "difficulty": "medium",
    "topics": ["checklist adherence", "time pressure"]
  },
  {
    "id": "q-people-4-3-018",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The project manager wants to evaluate whether empowering team members improved accountability. Over several sprints, the team self-selects tasks and sets realistic commitments. What evidence would best support that accountability has increased?",
    "options": [
      {
        "id": "a",
        "label": "Higher rate of meeting commitments, more proactive communication of risks, and fewer unowned tasks on the board."
      },
      {
        "id": "b",
        "label": "Increased number of tasks created, regardless of completion."
      },
      {
        "id": "c",
        "label": "More frequent changes to task owners mid-sprint."
      },
      {
        "id": "d",
        "label": "Reduced need for the project manager to facilitate discussions, without examining outcomes."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because meeting commitments and proactive behavior indicate stronger accountability. Option b is incorrect because more tasks alone do not show responsible follow-through. Option c is incorrect because frequent owner changes may signal instability. Option d is incorrect because less facilitation does not guarantee accountability.",
    "difficulty": "medium",
    "topics": ["empowerment outcomes", "ownership indicators"]
  },
  {
    "id": "q-people-4-3-019",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "During project closure, the project manager wants to evaluate how well task accountability was demonstrated across phases. Which approach is most appropriate?",
    "options": [
      {
        "id": "a",
        "label": "Review key deliverables, ownership records, issue logs, and how often tasks were completed as agreed, identifying patterns for future improvement."
      },
      {
        "id": "b",
        "label": "Ask only senior management if they are satisfied with the project outcome."
      },
      {
        "id": "c",
        "label": "Look only at the final schedule and budget variance."
      },
      {
        "id": "d",
        "label": "Skip evaluating accountability to avoid difficult conversations at closing."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a structured review of how responsibilities were fulfilled supports learning for future projects. Option b is incorrect because management satisfaction alone is not enough. Option c is incorrect because schedule and budget do not reveal accountability details. Option d is incorrect because closure is an opportunity to learn.",
    "difficulty": "easy",
    "topics": ["closure evaluation", "patterns"]
  },
  {
    "id": "q-people-4-3-020",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The project uses a shared inbox for support requests. Several emails remain unanswered for days. No one is explicitly assigned. How should the project manager evaluate accountability and adjust practices?",
    "options": [
      {
        "id": "a",
        "label": "Recognize that lack of explicit owners shows weak accountability and assign rotating or dedicated owners to manage the inbox."
      },
      {
        "id": "b",
        "label": "Assume that whoever has time will answer eventually and make no changes."
      },
      {
        "id": "c",
        "label": "Rely on the requester to escalate if they do not receive a response."
      },
      {
        "id": "d",
        "label": "Treat the shared inbox as low priority and accept delays as normal."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because assigning explicit responsibility for the inbox improves accountability and response times. Option b is incorrect because unmanaged queues lead to neglect. Option c is incorrect because placing the burden on requesters is reactive. Option d is incorrect because treating delays as normal undermines service.",
    "difficulty": "medium",
    "topics": ["shared queues", "owner assignment"]
  },
  {
    "id": "q-people-4-3-021",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "A senior leader asks whether the team is reliably following change control procedures. What should the project manager review to evaluate task accountability for change management?",
    "options": [
      {
        "id": "a",
        "label": "Examine change requests, approvals, implementation records, and whether responsible parties followed each step consistently."
      },
      {
        "id": "b",
        "label": "Survey only whether team members think the process is clear, without reviewing records."
      },
      {
        "id": "c",
        "label": "Report that accountability is high based solely on having a documented process."
      },
      {
        "id": "d",
        "label": "Judge accountability only on the number of change requests created, ignoring process adherence."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because accountability for change control is demonstrated by adherence to each step and complete records. Option b is incorrect because perception of clarity is not enough. Option c is incorrect because documentation alone does not prove follow-through. Option d is incorrect because counts alone omit process quality.",
    "difficulty": "hard",
    "topics": ["change control", "process adherence"]
  },
  {
    "id": "q-people-4-3-022",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The team introduced peer checklists for complex tasks to improve accountability. After several uses, some team members sign off on items they did not actually verify. How should the project manager evaluate accountability with respect to these checklists?",
    "options": [
      {
        "id": "a",
        "label": "Identify mismatches between checklist sign-offs and actual verification, and discuss with the team how to restore integrity of the practice."
      },
      {
        "id": "b",
        "label": "Accept that signatures on checklists are symbolic and not related to real checks."
      },
      {
        "id": "c",
        "label": "Abandon checklists entirely because they are not used perfectly."
      },
      {
        "id": "d",
        "label": "Assume that if no incidents occur, accountability is sufficient regardless of checklist behavior."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because evaluating accountability must include verifying that controls are applied honestly and addressing gaps. Option b is incorrect because symbolic sign-offs undermine controls. Option c is incorrect because improvement is possible rather than elimination. Option d is incorrect because absence of incidents may be temporary.",
    "difficulty": "hard",
    "topics": ["checklist integrity", "control effectiveness"]
  },
  {
    "id": "q-people-4-3-023",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "Over time, the project has reduced the number of overdue tasks and escalations. The project manager wants to confirm that this reflects stronger task accountability rather than just reduced scope. What should be examined?",
    "options": [
      {
        "id": "a",
        "label": "Compare effort, complexity, and ownership patterns over time to confirm that similar workloads are delivered more reliably."
      },
      {
        "id": "b",
        "label": "Look only at the raw count of overdue tasks without context."
      },
      {
        "id": "c",
        "label": "Assume lower counts always mean improved accountability, regardless of project changes."
      },
      {
        "id": "d",
        "label": "Ignore accountability and focus solely on whether the sponsor is satisfied."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because controlling for scope and workload is necessary to attribute improvements to accountability. Option b is incorrect because counts alone lack context. Option c is incorrect because fewer tasks may simply reflect less work. Option d is incorrect because sponsor satisfaction can hide underlying issues.",
    "difficulty": "medium",
    "topics": ["trend interpretation", "scope context"]
  },
  {
    "id": "q-people-4-3-024",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "The project manager wants to encourage self-reflection on accountability among team members. Which practice would best support evaluating and improving task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Integrate brief self-assessment questions about commitments and follow-through into one-on-ones and retrospectives."
      },
      {
        "id": "b",
        "label": "Ask team members to self-evaluate only once at the end of the project."
      },
      {
        "id": "c",
        "label": "Provide no opportunity for self-reflection and rely solely on management evaluations."
      },
      {
        "id": "d",
        "label": "Use anonymous surveys that never share results with team members."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because regular self-reflection on commitments helps individuals internalize accountability. Option b is incorrect because one-off assessments have limited impact. Option c is incorrect because self-awareness is important. Option d is incorrect because hidden feedback does not support personal improvement.",
    "difficulty": "easy",
    "topics": ["self-assessment", "continuous improvement"]
  },
  {
    "id": "q-people-4-3-025",
    "domainId": "people",
    "taskId": "people-4",
    "enablerIds": ["e-people-4-3"],
    "text": "At the portfolio review, leadership asks how the project ensures accountability for critical deliverables. What evidence should the project manager highlight to demonstrate task accountability?",
    "options": [
      {
        "id": "a",
        "label": "Named owners for critical deliverables, clear acceptance criteria, regular progress reviews, and documented handling of risks and issues."
      },
      {
        "id": "b",
        "label": "A long list of tasks without assigned owners or due dates."
      },
      {
        "id": "c",
        "label": "Only the existence of a high-level Gantt chart without owner details."
      },
      {
        "id": "d",
        "label": "Verbal assurances that the team is responsible without supporting information."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because concrete evidence of ownership, criteria, reviews, and issue handling demonstrates accountability for critical work. Option b is incorrect because unowned tasks are risky. Option c is incorrect because high-level charts without owners lack accountability detail. Option d is incorrect because verbal statements alone are weak evidence.",
    "difficulty": "medium",
    "topics": ["portfolio review", "critical deliverables"]
  }
]

