[
  {
    "id": "q-people-1-3-001",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "Two developers disagree about an approach but remain respectful and focused on the technical issue. What conflict resolution approach should the project manager recommend first?",
    "options": [
      {
        "id": "b",
        "label": "Encourage collaboration to evaluate both options and choose the best solution together."
      },
      {
        "id": "a",
        "label": "Impose an immediate decision without team input to save time."
      },
      {
        "id": "c",
        "label": "Avoid the discussion and hope it resolves itself."
      },
      {
        "id": "d",
        "label": "Separate the developers permanently into different teams."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because collaboration leverages the strengths of both ideas when the conflict is respectful and task-focused. Option a is incorrect because imposing a decision reduces ownership and may harm motivation. Option c is incorrect because avoidance can let the disagreement resurface later. Option d is incorrect because splitting the team is an extreme measure not justified by a normal technical disagreement.",
    "difficulty": "easy",
    "topics": [
      "conflict resolution",
      "collaboration"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-002",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A senior architect and a junior engineer are in conflict, and schedule pressure is high. What is the most appropriate conflict resolution technique to recommend?",
    "options": [
      {
        "id": "a",
        "label": "Forcing, by having the architect's decision stand without further discussion."
      },
      {
        "id": "b",
        "label": "Compromising, by choosing the midpoint between their two designs regardless of impact."
      },
      {
        "id": "c",
        "label": "Collaborating, by having them jointly evaluate options based on criteria and risks."
      },
      {
        "id": "d",
        "label": "Avoiding, by postponing the decision until after the schedule pressure passes."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because collaborating to evaluate options against clear criteria yields a higher-quality, jointly owned solution even under pressure. Option a is incorrect because forcing may resolve the conflict quickly but increases resentment and may not yield the best design. Option b is incorrect because compromising by splitting the difference can lead to a suboptimal design. Option d is incorrect because avoiding delays decisions when schedule pressure demands a timely choice.",
    "difficulty": "medium",
    "topics": [
      "conflict techniques",
      "collaborating"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-003",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict about meeting times persists despite attempts to rotate schedules. What conflict resolution solution might best reconcile interests for a globally distributed team?",
    "options": [
      {
        "id": "b",
        "label": "Use asynchronous updates for most topics and limit live meetings to critical decisions."
      },
      {
        "id": "a",
        "label": "Require every team member to attend all meetings regardless of time."
      },
      {
        "id": "c",
        "label": "Cancel all team meetings permanently."
      },
      {
        "id": "d",
        "label": "Let each region run separate projects with no coordination."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because combining asynchronous updates with focused live sessions reduces burden while preserving alignment. Option a is incorrect because forcing everyone into all time slots is unsustainable and unfair. Option c is incorrect because eliminating meetings altogether undermines collaboration. Option d is incorrect because splitting projects removes necessary coordination and may fragment delivery.",
    "difficulty": "medium",
    "topics": [
      "distributed teams",
      "resolution options"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-004",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A product owner and technical lead disagree strongly about including a complex feature in the next sprint. How should the project manager recommend reconciling this conflict?",
    "options": [
      {
        "id": "b",
        "label": "Facilitate a discussion to compare value, risk, and technical feasibility against sprint goals."
      },
      {
        "id": "a",
        "label": "Ask the team to ignore both opinions and pick a random option."
      },
      {
        "id": "c",
        "label": "Immediately side with the person who speaks the loudest."
      },
      {
        "id": "d",
        "label": "Cancel the sprint and restart planning from scratch."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because structured evaluation of value, risk, and feasibility helps reach a decision that aligns with sprint goals. Option a is incorrect because random choice ignores data and undermines trust. Option c is incorrect because rewarding loudness encourages unproductive behavior. Option d is incorrect because cancelling the sprint is drastic and wastes planning effort.",
    "difficulty": "medium",
    "topics": [
      "value vs risk",
      "resolution facilitation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-005",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "Two senior stakeholders are in conflict about scope, and the disagreement blocks a key decision. What conflict resolution approach should the project manager recommend?",
    "options": [
      {
        "id": "b",
        "label": "Facilitate a negotiation that focuses on shared objectives and trade-offs rather than personal preferences."
      },
      {
        "id": "a",
        "label": "Ask the team to ignore both stakeholders and continue without direction."
      },
      {
        "id": "c",
        "label": "Adopt whichever stakeholder has the higher organizational title without discussion."
      },
      {
        "id": "d",
        "label": "Delay all decisions until the next fiscal year."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because negotiating around shared objectives and trade-offs helps align competing stakeholder interests. Option a is incorrect because proceeding without guidance risks misalignment. Option c is incorrect because defaulting to hierarchy may solve the conflict superficially but can damage relationships. Option d is incorrect because delaying decisions so long harms project momentum and value.",
    "difficulty": "hard",
    "topics": [
      "stakeholder negotiation",
      "resolution strategy"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-006",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "Two team members are in conflict about testing responsibilities, and emotions are high. What is the best immediate conflict resolution action to recommend?",
    "options": [
      {
        "id": "b",
        "label": "Pause the discussion, meet with them privately, and work through responsibilities and expectations calmly."
      },
      {
        "id": "a",
        "label": "Force one person to accept the other's view without discussion."
      },
      {
        "id": "c",
        "label": "Ignore the conflict and hope the team resolves it without support."
      },
      {
        "id": "d",
        "label": "Announce a permanent reorganization of the testing process in the middle of the argument."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because de-escalating and addressing responsibilities in a calmer setting supports a sustainable resolution. Option a is incorrect because forcing acceptance deepens resentment. Option c is incorrect because ignoring a heated conflict risks further damage to relationships and quality. Option d is incorrect because making sudden structural changes during an argument is reactive and may not be well thought out.",
    "difficulty": "easy",
    "topics": [
      "de-escalation",
      "role clarity"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-007",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict continues between two teams about ownership of integration testing. What resolution should the project manager recommend to reconcile this?",
    "options": [
      {
        "id": "b",
        "label": "Clarify shared ownership and establish a joint integration testing plan with agreed responsibilities."
      },
      {
        "id": "a",
        "label": "Assign all integration testing to whichever team complains least."
      },
      {
        "id": "c",
        "label": "Stop integration testing until the conflict fades."
      },
      {
        "id": "d",
        "label": "Rotate ownership randomly each day without regard to skills."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because a joint plan with explicit responsibilities reduces ambiguity and spreads ownership appropriately. Option a is incorrect because rewarding silence may overload one team unfairly. Option c is incorrect because halting integration testing increases project risk. Option d is incorrect because random rotation disregards capability and continuity.",
    "difficulty": "medium",
    "topics": [
      "integration responsibilities",
      "joint plans"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-008",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A team member feels disrespected by how feedback was delivered in a retro. What conflict resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "c",
        "label": "Facilitate a conversation to agree on feedback guidelines and repair the relationship."
      },
      {
        "id": "b",
        "label": "Ask the offended team member to simply ignore the situation."
      },
      {
        "id": "a",
        "label": "Publicly criticize the person who gave the feedback."
      },
      {
        "id": "d",
        "label": "Eliminate retrospectives entirely to avoid feedback."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because agreeing on guidelines and repairing trust addresses both process and relationship. Option b is incorrect because ignoring hurt feelings can erode psychological safety. Option a is incorrect because public criticism can create a new conflict and increase defensiveness. Option d is incorrect because removing retros prevents learning and improvement.",
    "difficulty": "easy",
    "topics": [
      "feedback agreements",
      "relationship repair"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-009",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A long-running conflict between two senior engineers is affecting delivery. What resolution approach should the project manager recommend after earlier attempts failed?",
    "options": [
      {
        "id": "c",
        "label": "Bring in a neutral facilitator or mediator to help them reach an agreement."
      },
      {
        "id": "b",
        "label": "Force both engineers to work extended hours until they resolve it."
      },
      {
        "id": "a",
        "label": "Avoid the topic entirely and focus only on technical status."
      },
      {
        "id": "d",
        "label": "Assign all critical work to other team members to bypass them indefinitely."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because an impartial mediator can help break impasses and create a workable agreement. Option b is incorrect because extra hours can increase stress and worsen conflict. Option a is incorrect because avoidance has already failed and will not resolve underlying issues. Option d is incorrect because bypassing them permanently wastes expertise and leaves conflict unresolved.",
    "difficulty": "hard",
    "topics": [
      "mediation",
      "escalated conflict"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-010",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict arises over allocation of a scarce specialist across two projects. What conflict resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "c",
        "label": "Facilitate a prioritization discussion with stakeholders to allocate the specialist based on value and urgency."
      },
      {
        "id": "b",
        "label": "Assign the specialist randomly without involving stakeholders."
      },
      {
        "id": "a",
        "label": "Let the specialist decide independently without context."
      },
      {
        "id": "d",
        "label": "Refuse to allocate the specialist to any project."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because stakeholder negotiation around value and urgency provides a transparent basis for allocation. Option b is incorrect because random allocation ignores strategic priorities. Option a is incorrect because the specialist may not have full visibility into portfolio priorities. Option d is incorrect because not allocating the specialist stalls both projects.",
    "difficulty": "medium",
    "topics": [
      "resource conflicts",
      "prioritization"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-011",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict over quality standards develops between testing and development. What resolution technique should the project manager recommend?",
    "options": [
      {
        "id": "c",
        "label": "Collaborate to define shared quality criteria, acceptance tests, and clear exit conditions."
      },
      {
        "id": "b",
        "label": "Ask one side to silently accept the other's view."
      },
      {
        "id": "a",
        "label": "Avoid discussing quality to prevent further disagreements."
      },
      {
        "id": "d",
        "label": "Rotate responsibility for defining standards with no input from the other group."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because jointly defining standards creates a common reference and shared accountability. Option b is incorrect because forced acceptance can breed resentment. Option a is incorrect because not discussing quality undermines outcomes. Option d is incorrect because unilateral control reduces collaboration and buy-in.",
    "difficulty": "medium",
    "topics": [
      "quality agreements",
      "collaborative standards"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-012",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict arises when a key decision is repeatedly revisited after being agreed. What conflict resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "c",
        "label": "Clarify the decision, document rationale and constraints, and agree on when it can be revisited."
      },
      {
        "id": "b",
        "label": "Allow the decision to be reopened at any time without structure."
      },
      {
        "id": "a",
        "label": "Ignore the repeated discussions and let the team argue."
      },
      {
        "id": "d",
        "label": "Remove decision-making authority from the team entirely."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because documenting rationale and revisit conditions stabilizes decisions while leaving room for change when warranted. Option b is incorrect because constant reopening erodes progress. Option a is incorrect because ignoring cycles wastes time and energy. Option d is incorrect because stripping authority reduces engagement and ownership.",
    "difficulty": "medium",
    "topics": [
      "decision stability",
      "conflict over decisions"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-013",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "After a heated disagreement, two team members avoid each other and collaboration suffers. What resolution approach should the project manager recommend?",
    "options": [
      {
        "id": "d",
        "label": "Hold a facilitated conversation to address concerns, acknowledge impacts, and agree on future working agreements."
      },
      {
        "id": "b",
        "label": "Keep them apart permanently and redesign the team structure around the conflict."
      },
      {
        "id": "c",
        "label": "Tell them to \"move on\" without providing support."
      },
      {
        "id": "a",
        "label": "Reassign all meaningful work to other team members indefinitely."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because facilitated dialogue and agreements help repair trust and restore collaboration. Option b is incorrect because restructuring around conflict can reward avoidance. Option c is incorrect because telling people to move on without support ignores emotional impacts. Option a is incorrect because reassigning all work sidelines them and wastes capacity.",
    "difficulty": "hard",
    "topics": [
      "relationship repair",
      "working agreements"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-014",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict between two departments over reporting lines is blocking progress. Which resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "d",
        "label": "Escalate to the appropriate governance body to make a structural decision based on organizational priorities."
      },
      {
        "id": "b",
        "label": "Ask the departments to ignore the issue and continue as before."
      },
      {
        "id": "c",
        "label": "Decide unilaterally without informing leadership."
      },
      {
        "id": "a",
        "label": "Assign reporting lines randomly and hope for acceptance."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because structural conflicts often require governance-level decisions aligned with organizational design. Option b is incorrect because ignoring structural issues leaves confusion unresolved. Option c is incorrect because unilateral changes without leadership buy-in may be reversed. Option a is incorrect because random assignments lack rationale and legitimacy.",
    "difficulty": "hard",
    "topics": [
      "structural conflict",
      "governance resolution"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-015",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict emerges over whether to use a predictive or agile approach. What conflict resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "d",
        "label": "Evaluate project characteristics and recommend a hybrid or single approach that best fits risk, complexity, and stakeholder needs."
      },
      {
        "id": "b",
        "label": "Select whichever approach is more popular on social media."
      },
      {
        "id": "c",
        "label": "Avoid the topic and let teams adopt any approach independently."
      },
      {
        "id": "a",
        "label": "Change the approach weekly to satisfy everyone."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because tailoring based on project needs reconciles preferences with suitability. Option b is incorrect because popularity does not determine fit. Option c is incorrect because uncoordinated methods create chaos. Option a is incorrect because constant changes undermine stability and learning.",
    "difficulty": "medium",
    "topics": [
      "method tailoring",
      "approach conflicts"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-016",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "Two teams conflict over whose features should be delivered first. What resolution approach should the project manager recommend?",
    "options": [
      {
        "id": "d",
        "label": "Use a transparent prioritization framework such as WSJF or MoSCoW with stakeholders."
      },
      {
        "id": "b",
        "label": "Flip a coin to choose the sequence."
      },
      {
        "id": "c",
        "label": "Select the team that complains the most to go first."
      },
      {
        "id": "a",
        "label": "Deliver features alphabetically by name."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because structured prioritization aligns delivery with value and risk. Option b is incorrect because random choice does not consider impact. Option c is incorrect because rewarding complaints encourages negative behavior. Option a is incorrect because alphabetical order is arbitrary.",
    "difficulty": "medium",
    "topics": [
      "prioritization frameworks",
      "conflict resolution"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-017",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict arises when one team member consistently interrupts others. Which resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "d",
        "label": "Establish facilitation rules such as speaking turns and reinforce them with the team member privately."
      },
      {
        "id": "b",
        "label": "Ignore the behavior and hope others adapt."
      },
      {
        "id": "c",
        "label": "Publicly shame the team member during meetings."
      },
      {
        "id": "a",
        "label": "Remove the team member from all future meetings immediately."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because clear meeting rules and private coaching address behavior while preserving dignity. Option b is incorrect because ignoring interruptions erodes respect and participation. Option c is incorrect because public shaming damages trust. Option a is incorrect because exclusion is extreme without prior attempts to correct behavior.",
    "difficulty": "easy",
    "topics": [
      "meeting norms",
      "behavioral conflict"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-018",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict between a vendor and internal QA over defect acceptance has stalled UAT. What resolution should the project manager recommend?",
    "options": [
      {
        "id": "d",
        "label": "Agree on objective acceptance criteria and severity thresholds, then re-evaluate defects together."
      },
      {
        "id": "b",
        "label": "Ask QA to accept all defects to avoid delay."
      },
      {
        "id": "c",
        "label": "Ask the vendor to fix everything regardless of severity immediately."
      },
      {
        "id": "a",
        "label": "Postpone UAT indefinitely until the conflict fades."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because shared criteria allow consistent, fair decisions. Option b is incorrect because accepting all defects compromises quality. Option c is incorrect because demanding all fixes immediately may be unrealistic and not risk-based. Option a is incorrect because delaying UAT indefinitely harms delivery.",
    "difficulty": "hard",
    "topics": [
      "acceptance criteria",
      "vendor conflicts"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-019",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict surfaces about who should communicate a major issue to the customer. What resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "a",
        "label": "Clarify ownership in the communication plan and, for this case, decide based on relationship and role."
      },
      {
        "id": "b",
        "label": "Ask no one to communicate and hope the issue is not noticed."
      },
      {
        "id": "c",
        "label": "Have everyone contact the customer separately with their own message."
      },
      {
        "id": "d",
        "label": "Assign the newest team member without support."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear communication ownership and a deliberate choice for this situation ensure consistent messaging. Option b is incorrect because hiding issues damages trust. Option c is incorrect because multiple uncoordinated messages confuse the customer. Option d is incorrect because assigning a new person without support risks miscommunication.",
    "difficulty": "medium",
    "topics": [
      "communication ownership",
      "issue handling"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-020",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "After analyzing a conflict, the project manager sees both sides have valid concerns about workload. What resolution should be recommended?",
    "options": [
      {
        "id": "a",
        "label": "Rebalance tasks collaboratively and adjust WIP limits to make workloads sustainable."
      },
      {
        "id": "b",
        "label": "Tell everyone that high workloads are normal and must be accepted."
      },
      {
        "id": "c",
        "label": "Assign all extra work to one person permanently."
      },
      {
        "id": "d",
        "label": "Avoid changing workloads to prevent setting a precedent."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because collaboratively rebalancing work and adjusting WIP addresses root causes and is sustainable. Option b is incorrect because normalizing overload risks burnout. Option c is incorrect because overloading one person is unfair and unsustainable. Option d is incorrect because refusing to adjust ignores legitimate concerns.",
    "difficulty": "medium",
    "topics": [
      "workload balance",
      "conflict resolution"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-021",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict arises because some team members feel decisions are made without their input. Which resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "a",
        "label": "Define which decisions require team input and establish a simple, inclusive decision-making process."
      },
      {
        "id": "b",
        "label": "Keep the decision process opaque to avoid slowing it down."
      },
      {
        "id": "c",
        "label": "Allow only managers to make all decisions without consultation."
      },
      {
        "id": "d",
        "label": "Stop making decisions until everyone agrees on everything."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clear, inclusive decision rules reconcile the need for input with the need for speed. Option b is incorrect because opacity fuels further conflict. Option c is incorrect because excluding the team undermines engagement. Option d is incorrect because insisting on unanimous agreement can paralyze progress.",
    "difficulty": "hard",
    "topics": [
      "decision processes",
      "inclusion"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-022",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A senior stakeholder disagrees with the team's risk response and conflict ensues. What resolution should the project manager recommend?",
    "options": [
      {
        "id": "a",
        "label": "Revisit the risk assessment with the stakeholder, compare options, and agree on a response that balance risk and value."
      },
      {
        "id": "b",
        "label": "Ignore the stakeholder's concerns and proceed."
      },
      {
        "id": "c",
        "label": "Ask the team to abandon risk management to avoid conflict."
      },
      {
        "id": "d",
        "label": "Automatically adopt the riskiest option to demonstrate confidence."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because jointly reviewing analysis and options can reconcile perspectives and secure agreement. Option b is incorrect because dismissing concerns damages trust. Option c is incorrect because abandoning risk management exposes the project. Option d is incorrect because selecting the riskiest option without agreement is irresponsible.",
    "difficulty": "hard",
    "topics": [
      "risk response",
      "stakeholder conflict"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-023",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict appears when some team members are reluctant to share bad news. What resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "a",
        "label": "Reinforce a \"no blame\" culture, model transparent reporting, and protect those who escalate issues."
      },
      {
        "id": "b",
        "label": "Penalize anyone who brings up problems."
      },
      {
        "id": "c",
        "label": "Stop status reporting so that no bad news is shared."
      },
      {
        "id": "d",
        "label": "Require that only anonymous surveys can mention issues."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because psychological safety and modeling transparency encourage honest communication and reduce fear. Option b is incorrect because punishment increases fear and concealment. Option c is incorrect because eliminating reporting hides risk. Option d is incorrect because relying only on anonymous surveys limits timely, actionable dialogue.",
    "difficulty": "medium",
    "topics": [
      "psychological safety",
      "escalation culture"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-024",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "A conflict results from misunderstandings around ground rules that were never written down. What resolution solution should the project manager recommend?",
    "options": [
      {
        "id": "a",
        "label": "Co-create and document clear team ground rules and review them with everyone."
      },
      {
        "id": "b",
        "label": "Assume everyone understands unwritten rules and move on."
      },
      {
        "id": "c",
        "label": "Let each person follow their own rules without alignment."
      },
      {
        "id": "d",
        "label": "Ask leadership to impose rules without team input."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because collaboratively documenting ground rules reduces ambiguity and provides a reference for behavior. Option b is incorrect because relying on unwritten rules invites further misunderstandings. Option c is incorrect because unaligned rules create chaos. Option d is incorrect because top-down rules without input can reduce buy-in.",
    "difficulty": "easy",
    "topics": [
      "ground rules",
      "team agreements"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-3-025",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-3"
    ],
    "text": "After a conflict is resolved, the project manager wants to prevent similar issues. What should be recommended as a follow-up conflict resolution step?",
    "options": [
      {
        "id": "a",
        "label": "Capture lessons learned and adjust team agreements, processes, or artifacts accordingly."
      },
      {
        "id": "b",
        "label": "Treat the resolution as a one-time event and make no changes."
      },
      {
        "id": "c",
        "label": "Avoid discussing the conflict in retrospectives to keep the mood positive."
      },
      {
        "id": "d",
        "label": "Remove all documentation about the conflict to erase the record."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because institutionalizing learning through updated agreements and processes reduces recurrence. Option b is incorrect because not adjusting anything wastes the opportunity to improve. Option c is incorrect because avoiding reflection limits growth. Option d is incorrect because erasing records prevents future teams from understanding what worked.",
    "difficulty": "medium",
    "topics": [
      "lessons learned",
      "preventive actions"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]
