[
  {
    "id": "q-people-1-1-001",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "Two team members are arguing about who owns a defect. What should the project manager do first to interpret the source and stage of this conflict?",
    "options": [
      {
        "id": "a",
        "label": "Assign blame based on the defect log entry."
      },
      {
        "id": "c",
        "label": "Meet with each person separately to understand perspectives and triggers."
      },
      {
        "id": "b",
        "label": "Escalate the issue to the functional manager immediately."
      },
      {
        "id": "d",
        "label": "Move the team members to different workstreams without discussion."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Meeting with each team member privately helps you understand their perspectives, triggers, and history so you can interpret both the source and stage of the conflict before acting. Assigning blame from the defect log, escalating immediately, or moving people to different workstreams skips diagnosis and can make the conflict worse instead of resolving it.",
    "difficulty": "easy",
    "topics": [
      "conflict management",
      "source of conflict"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-002",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A developer and a tester are disagreeing during a retrospective about whether a story was truly done. How can the project manager best interpret the source of this conflict?",
    "options": [
      {
        "id": "a",
        "label": "Ask the product owner to declare a winner so the meeting can move on."
      },
      {
        "id": "c",
        "label": "Review the Definition of Done and clarify how each person interpreted it."
      },
      {
        "id": "b",
        "label": "Extend the meeting until both parties agree entirely."
      },
      {
        "id": "d",
        "label": "Remove the story from the sprint and cancel the retrospective."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Reviewing the Definition of Done and how each person interpreted it connects the conflict directly to shared agreements and expectations. Asking the product owner to pick a winner, extending the meeting until there is full agreement, or cancelling the retrospective ignores the underlying misunderstanding and undermines team learning.",
    "difficulty": "medium",
    "topics": [
      "definition of done",
      "conflict source"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-003",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "Repeated disagreements over priorities suggest a deeper conflict between two senior team members. What should the project manager analyze first?",
    "options": [
      {
        "id": "a",
        "label": "Whether the team members are following the issue escalation process."
      },
      {
        "id": "c",
        "label": "Whether the conflict is about resources, recognition, or decision authority."
      },
      {
        "id": "b",
        "label": "Whether both team members attended the last town hall meeting."
      },
      {
        "id": "d",
        "label": "Whether the project communications plan was approved by the sponsor."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Analyzing whether the conflict is about resources, recognition, or decision authority helps you identify the real source and choose an appropriate resolution approach. Focusing on the escalation process, town hall attendance, or whether the communications plan was approved does not reveal what the disagreement is truly about.",
    "difficulty": "medium",
    "topics": [
      "conflict source",
      "team dynamics"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-004",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A conflict between a senior architect and a junior developer appears suddenly during a design review. To interpret the stage of this conflict, what should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Ask the architect to stop the discussion until after the meeting."
      },
      {
        "id": "c",
        "label": "Observe whether the disagreement is still about the problem or has shifted to personal attacks."
      },
      {
        "id": "b",
        "label": "Immediately reassign the developer to a different project."
      },
      {
        "id": "d",
        "label": "Send an email to HR requesting mediation."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Observing whether the conversation is still focused on the problem or has become personal shows how far the conflict has escalated and how urgent an intervention is. Simply stopping the discussion, reassigning the developer, or asking HR to step in immediately addresses symptoms but does not help you interpret the conflict stage.",
    "difficulty": "medium",
    "topics": [
      "conflict stages",
      "observation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-005",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "During sprint planning, team members disagree about story estimates. The discussion is lively but still respectful. How should the project manager interpret this conflict?",
    "options": [
      {
        "id": "c",
        "label": "As a healthy difference of opinion that can improve estimates."
      },
      {
        "id": "b",
        "label": "As a serious interpersonal conflict that requires HR intervention."
      },
      {
        "id": "a",
        "label": "As evidence that the team is not capable of self-organization."
      },
      {
        "id": "d",
        "label": "As a reason to cancel the sprint planning meeting immediately."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Respectful debate about estimates is a normal, healthy task conflict that can improve planning quality and team understanding. Treating this as a serious interpersonal issue that needs HR, assuming the team cannot self-organize, or cancelling sprint planning overreacts and may discourage constructive discussion.",
    "difficulty": "easy",
    "topics": [
      "healthy conflict",
      "estimation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-006",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A conflict over resource allocation has existed for several weeks and now includes personal remarks in emails. What does this suggest about the stage of the conflict?",
    "options": [
      {
        "id": "a",
        "label": "It is at an early stage and can be ignored."
      },
      {
        "id": "c",
        "label": "It has escalated beyond task disagreement and needs active intervention."
      },
      {
        "id": "b",
        "label": "It indicates the project charter is incomplete."
      },
      {
        "id": "d",
        "label": "It is a normal part of forming a team and will resolve itself."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Personal remarks and a conflict that has persisted for weeks indicate a later, escalated stage that requires active intervention. Saying it is early and can be ignored, blaming the project charter, or assuming it will resolve itself minimizes clear warning signs and delays needed action.",
    "difficulty": "medium",
    "topics": [
      "conflict stages",
      "escalation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-007",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A sponsor notices tension in meetings and asks you what is driving it. What is the best way to interpret the conflict source before responding?",
    "options": [
      {
        "id": "a",
        "label": "Review recent decision logs and talk with key participants to identify themes."
      },
      {
        "id": "b",
        "label": "Assume the tension is due to schedule pressure and assure the sponsor it is normal."
      },
      {
        "id": "c",
        "label": "Ask the sponsor for their opinion and adopt it as the explanation."
      },
      {
        "id": "d",
        "label": "Immediately re-baseline the schedule without further analysis."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Reviewing recent decisions and speaking with key participants helps you see patterns in scope, roles, or priorities that may be creating tension. Assuming it is just schedule pressure, adopting the sponsor's explanation without investigation, or re-baselining the schedule immediately bypasses proper analysis and can misdiagnose the conflict.",
    "difficulty": "medium",
    "topics": [
      "stakeholder communication",
      "conflict source"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-008",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "Team members disagree about whether a risk response was authorized. To interpret the conflict source, which document should you review first?",
    "options": [
      {
        "id": "a",
        "label": "The stakeholder engagement plan to see who attended meetings."
      },
      {
        "id": "d",
        "label": "The risk register and decision log that record approved responses."
      },
      {
        "id": "c",
        "label": "The project schedule to see when tasks were planned."
      },
      {
        "id": "b",
        "label": "The procurement management plan for vendor responsibilities."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Checking the risk register and decision log shows which responses were formally approved, clarifying whether the disagreement comes from missing authorization or miscommunication. Looking only at the stakeholder engagement plan, project schedule, or procurement management plan does not directly answer whether the risk response was authorized.",
    "difficulty": "medium",
    "topics": [
      "risk register",
      "decision log"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-009",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A new team member feels excluded from design decisions and voices frustration. What is the best first step to interpret this conflict?",
    "options": [
      {
        "id": "a",
        "label": "Remind them that decisions are made by senior team members only."
      },
      {
        "id": "d",
        "label": "Ask open-ended questions to understand how often they were invited and how they perceived interactions."
      },
      {
        "id": "c",
        "label": "Immediately rotate them off the project to avoid further disruption."
      },
      {
        "id": "b",
        "label": "Ask them to document all complaints in a formal risk log."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Asking open questions about invitations and interactions helps you understand whether the issue is inclusion, communication, or role clarity so you can respond appropriately. Telling the person that only senior members decide, immediately rotating them off the project, or pushing them to file formal complaints treats symptoms and can further damage trust.",
    "difficulty": "easy",
    "topics": [
      "inclusion",
      "conflict source"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-010",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "You notice that conflict arises only when technical debt stories are discussed. What does this pattern suggest?",
    "options": [
      {
        "id": "a",
        "label": "The conflict is driven by personal dislike between team members."
      },
      {
        "id": "d",
        "label": "The conflict source is disagreement over the value of paying down technical debt."
      },
      {
        "id": "c",
        "label": "The conflict is unrelated to project work and can be ignored."
      },
      {
        "id": "b",
        "label": "The conflict indicates a need to change the project sponsor."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Seeing conflict only when technical debt is discussed points to a disagreement about the value of paying down debt versus delivering new work. Assuming it is personal dislike, claiming it is unrelated to project work, or blaming the sponsor ignores the clear pattern tied to a specific topic.",
    "difficulty": "medium",
    "topics": [
      "patterns",
      "technical debt"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-011",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "Several quiet team members start withdrawing from discussions after a heated conflict last week. How should the project manager interpret this change?",
    "options": [
      {
        "id": "a",
        "label": "As a sign that all conflicts have been resolved successfully."
      },
      {
        "id": "d",
        "label": "As an indicator that unresolved conflict is affecting psychological safety."
      },
      {
        "id": "c",
        "label": "As a normal phase of team development that requires no action."
      },
      {
        "id": "b",
        "label": "As evidence that the project scope is too complex."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Withdrawal from discussions after a heated conflict is a sign that unresolved issues are harming psychological safety and participation. Interpreting this as proof that conflicts are resolved, as a normal phase needing no action, or as evidence that scope is too complex overlooks the impact on team climate.",
    "difficulty": "medium",
    "topics": [
      "psychological safety",
      "conflict impact"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-012",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "When a conflict arises between business analysts and developers about requirements, what should the project manager focus on first to interpret the source?",
    "options": [
      {
        "id": "a",
        "label": "How each group understood the acceptance criteria and business value."
      },
      {
        "id": "b",
        "label": "Which group has a higher charge-out rate to the project."
      },
      {
        "id": "c",
        "label": "Whether requirements were typed in a specific document template."
      },
      {
        "id": "d",
        "label": "If the conflict can be hidden from the sponsor."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Examining how each group understood acceptance criteria and business value targets the likely source of conflict in differing requirements interpretations. Comparing charge-out rates, worrying about the exact document template, or trying to hide the conflict from the sponsor does not address the misunderstanding about requirements.",
    "difficulty": "easy",
    "topics": [
      "requirements clarity",
      "conflict source"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-013",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A vendor and internal architect disagree sharply about a design approach. To interpret the stage of conflict, what should you observe?",
    "options": [
      {
        "id": "a",
        "label": "Whether discussions are still fact-based or have shifted to questioning competence."
      },
      {
        "id": "b",
        "label": "Whether the vendor has submitted the latest invoice on time."
      },
      {
        "id": "c",
        "label": "Whether the architect has updated the architecture diagrams."
      },
      {
        "id": "d",
        "label": "Whether the contract end date is approaching."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Watching whether the discussion stays fact-based or shifts to questioning competence tells you whether the conflict is escalating from task to personal. Tracking invoice timing, diagram updates, or contract end dates may matter to delivery but does not reveal the conflict stage between the individuals.",
    "difficulty": "medium",
    "topics": [
      "vendor management",
      "conflict stages"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-014",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A conflict about test coverage arises close to a major release. What does the timing suggest about the conflict stage?",
    "options": [
      {
        "id": "a",
        "label": "It is likely minor because it appears late in the schedule."
      },
      {
        "id": "d",
        "label": "It may be more intense because pressure is high near release."
      },
      {
        "id": "c",
        "label": "It is irrelevant because test coverage is a technical concern."
      },
      {
        "id": "b",
        "label": "It means the original requirements were not approved."
      }
    ],
    "correctOptionId": "d",
    "explanation": "A conflict about test coverage close to a major release is likely to be more intense because deadline pressure heightens emotion and perceived risk. Assuming it is minor because it appears late, dismissing coverage as irrelevant, or blaming unapproved requirements misreads why the timing matters.",
    "difficulty": "medium",
    "topics": [
      "schedule pressure",
      "conflict intensity"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-015",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "You suspect that a conflict between two leads is rooted in different interpretations of their roles. What should you review first?",
    "options": [
      {
        "id": "a",
        "label": "The resource calendars for each lead."
      },
      {
        "id": "d",
        "label": "The RACI or role descriptions to see how responsibilities are defined."
      },
      {
        "id": "c",
        "label": "The procurement contracts with external vendors."
      },
      {
        "id": "b",
        "label": "The organization-wide vacation policy."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Reviewing the RACI or role descriptions shows how responsibilities are defined and whether overlapping roles are causing the conflict. Looking at resource calendars, vendor contracts, or the general vacation policy does not clarify who is accountable for which decisions.",
    "difficulty": "easy",
    "topics": [
      "roles and responsibilities",
      "RACI"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-016",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A conflict emerges every time overtime is requested. What is the most likely conflict source to explore?",
    "options": [
      {
        "id": "a",
        "label": "Differences in compensation expectations, workload, and work-life balance."
      },
      {
        "id": "b",
        "label": "Differences in preferred project management software tools."
      },
      {
        "id": "c",
        "label": "Differences in office seating arrangements."
      },
      {
        "id": "d",
        "label": "Differences in understanding of corporate branding guidelines."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Conflicts that flare whenever overtime is requested often stem from concerns about compensation, workload, and work-life balance. Focusing on software tools, seating arrangements, or branding guidelines ignores the fairness and personal impact issues driving the tension.",
    "difficulty": "medium",
    "topics": [
      "workload",
      "work-life balance"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-017",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "You notice private chat messages becoming sarcastic after a failed deployment. What does this behavior suggest?",
    "options": [
      {
        "id": "a",
        "label": "The team has high psychological safety."
      },
      {
        "id": "b",
        "label": "Frustration is present and the conflict may be moving from issue-focused to person-focused."
      },
      {
        "id": "c",
        "label": "The team has fully accepted the failure and moved on."
      },
      {
        "id": "d",
        "label": "The team is ready for immediate celebrations."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Sarcastic private messages after a failed deployment suggest frustration and that the conflict may be shifting from the issue itself to judgments about people. Interpreting this as high psychological safety, full acceptance of the failure, or readiness to celebrate misreads the warning signs in the behavior.",
    "difficulty": "medium",
    "topics": [
      "team behavior",
      "conflict signals"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-018",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "Two senior engineers disagree about architecture and avoid speaking directly, instead using you as a go-between. How should you interpret this behavior?",
    "options": [
      {
        "id": "a",
        "label": "As a sign that the conflict is resolved."
      },
      {
        "id": "b",
        "label": "As a sign of avoidance and an escalating stage of conflict."
      },
      {
        "id": "c",
        "label": "As a sign that they are collaborating effectively."
      },
      {
        "id": "d",
        "label": "As a sign that the project schedule is too aggressive."
      }
    ],
    "correctOptionId": "b",
    "explanation": "When senior engineers use you as a go-between instead of speaking directly, it signals avoidance and a deeper, escalating conflict that needs to be addressed. Assuming the conflict is resolved, claiming it shows effective collaboration, or blaming the schedule ignores the relational problem.",
    "difficulty": "medium",
    "topics": [
      "avoidance",
      "conflict stages"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-019",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "You are new to a project and sense underlying tension in meetings. What is the best first step to interpret both source and stage of conflicts?",
    "options": [
      {
        "id": "a",
        "label": "Ask each person to submit written complaints immediately."
      },
      {
        "id": "b",
        "label": "Conduct one-on-one conversations and review historical decisions and escalations."
      },
      {
        "id": "c",
        "label": "Cancel all meetings until tension disappears."
      },
      {
        "id": "d",
        "label": "Replace the entire team with new members."
      }
    ],
    "correctOptionId": "b",
    "explanation": "One-on-one conversations combined with a review of past decisions and escalations give you context about how long conflicts have existed and what drives them. Demanding written complaints immediately, cancelling all meetings, or replacing the whole team are extreme reactions that do not first seek to understand the source and stage.",
    "difficulty": "hard",
    "topics": [
      "transition",
      "conflict diagnosis"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-020",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A conflict between two departments appears during budgeting. What should you analyze to interpret the source most effectively?",
    "options": [
      {
        "id": "a",
        "label": "Historical budget allocations, incentives, and perceived fairness between departments."
      },
      {
        "id": "b",
        "label": "The color scheme of the budgeting spreadsheet."
      },
      {
        "id": "c",
        "label": "The office location of each department."
      },
      {
        "id": "d",
        "label": "The number of meetings scheduled for the year."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Analyzing historical budget allocations, incentives, and perceived fairness helps you see whether structural or political factors are driving the conflict between departments. Looking at spreadsheet colors, office locations, or the number of meetings does not uncover the underlying concerns about equity and resources.",
    "difficulty": "hard",
    "topics": [
      "budget",
      "organizational politics"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-021",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A long-standing personal rivalry between two leaders surfaces during steering committee meetings. What does this history tell you about the conflict?",
    "options": [
      {
        "id": "a",
        "label": "It is a new task-related conflict that will be easy to resolve."
      },
      {
        "id": "b",
        "label": "It is an entrenched interpersonal conflict that may require escalation or formal mediation."
      },
      {
        "id": "c",
        "label": "It is unrelated to the project and can be ignored safely."
      },
      {
        "id": "d",
        "label": "It indicates the project charter must be completely rewritten."
      }
    ],
    "correctOptionId": "b",
    "explanation": "A long history of rivalry indicates an entrenched interpersonal conflict that may require escalation or formal mediation beyond routine project management. Treating it as a new, simple task dispute, ignoring it as unrelated to the project, or rewriting the charter misses how deep and persistent the relationship issue is.",
    "difficulty": "hard",
    "topics": [
      "interpersonal conflict",
      "mediation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-022",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "Conflicts appear only when prioritizing regulatory work against new features. What is the most likely conflict source?",
    "options": [
      {
        "id": "a",
        "label": "Differing views on the relative value of compliance work versus new features."
      },
      {
        "id": "b",
        "label": "Different preferences for meeting room locations."
      },
      {
        "id": "c",
        "label": "Different choices of instant messaging tools."
      },
      {
        "id": "d",
        "label": "Different attitudes toward office dress code."
      }
    ],
    "correctOptionId": "a",
    "explanation": "If conflict appears only when regulatory work competes with new features, the likely source is different views on the value of compliance versus innovation. Preferences for meeting rooms, messaging tools, or dress code are peripheral and do not explain why tension spikes around regulatory prioritization.",
    "difficulty": "hard",
    "topics": [
      "compliance",
      "value conflict"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-023",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "A previously collaborative team suddenly starts competing for visibility after a reorganization. How should you interpret this shift?",
    "options": [
      {
        "id": "a",
        "label": "As a clear sign that the project objectives have been met."
      },
      {
        "id": "b",
        "label": "As a new conflict source driven by changed incentives and reporting lines."
      },
      {
        "id": "c",
        "label": "As an indication that no one understands the requirements."
      },
      {
        "id": "d",
        "label": "As a sign that the WBS needs to be decomposed further."
      }
    ],
    "correctOptionId": "b",
    "explanation": "A shift from collaboration to competition for visibility after a reorganization suggests new incentives and reporting lines are driving conflict. Concluding that project objectives are met, assuming no one understands requirements, or blaming the work breakdown structure ignores how structural changes alter behavior.",
    "difficulty": "hard",
    "topics": [
      "organizational change",
      "conflict source"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-024",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "You observe eye-rolling and side conversations whenever a particular stakeholder speaks. What does this suggest about the conflict stage?",
    "options": [
      {
        "id": "a",
        "label": "There is no conflict; the team is fully engaged."
      },
      {
        "id": "b",
        "label": "The conflict has moved into a passive, undermining stage that damages trust."
      },
      {
        "id": "c",
        "label": "The conflict is purely technical and limited to requirements."
      },
      {
        "id": "d",
        "label": "The conflict has ended and requires no action."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Eye-rolling and side conversations when a stakeholder speaks are nonverbal signs of a passive, undermining stage of conflict that is damaging trust. Claiming there is no conflict, treating it as purely technical, or assuming it has ended overlooks the disrespect and continuing tension.",
    "difficulty": "hard",
    "topics": [
      "nonverbal cues",
      "conflict observation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-1-1-025",
    "domainId": "people",
    "taskId": "people-1",
    "enablerIds": [
      "e-people-1-1"
    ],
    "text": "You are asked to step into a project with open escalations between teams. To interpret conflict sources quickly, what should you do first?",
    "options": [
      {
        "id": "a",
        "label": "Review escalation logs and meet key parties to understand interests and history."
      },
      {
        "id": "b",
        "label": "Immediately cancel all escalations to reset the environment."
      },
      {
        "id": "c",
        "label": "Ignore escalations and focus only on technical issues."
      },
      {
        "id": "d",
        "label": "Freeze the budget until all conflicts disappear."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Reviewing escalation logs and meeting with key parties quickly gives you insight into both the origins and current stage of conflicts so you can plan a response. Cancelling escalations, ignoring them, or freezing the budget are reactive moves that do not first build understanding and may worsen stakeholder relationships.",
    "difficulty": "hard",
    "topics": [
      "escalation history",
      "conflict diagnosis"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]
