[
  {
    "id": "q-process-5-2-001",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager has completed initial budget estimation and is now identifying potential future budget challenges. What should be their primary focus in this process?",
    "options": [
      {
        "id": "a",
        "label": "Focus only on the most obvious potential cost overruns."
      },
      {
        "id": "b",
        "label": "Identify a comprehensive range of potential budget risks and challenges."
      },
      {
        "id": "c",
        "label": "Concentrate on challenges that have occurred in the project's current phase."
      },
      {
        "id": "d",
        "label": "Document only the budget challenges that have already materialized."
      }
    ],
    "correctOptionId": "b",
    "explanation": "When anticipating future budget challenges, the project manager should identify a comprehensive range of potential budget risks and challenges. This proactive approach helps prepare for various scenarios and reduces the likelihood of being caught off-guard by budget issues.",
    "difficulty": "easy",
    "topics": [
      "budget risk identification",
      "future planning"
    ],
    "process": "identify-risks",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-5-2-002",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is working on a project with strict regulatory compliance requirements. What budget challenge should they anticipate specifically related to compliance?",
    "options": [
      {
        "id": "a",
        "label": "Additional costs for compliance audits, reporting, and potential penalties."
      },
      {
        "id": "b",
        "label": "No specific budget challenges related to regulatory compliance."
      },
      {
        "id": "c",
        "label": "Costs related only to the initial regulatory approval process."
      },
      {
        "id": "d",
        "label": "Reduced costs due to standardized regulatory processes."
      }
    ],
    "correctOptionId": "b",
    "explanation": "For projects with regulatory compliance requirements, additional costs for audits, reporting, and potential penalties should be anticipated. The correct answer is option A, not B. Option B incorrectly suggests no specific budget challenges related to compliance.",
    "difficulty": "easy",
    "topics": [
      "regulatory compliance",
      "compliance costs"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-003",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with multiple departments involved. What challenge is most likely to arise?",
    "options": [
      {
        "id": "a",
        "label": "Cost allocation disputes between departments over shared resources."
      },
      {
        "id": "b",
        "label": "Reduced overall costs due to shared departmental resources."
      },
      {
        "id": "c",
        "label": "No budget challenges since departments will evenly split project costs."
      },
      {
        "id": "d",
        "label": "Budget challenges related only to the department that initiated the project."
      }
    ],
    "correctOptionId": "c",
    "explanation": "When multiple departments are involved, cost allocation disputes over shared resources are likely to arise. The correct answer is option A, not C. Option C incorrectly suggests no budget challenges despite multiple departments being involved.",
    "difficulty": "medium",
    "topics": [
      "departmental costs",
      "resource allocation"
    ],
    "process": "determine-budget",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-5-2-004",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project that includes external vendor resources. Which challenge should be prioritized?",
    "options": [
      {
        "id": "a",
        "label": "Scope creep from vendors and potential cost overruns."
      },
      {
        "id": "b",
        "label": "No budget challenges expected with properly contracted vendors."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to initial vendor selection and contracting."
      },
      {
        "id": "d",
        "label": "Reduced costs due to vendor efficiency and expertise."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Scope creep and cost overruns from vendors are common budget risks that must be anticipated and managed, so option a is correct. Option b is incorrect because assuming no budget challenges is unrealistic. Option c is incorrect because risks extend beyond initial contracting. Option d is incorrect because efficiency is not guaranteed and does not replace risk planning.",
    "difficulty": "medium",
    "topics": [
      "vendor costs",
      "outsourcing risks"
    ],
    "process": "control-procurements",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-5-2-005",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is working on a project with high public visibility. What budget challenge should they anticipate as a result?",
    "options": [
      {
        "id": "a",
        "label": "Increased costs for public reporting, communications, and potential scrutiny."
      },
      {
        "id": "b",
        "label": "No additional budget challenges due to public visibility."
      },
      {
        "id": "c",
        "label": "Reduced costs due to public support and potential sponsorships."
      },
      {
        "id": "d",
        "label": "Budget challenges related only to the project initiation phase."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Projects with high public visibility often require additional costs for reporting, communications, and managing scrutiny. The correct answer is option A, not B. Option B incorrectly suggests no additional budget challenges due to visibility.",
    "difficulty": "medium",
    "topics": [
      "public visibility",
      "visibility costs"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-5-2-006",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges in a project with rapidly changing requirements. What should be their primary concern?",
    "options": [
      {
        "id": "a",
        "label": "Cost overruns due to rework, scope changes, and schedule acceleration."
      },
      {
        "id": "b",
        "label": "Reduced costs due to more efficient requirement changes."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the initial requirements definition."
      },
      {
        "id": "d",
        "label": "No budget challenges if requirements changes are properly managed."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Projects with rapidly changing requirements face cost overruns from rework and scope changes. The correct answer is option A, not D. Option D incorrectly suggests no budget challenges despite acknowledged rapid change.",
    "difficulty": "medium",
    "topics": [
      "changing requirements",
      "scope creep"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-5-2-007",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with limited budget for the estimation process itself. How should this constraint affect their anticipation of future challenges?",
    "options": [
      {
        "id": "a",
        "label": "Increase focus on identifying challenges that could have significant financial impact."
      },
      {
        "id": "b",
        "label": "Reduce the scope of challenge anticipation to match the limited budget."
      },
      {
        "id": "c",
        "label": "Focus only on challenges that occurred in similar projects with limited budgets."
      },
      {
        "id": "d",
        "label": "No need to anticipate budget challenges if the estimation budget is limited."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Even with limited budget for estimation, the project manager should still anticipate significant financial impact challenges. The correct answer is option A, not D. Option D incorrectly suggests no need to anticipate challenges despite the constraint.",
    "difficulty": "hard",
    "topics": [
      "estimation constraints",
      "priority focus"
    ],
    "process": "estimate-costs",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-5-2-008",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges across different phases of a multi-phase project. How should their focus differ between phases?",
    "options": [
      {
        "id": "a",
        "label": "Identify phase-specific challenges based on the work and resources needed in each phase."
      },
      {
        "id": "b",
        "label": "Apply the same challenge identification approach to all project phases."
      },
      {
        "id": "c",
        "label": "Focus only on challenges relevant to the current project phase."
      },
      {
        "id": "d",
        "label": "Complete all challenge anticipation during the first project phase."
      }
    ],
    "correctOptionId": "b",
    "explanation": "For multi-phase projects, challenges should be identified based on phase-specific work and resources. The correct answer is option A, not B. Option B incorrectly suggests a uniform approach to challenge identification across all phases.",
    "difficulty": "medium",
    "topics": [
      "project phases",
      "phase-specific risks"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-009",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with stakeholders from different cultural backgrounds. What challenge should they consider?",
    "options": [
      {
        "id": "a",
        "label": "Potential differences in cost expectations and business practices across cultures."
      },
      {
        "id": "b",
        "label": "No budget challenges related to cultural differences in project management."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to communication differences between cultures."
      },
      {
        "id": "d",
        "label": "Reduced costs due to diverse cultural perspectives on project management."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Cultural differences can result in varying cost expectations and business practices. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges related to cultural differences.",
    "difficulty": "hard",
    "topics": [
      "cultural differences",
      "cultural cost factors"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-5-2-010",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is working on a project with tight schedule constraints. How should this influence their anticipation of budget challenges?",
    "options": [
      {
        "id": "a",
        "label": "Identify potential costs of schedule acceleration, overtime, and fast-tracking."
      },
      {
        "id": "b",
        "label": "No budget challenges are expected with tight schedule constraints."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the project scheduling tools and processes."
      },
      {
        "id": "d",
        "label": "Reduced costs due to more focused and efficient project execution."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Tight schedules often lead to acceleration costs, overtime, and fast-tracking expenses. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges with tight schedules.",
    "difficulty": "medium",
    "topics": [
      "time constraints",
      "schedule acceleration costs"
    ],
    "process": "develop-schedule",
    "knowledgeAreaId": "schedule"
  },
  {
    "id": "q-process-5-2-011",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with high security requirements. What security-related cost challenge should be prioritized?",
    "options": [
      {
        "id": "a",
        "label": "Additional costs for security measures, certifications, monitoring, and compliance."
      },
      {
        "id": "b",
        "label": "No budget challenges related to security requirements."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to initial security implementation."
      },
      {
        "id": "d",
        "label": "Reduced costs due to security measures preventing other project risks."
      }
    ],
    "correctOptionId": "b",
    "explanation": "High security requirements bring additional costs for measures, certifications, and compliance. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges related to security requirements.",
    "difficulty": "hard",
    "topics": [
      "security requirements",
      "security costs"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-5-2-012",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges with multiple external partner organizations. What partnership-related challenge should they expect?",
    "options": [
      {
        "id": "a",
        "label": "Coordination costs, potential change orders, and different overhead rates."
      },
      {
        "id": "b",
        "label": "No specific budget challenges with properly selected partners."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the initial partner selection process."
      },
      {
        "id": "d",
        "label": "Reduced costs due to shared resources and expertise across partners."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Multiple partners can create coordination costs and other financial challenges. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges with external partners.",
    "difficulty": "medium",
    "topics": [
      "external partnerships",
      "partner coordination costs"
    ],
    "process": "control-procurements",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-5-2-013",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges when stakeholders have different communication preferences and technological capabilities. How does this affect budget planning?",
    "options": [
      {
        "id": "a",
        "label": "Potential costs for various communication tools and methods to accommodate preferences."
      },
      {
        "id": "b",
        "label": "No budget impact from different communication preferences."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the most advanced communication technologies."
      },
      {
        "id": "d",
        "label": "Reduced costs by standardizing on one communication method for all stakeholders."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Different communication preferences can require various tools and methods with associated costs. The correct answer is option A, not B. Option B incorrectly suggests no budget impact from communication preferences.",
    "difficulty": "medium",
    "topics": [
      "communication preferences",
      "communication costs"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-5-2-014",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with a history of budget overruns in similar projects. What historical insight should guide their anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Identify the specific cost areas where overruns typically occurred in similar projects."
      },
      {
        "id": "b",
        "label": "No need to consider historical overruns in future budget planning."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the exact same project activities as past overruns."
      },
      {
        "id": "d",
        "label": "Reduced likelihood of overruns since lessons have been learned from past projects."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Historical data should inform the anticipation of specific cost areas prone to overruns. The correct answer is option A, not B. Option B incorrectly suggests no need to consider historical overruns when they should inform planning.",
    "difficulty": "hard",
    "topics": [
      "historical data",
      "lessons learned"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-015",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project that will significantly change business operations. What change-related cost challenge should be prioritized?",
    "options": [
      {
        "id": "a",
        "label": "Costs for change management, training, transition, and potential resistance."
      },
      {
        "id": "b",
        "label": "No budget challenges from organizational change activities."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the most supportive stakeholder groups."
      },
      {
        "id": "d",
        "label": "Reduced costs due to improved efficiency from the business changes."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Significant business changes require costs for change management and training. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges from significant organizational changes.",
    "difficulty": "medium",
    "topics": [
      "organizational change",
      "change management costs"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-5-2-016",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges across multiple organizational levels. How should hierarchy affect their challenge anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Consider approval costs, reporting overhead, and coordination needs at each level."
      },
      {
        "id": "b",
        "label": "Apply the same budget challenge anticipation approach to all levels."
      },
      {
        "id": "c",
        "label": "Focus only on budget challenges at the senior management level."
      },
      {
        "id": "d",
        "label": "No budget challenges related to organizational hierarchy differences."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Different organizational levels may have different approval and reporting costs. The correct answer is option A, not B. Option B incorrectly suggests a uniform approach despite level-specific requirements.",
    "difficulty": "medium",
    "topics": [
      "organizational hierarchy",
      "multi-level costs"
    ],
    "process": "determine-budget",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-5-2-017",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with significant technical complexity. What technical cost challenge should be prioritized?",
    "options": [
      {
        "id": "a",
        "label": "Additional costs for specialized expertise, tools, testing, and potential rework."
      },
      {
        "id": "b",
        "label": "No budget challenges related to technical complexity."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the most technically advanced project elements."
      },
      {
        "id": "d",
        "label": "Reduced costs due to efficiency gains from advanced technical approaches."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Technical complexity brings costs for specialized resources and potential rework. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges from technical complexity.",
    "difficulty": "medium",
    "topics": [
      "technical complexity",
      "complexity costs"
    ],
    "process": "estimate-costs",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-5-2-018",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with environmental impact considerations. What environmental cost challenge should be considered?",
    "options": [
      {
        "id": "a",
        "label": "Costs for environmental assessments, compliance, mitigation, and potential penalties."
      },
      {
        "id": "b",
        "label": "Environmental considerations should not impact budget planning."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to initial environmental impact assessments."
      },
      {
        "id": "d",
        "label": "Reduced costs due to environmental regulations streamlining project processes."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Environmental factors create costs for assessments, compliance, and potential penalties. The correct answer is option A, not B. Option B incorrectly suggests environmental considerations don't impact budget planning.",
    "difficulty": "medium",
    "topics": [
      "environmental impact",
      "environmental costs"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-019",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with limited team experience in cost management. How should this capability constraint influence their anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Include potential costs for training, expert consultation, and possible estimation errors."
      },
      {
        "id": "b",
        "label": "No need to anticipate budget challenges due to team inexperience."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the team's most experienced cost management areas."
      },
      {
        "id": "d",
        "label": "Reduced costs since inexperience prevents overestimation of project challenges."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Team inexperience may require training and expert consultation costs. The correct answer is option A, not B. Option B incorrectly suggests no need to anticipate challenges from team inexperience.",
    "difficulty": "medium",
    "topics": [
      "team experience",
      "capability gaps"
    ],
    "process": "develop-team",
    "knowledgeAreaId": "resource"
  },
  {
    "id": "q-process-5-2-020",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with global team members across different regions. What geographic cost challenge should be prioritized?",
    "options": [
      {
        "id": "a",
        "label": "Different regional costs, travel requirements, and communication expenses."
      },
      {
        "id": "b",
        "label": "No budget challenges from geographic distribution of team members."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the project manager's region."
      },
      {
        "id": "d",
        "label": "Reduced costs due to access to lower-cost resources in different regions."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Global distribution creates costs for travel, communication, and regional differences. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges from geographic distribution.",
    "difficulty": "hard",
    "topics": [
      "global projects",
      "geographic cost factors"
    ],
    "process": "estimate-costs",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-5-2-021",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with multiple competing objectives. How should objective trade-offs affect their challenge anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Consider potential costs from conflicting priorities and scope adjustments."
      },
      {
        "id": "b",
        "label": "No budget challenges from competing objectives if properly balanced."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the highest-priority project objectives."
      },
      {
        "id": "d",
        "label": "Reduced costs since competing objectives lead to more efficient resource use."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Competing objectives can create costs from conflicting priorities and changes. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges from competing objectives.",
    "difficulty": "hard",
    "topics": [
      "competing objectives",
      "objective trade-offs"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-022",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges with limited access to historical cost data. How should this information constraint affect their anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Increase focus on identifying challenges despite limited historical data."
      },
      {
        "id": "b",
        "label": "No need to anticipate budget challenges without historical data."
      },
      {
        "id": "c",
        "label": "Budget challenges only from the specific data gaps identified."
      },
      {
        "id": "d",
        "label": "Reduced costs since limited data prevents overestimation of challenges."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Even with limited data, the project manager should still anticipate potential challenges. The correct answer is option A, not B. Option B incorrectly suggests no need to anticipate challenges without historical data.",
    "difficulty": "medium",
    "topics": [
      "limited data",
      "uncertainty management"
    ],
    "process": "estimate-costs",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-5-2-023",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with multiple parallel work streams. How should the project structure influence their challenge anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Identify resource conflicts, coordination costs, and dependencies between streams."
      },
      {
        "id": "b",
        "label": "Apply the same challenge anticipation to all parallel work streams."
      },
      {
        "id": "c",
        "label": "Focus only on the most critical parallel work stream for challenge identification."
      },
      {
        "id": "d",
        "label": "No budget challenges from parallel work streams if properly planned."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Parallel work streams can create resource conflicts and coordination costs. The correct answer is option A, not D. Option D incorrectly suggests no budget challenges from parallel streams despite their complexity.",
    "difficulty": "hard",
    "topics": [
      "parallel work streams",
      "resource conflicts"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-024",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with rapidly evolving technology. What technology-related challenge should they prioritize?",
    "options": [
      {
        "id": "a",
        "label": "Costs for technology updates, retraining, obsolescence, and potential rework."
      },
      {
        "id": "b",
        "label": "No budget challenges from evolving technology if properly planned."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to the initial technology selection."
      },
      {
        "id": "d",
        "label": "Reduced costs due to efficiency gains from newer technology adoption."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Evolving technology can create costs for updates, retraining, and obsolescence. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges from evolving technology.",
    "difficulty": "hard",
    "topics": [
      "evolving technology",
      "technology obsolescence"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-5-2-025",
    "domainId": "process",
    "taskId": "process-5",
    "enablerIds": [
      "e-process-5-2"
    ],
    "text": "A project manager is anticipating budget challenges for a project with a compressed timeline. How should time pressure affect their challenge anticipation?",
    "options": [
      {
        "id": "a",
        "label": "Identify potential costs from schedule compression techniques and quality shortcuts."
      },
      {
        "id": "b",
        "label": "No budget challenges from compressed timelines if properly managed."
      },
      {
        "id": "c",
        "label": "Budget challenges only related to initial timeline compression decisions."
      },
      {
        "id": "d",
        "label": "Reduced costs due to more focused and efficient project execution under pressure."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Compressed timelines often lead to costs from schedule compression techniques. The correct answer is option A, not B. Option B incorrectly suggests no budget challenges from compressed timelines.",
    "difficulty": "medium",
    "topics": [
      "schedule compression",
      "time pressure costs"
    ],
    "process": "develop-schedule",
    "knowledgeAreaId": "schedule"
  }
]
