[
  {
    "id": "q-people-8-2-001",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is preparing to negotiate with a software vendor. The project sponsor indicates that 'Time to Market' is the single most important factor, even if it costs 20% more. This statement helps the project manager determine:",
    "options": [
      {
        "id": "a",
        "label": "The ultimate objective and the primary trade-off variable (Cost vs. Speed)."
      },
      {
        "id": "b",
        "label": "The vendor's profit margin."
      },
      {
        "id": "c",
        "label": "That the project has unlimited budget."
      },
      {
        "id": "d",
        "label": "The technical specifications of the software."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. Assessing priorities involves understanding the hierarchy of constraints. The sponsor has explicitly placed **Speed** (Time to Market) above **Cost**. This defines the **Ultimate Objective** (launch fast) and guides the PM's negotiation strategy (trade money for speed).",
    "difficulty": "medium",
    "topics": [
      "trade-offs",
      "objectives"
    ]
  },
  {
    "id": "q-people-8-2-002",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "During a requirements workshop, stakeholders are adding numerous features to the wish list for a vendor contract. To assess priorities effectively before negotiating the scope, which technique should the project manager use?",
    "options": [
      {
        "id": "a",
        "label": "MoSCoW Analysis (Must have, Should have, Could have, Won't have)."
      },
      {
        "id": "b",
        "label": "Fishbone Diagram."
      },
      {
        "id": "c",
        "label": "Monte Carlo Simulation."
      },
      {
        "id": "d",
        "label": "Plan-Do-Check-Act cycle."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. **MoSCoW Analysis** is a standard prioritization technique used to categorize requirements based on their necessity. This helps determine which objectives are non-negotiable ('Must Have') and which are tradeable ('Could Have') during the negotiation.",
    "difficulty": "easy",
    "topics": [
      "prioritization techniques",
      "MoSCoW"
    ]
  },
  {
    "id": "q-people-8-2-003",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is negotiating an internal service level agreement (SLA) with the operations team. The operations manager wants to minimize downtime risk. The project manager wants to maximize deployment frequency. To find a resolution, they agree that the 'Ultimate Objective' is 'Customer Satisfaction.' This is an example of:",
    "options": [
      {
        "id": "a",
        "label": "Finding a shared, higher-level goal to align conflicting priorities."
      },
      {
        "id": "b",
        "label": "Ignoring the technical details."
      },
      {
        "id": "c",
        "label": "Giving in to the operations manager."
      },
      {
        "id": "d",
        "label": "Scope creep."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. When priorities conflict (Stability vs. Speed), identifying the **Ultimate Objective** (Customer Satisfaction) acts as a north star. It allows the parties to negotiate a solution (e.g., automated testing) that serves the shared goal rather than fighting over their individual priorities.",
    "difficulty": "medium",
    "topics": [
      "conflict resolution",
      "shared goals"
    ]
  },
  {
    "id": "q-people-8-2-004",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The project involves sensitive customer data. When negotiating with a cloud provider, the provider offers a significant discount if the data is stored on shared public servers. The project manager rejects this offer immediately. What priority assessment drove this decision?",
    "options": [
      {
        "id": "a",
        "label": "Cost is the highest priority."
      },
      {
        "id": "b",
        "label": "Security/Compliance is a non-negotiable 'Must Have' objective that overrides Cost."
      },
      {
        "id": "c",
        "label": "The project manager dislikes the cloud provider."
      },
      {
        "id": "d",
        "label": "Speed is the highest priority."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. In assessing priorities, **Security and Compliance** are often 'hard constraints' or 'Must Haves.' Even though Cost is important, the Ultimate Objective of protecting customer data takes precedence. The PM correctly assessed that the discount (Cost) was not worth compromising the primary objective (Security).",
    "difficulty": "medium",
    "topics": [
      "security",
      "constraints",
      "prioritization"
    ]
  },
  {
    "id": "q-people-8-2-005",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager creates a 'Weighted Scoring Model' for vendor selection. Price is weighted at 20%, Technical Capability at 50%, and Past Performance at 30%. What does this model explicitly define?",
    "options": [
      {
        "id": "a",
        "label": "The negotiation team's contact list."
      },
      {
        "id": "b",
        "label": "The relative priorities of the project objectives."
      },
      {
        "id": "c",
        "label": "The BATNA."
      },
      {
        "id": "d",
        "label": "The Zone of Possible Agreement (ZOPA)."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. A **Weighted Scoring Model** is a tool specifically designed to quantify and visualize the **relative priorities** of different objectives. By assigning 50% to Technical Capability, the PM has defined that quality/ability is the ultimate objective, far more important than price (20%).",
    "difficulty": "medium",
    "topics": [
      "weighted scoring",
      "vendor selection"
    ]
  },
  {
    "id": "q-people-8-2-006",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "In a negotiation, the project manager realizes that the other party places a high priority on 'Publicity' (being able to use the client's logo), whereas the project manager cares little about this. This difference in priorities allows the project manager to:",
    "options": [
      {
        "id": "a",
        "label": "Refuse the request to assert dominance."
      },
      {
        "id": "b",
        "label": "Trade the 'Publicity' right (low cost to PM, high value to vendor) for a concession on Price (high value to PM)."
      },
      {
        "id": "c",
        "label": "Cancel the negotiation due to mismatched values."
      },
      {
        "id": "d",
        "label": "Ignore the request."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. This is the essence of **Integrative Negotiation**. By assessing that the parties have **differing priorities**, the PM can 'trade' items. Giving something that is low priority/cost to you but high value to them creates a win-win and advances the PM's ultimate objective (Price).",
    "difficulty": "hard",
    "topics": [
      "negotiation strategy",
      "integrative negotiation"
    ]
  },
  {
    "id": "q-people-8-2-007",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is negotiating a contract for a long-term partnership. The vendor offers a very low price but demands an aggressive 1-year cancellation clause. The project manager's ultimate objective is 'Long-term Stability' to minimize risk. Based on this objective, the project manager should:",
    "options": [
      {
        "id": "a",
        "label": "Accept the low price because saving money is always good."
      },
      {
        "id": "b",
        "label": "Reject the cancellation clause and negotiate for a multi-year term, even if it means paying a slightly higher price."
      },
      {
        "id": "c",
        "label": "Accept the deal and hope the vendor doesn't cancel."
      },
      {
        "id": "d",
        "label": "Counter-offer with an even lower price."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Priorities dictate decisions. If the **Ultimate Objective** is **Stability**, accepting a risk (cancellation clause) for a benefit (low price) is a strategic error. The PM should prioritize the term length over the price to align with the objective.",
    "difficulty": "medium",
    "topics": [
      "strategic alignment",
      "risk vs cost"
    ]
  },
  {
    "id": "q-people-8-2-008",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "An agile team is assessing priorities for the next release. They have two objectives: 1. Fix technical debt to improve velocity. 2. Release Feature X to beat a competitor. The competitor is launching next week. Which objective takes priority?",
    "options": [
      {
        "id": "a",
        "label": "Fix technical debt, because code quality is paramount."
      },
      {
        "id": "b",
        "label": "Release Feature X, because the 'Cost of Delay' and competitive threat create an immediate, high-value urgency."
      },
      {
        "id": "c",
        "label": "Split the team to do both poorly."
      },
      {
        "id": "d",
        "label": "Ask the Scrum Master to decide."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Prioritization is context-dependent. While technical debt is important, the **market reality** (competitor launch) makes the **Business Value** of Feature X significantly higher in the short term. The Ultimate Objective is business success, which currently depends on speed.",
    "difficulty": "medium",
    "topics": [
      "agile prioritization",
      "business value"
    ]
  },
  {
    "id": "q-people-8-2-009",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The project manager identifies that the stakeholder's stated want is 'A report generated every morning.' By asking 'Why?', the project manager discovers the underlying need is 'To know if the server went down overnight.' This deeper understanding allows the project manager to:",
    "options": [
      {
        "id": "a",
        "label": "Propose a real-time alert dashboard instead of a report, which better meets the ultimate objective."
      },
      {
        "id": "b",
        "label": "Generate the report manually."
      },
      {
        "id": "c",
        "label": "Tell the stakeholder they don't need the report."
      },
      {
        "id": "d",
        "label": "Add the report to the backlog as a low priority."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. Determining the **Ultimate Objective** requires moving from 'positions' (wants) to 'interests' (needs). By finding the root need (server status awareness), the PM can negotiate a solution (dashboard) that is potentially cheaper, faster, or more effective than the original request.",
    "difficulty": "medium",
    "topics": [
      "needs assessment",
      "requirements gathering"
    ]
  },
  {
    "id": "q-people-8-2-010",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is negotiating a 'Time and Materials' (T&M) contract. The buyer's procurement department prefers 'Fixed Price' to control costs. However, the project scope is undefined and likely to change rapidly. How should the project manager assess the priorities here?",
    "options": [
      {
        "id": "a",
        "label": "Prioritize the procurement department's preference for cost certainty and force a Fixed Price contract."
      },
      {
        "id": "b",
        "label": "Prioritize the project's need for flexibility (Ultimate Objective) and advocate for T&M, explaining that Fixed Price would require excessive risk premiums."
      },
      {
        "id": "c",
        "label": "Start the project without a contract."
      },
      {
        "id": "d",
        "label": "Use a Cost Plus Fixed Fee contract to maximize vendor profit."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. The **Ultimate Objective** of the contract type should align with the project reality. If the scope is undefined, flexibility is the priority. A Fixed Price contract in an undefined environment leads to change order chaos. The PM must prioritize project success over procurement's standard preference.",
    "difficulty": "hard",
    "topics": [
      "contract types",
      "project context"
    ]
  },
  {
    "id": "q-people-8-2-011",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "Before entering a negotiation, the project manager lists 'Price', 'Warranty', 'Schedule', and 'IP Rights.' They then rank them 1 to 4. This activity is primarily focused on:",
    "options": [
      {
        "id": "a",
        "label": "Analyzing the bounds."
      },
      {
        "id": "b",
        "label": "Assessing priorities to determine which concessions can be made and which points must be defended."
      },
      {
        "id": "c",
        "label": "Determining the BATNA."
      },
      {
        "id": "d",
        "label": "Identifying the critical path."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. **Ranking** variables is the direct act of assessing priorities. It prepares the PM to know: 'I can give up on Schedule (Rank 4) if I get my way on IP Rights (Rank 1).' This is crucial for strategic concession making.",
    "difficulty": "easy",
    "topics": [
      "ranking",
      "negotiation preparation"
    ]
  },
  {
    "id": "q-people-8-2-012",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "Two stakeholders have conflicting requirements. Stakeholder A wants a complex login system for security. Stakeholder B wants a one-click login for usability. The project manager refers to the Project Charter's 'Strategic Vision' section, which states 'Simplicity and User Acquisition are our top goals.' How does this help?",
    "options": [
      {
        "id": "a",
        "label": "It helps the project manager determine that Stakeholder B's requirement aligns better with the Ultimate Objective."
      },
      {
        "id": "b",
        "label": "It allows the project manager to ignore Stakeholder A permanently."
      },
      {
        "id": "c",
        "label": "It proves the Charter is contradictory."
      },
      {
        "id": "d",
        "label": "It suggests the project manager should implement both features fully."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. The Project Charter defines the **Ultimate Objective** at a strategic level. When tactical priorities conflict (Security vs Usability), the PM refers to the strategic vision to break the tie. 'User Acquisition' favors ease of use (Stakeholder B).",
    "difficulty": "medium",
    "topics": [
      "strategic alignment",
      "conflict resolution"
    ]
  },
  {
    "id": "q-people-8-2-013",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The project manager is negotiating with a potential partner for a joint venture. The partner is focused on 'Revenue Share,' while the project manager is focused on 'Brand Control.' Recognizing that they have different ultimate objectives allows the negotiation to:",
    "options": [
      {
        "id": "a",
        "label": "Fail immediately due to lack of alignment."
      },
      {
        "id": "b",
        "label": "Proceed as a 'Distributive' (Win-Lose) negotiation."
      },
      {
        "id": "c",
        "label": "Proceed as an 'Integrative' (Win-Win) negotiation where both parties can satisfy their primary objective without blocking the other."
      },
      {
        "id": "d",
        "label": "Turn into a hostile takeover."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct. **Integrative Negotiation** thrives when parties have *compatible* but *different* objectives. If I want Brand and you want Revenue, we can structure a deal that gives me control and you money. Assessing these priorities reveals the path to a Win-Win.",
    "difficulty": "hard",
    "topics": [
      "integrative negotiation",
      "win-win"
    ]
  },
  {
    "id": "q-people-8-2-014",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project team is negotiating the 'Definition of Done' (DoD) with the Quality Assurance team. QA wants extensive automated testing. The Developers want manual testing to save initial setup time. The ultimate objective of the release is 'Zero Defects in Production.' Which priority should guide the decision?",
    "options": [
      {
        "id": "a",
        "label": "The Developers' priority for speed."
      },
      {
        "id": "b",
        "label": "The QA team's priority for reliability/automation, as it aligns best with 'Zero Defects'."
      },
      {
        "id": "c",
        "label": "A compromise of no testing."
      },
      {
        "id": "d",
        "label": "The Project Manager's personal preference."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. The **Ultimate Objective** ('Zero Defects') dictates the priority. Automated testing is generally more reliable for preventing regression defects than manual testing. Therefore, the decision should favor the QA approach to align with the agreed-upon goal.",
    "difficulty": "medium",
    "topics": [
      "quality management",
      "alignment"
    ]
  },
  {
    "id": "q-people-8-2-015",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The project manager identifies that the ultimate objective of the negotiation is 'Relationship Building' for future strategic opportunities, not the profitability of this specific transaction. How should this affect the negotiation strategy?",
    "options": [
      {
        "id": "a",
        "label": "The project manager should play hardball to earn respect."
      },
      {
        "id": "b",
        "label": "The project manager should be willing to make concessions on price or scope to foster trust and goodwill."
      },
      {
        "id": "c",
        "label": "The project manager should cancel the project."
      },
      {
        "id": "d",
        "label": "The project manager should focus strictly on the contract fine print."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. If the priority is the **Relationship**, the strategy shifts from 'transactional' to 'relational.' Making concessions is an investment in the future partnership. Prioritizing short-term profit would undermine the Ultimate Objective.",
    "difficulty": "medium",
    "topics": [
      "relationship management",
      "negotiation strategy"
    ]
  },
  {
    "id": "q-people-8-2-016",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager receives a mandate to cut the project budget by 15%. To assess priorities for the cut, they utilize the 'Kano Model.' Which category of features should be the *last* to be cut?",
    "options": [
      {
        "id": "a",
        "label": "Delighters (Exciters)."
      },
      {
        "id": "b",
        "label": "Performance attributes (Linear)."
      },
      {
        "id": "c",
        "label": "Must-be (Threshold/Basic) attributes."
      },
      {
        "id": "d",
        "label": "Indifferent attributes."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct. The **Kano Model** classifies features. **Must-be** attributes are the basic entry criteria; without them, the product is useless (Ultimate Objective fails). Therefore, they are the highest priority and the last to be touched. Delighters and Performance attributes are cut first.",
    "difficulty": "medium",
    "topics": [
      "Kano model",
      "prioritization"
    ]
  },
  {
    "id": "q-people-8-2-017",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A vendor proposes a change to the technical architecture that will make the system 10% faster but 20% harder to maintain. The project manager reviews the 'Non-Functional Requirements' and sees that 'Maintainability' is ranked higher than 'Performance.' What is the correct decision?",
    "options": [
      {
        "id": "a",
        "label": "Accept the change because speed is always good."
      },
      {
        "id": "b",
        "label": "Reject the change because it violates the established priority of Maintainability."
      },
      {
        "id": "c",
        "label": "Ask the team to vote."
      },
      {
        "id": "d",
        "label": "Implement the change and hide the maintenance cost."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Priorities defined in **Non-Functional Requirements** (NFRs) act as decision filters. Since the project has already assessed that **Maintainability > Performance**, a trade-off that sacrifices maintenance for speed is unacceptable.",
    "difficulty": "medium",
    "topics": [
      "non-functional requirements",
      "trade-offs"
    ]
  },
  {
    "id": "q-people-8-2-018",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "During a negotiation, the counterparty says, 'We must have this specific clause.' The project manager asks, 'What risk are you trying to mitigate with that clause?' This question helps the project manager:",
    "options": [
      {
        "id": "a",
        "label": "Identify the counterparty's ultimate objective (interest) behind their position."
      },
      {
        "id": "b",
        "label": "Annoy the counterparty."
      },
      {
        "id": "c",
        "label": "Change the subject."
      },
      {
        "id": "d",
        "label": "Demonstrate legal knowledge."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. In principled negotiation, asking 'Why?' or probing for the risk allows the PM to find the **Ultimate Objective** (Interest) behind the demand (Position). Once the risk is understood, alternative solutions can be proposed.",
    "difficulty": "medium",
    "topics": [
      "principled negotiation",
      "interests vs positions"
    ]
  },
  {
    "id": "q-people-8-2-019",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The project is over budget. The project manager is negotiating with the client to reduce scope. The client insists all features are critical. To determine the true ultimate objectives, the project manager asks the client to:",
    "options": [
      {
        "id": "a",
        "label": "Yell louder."
      },
      {
        "id": "b",
        "label": "Force-rank the features from 1 to N, with no ties allowed."
      },
      {
        "id": "c",
        "label": "Find more money."
      },
      {
        "id": "d",
        "label": "Sue the project team."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. When everything is 'High Priority,' nothing is. **Force-ranking** (1 to N) compels the stakeholder to make hard choices and reveals the true hierarchy of needs (Ultimate Objectives). This allows the PM to cut the bottom of the list.",
    "difficulty": "medium",
    "topics": [
      "force ranking",
      "scope management"
    ]
  },
  {
    "id": "q-people-8-2-020",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is assigned to a regulatory compliance project. The deadline is fixed by law. The scope is fixed by the regulation. The budget is tight. What is the priority assessment for this project?",
    "options": [
      {
        "id": "a",
        "label": "Cost is the flexible variable."
      },
      {
        "id": "b",
        "label": "Time and Scope are the driving constraints; Quality/Risk is the Ultimate Objective (Compliance)."
      },
      {
        "id": "c",
        "label": "Scope can be reduced to meet the budget."
      },
      {
        "id": "d",
        "label": "The deadline can be moved."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. In regulatory projects, **Compliance** is the Ultimate Objective. You cannot change the law (Scope) or the deadline (Time). Therefore, these are fixed constraints. The priority is meeting the regulation on time. If budget is tight, it puts the project at high risk, but the priority structure is clear.",
    "difficulty": "hard",
    "topics": [
      "compliance",
      "triple constraint"
    ]
  },
  {
    "id": "q-people-8-2-021",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The team is negotiating working agreements. Some members want 'core hours' for collaboration. Others want 'flexible hours' for work-life balance. To assess the priority, the project manager refers to the Agile principle of 'sustainable pace.' How does this guide the objective?",
    "options": [
      {
        "id": "a",
        "label": "It mandates 9-to-5 workdays."
      },
      {
        "id": "b",
        "label": "It prioritizes finding a balance that prevents burnout while ensuring enough overlap for necessary communication."
      },
      {
        "id": "c",
        "label": "It prioritizes maximum output at all costs."
      },
      {
        "id": "d",
        "label": "It suggests the team should work weekends."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. The **Ultimate Objective** of 'sustainable pace' is long-term productivity and health. This priority guides the team to find a middle ground (e.g., 4 hours of overlap, remainder flexible) rather than maximizing one side's preference at the expense of the other.",
    "difficulty": "medium",
    "topics": [
      "team agreements",
      "sustainable pace"
    ]
  },
  {
    "id": "q-people-8-2-022",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is negotiating resource allocation with a functional manager. The project manager needs a database expert. The functional manager offers a generalist. The project manager explains that the 'Ultimate Objective' is to optimize a complex query that is currently crashing the system. This clarification helps because:",
    "options": [
      {
        "id": "a",
        "label": "It justifies why the specific skill set (expert) is a 'Must Have' priority, not just a preference."
      },
      {
        "id": "b",
        "label": "It shows the project manager is technical."
      },
      {
        "id": "c",
        "label": "It allows the functional manager to charge more."
      },
      {
        "id": "d",
        "label": "It confuses the functional manager."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. Clearly articulating the **Ultimate Objective** (solving a complex crash) links the resource request to a business outcome. It transforms the request from 'I want an expert' (subjective) to 'The project will fail without this specific skill' (objective priority).",
    "difficulty": "medium",
    "topics": [
      "resource negotiation",
      "business case"
    ]
  },
  {
    "id": "q-people-8-2-023",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "In a project to build a Minimum Viable Product (MVP), the Product Owner keeps adding features. The project manager reminds them that the priority of an MVP is 'Learning' and 'Speed', not 'Completeness.' This is an example of:",
    "options": [
      {
        "id": "a",
        "label": "Re-aligning the stakeholder with the Ultimate Objective to prevent scope creep."
      },
      {
        "id": "b",
        "label": "Being lazy."
      },
      {
        "id": "c",
        "label": "Ignoring customer needs."
      },
      {
        "id": "d",
        "label": "Violating the agile manifesto."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. An MVP has a specific **Ultimate Objective**: to test a hypothesis with the least effort. Features that don't contribute to 'Learning' are lower priority. The PM is acting correctly by assessing the requests against the strategic goal.",
    "difficulty": "medium",
    "topics": [
      "MVP",
      "scope management"
    ]
  },
  {
    "id": "q-people-8-2-024",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "A project manager is analyzing a contract draft. They notice a penalty clause for late delivery but no bonus clause for early delivery. The project manager assesses that 'Incentivizing Speed' is a key objective. What should they negotiate?",
    "options": [
      {
        "id": "a",
        "label": "Remove the penalty clause."
      },
      {
        "id": "b",
        "label": "Add an incentive/bonus clause for early delivery to align the contract structure with the priority of Speed."
      },
      {
        "id": "c",
        "label": "Accept the contract as is."
      },
      {
        "id": "d",
        "label": "Change the delivery date."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Contracts drive behavior. If the **Ultimate Objective** is Speed, the contract terms should reflect that priority. Adding a bonus aligns the vendor's motivation with the project's goal.",
    "difficulty": "medium",
    "topics": [
      "contract incentives",
      "alignment"
    ]
  },
  {
    "id": "q-people-8-2-025",
    "domainId": "people",
    "taskId": "people-8",
    "enablerIds": [
      "e-people-8-2"
    ],
    "text": "The project manager and vendor are deadlocked on price. The project manager steps back and asks, 'What are we really trying to achieve here?' This technique is known as:",
    "options": [
      {
        "id": "a",
        "label": "Reframing to focus on the Ultimate Objective."
      },
      {
        "id": "b",
        "label": "Surrendering."
      },
      {
        "id": "c",
        "label": "BATNA analysis."
      },
      {
        "id": "d",
        "label": "Good Cop / Bad Cop."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. **Reframing** moves the conversation away from the deadlock (Price) and back to the big picture (**Ultimate Objective**). It reminds both parties of the value of the deal, often unlocking creativity to solve the price issue (e.g., changing scope or terms).",
    "difficulty": "medium",
    "topics": [
      "negotiation techniques",
      "reframing"
    ]
  }
]
