[
  {
    "id": "q-process-4-4-001",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager has analyzed stakeholders, categorized them, and developed engagement approaches. What is the next critical step in developing, executing, and validating a stakeholder engagement strategy?",
    "options": [
      {
        "id": "a",
        "label": "Begin executing the engagement strategy without further planning."
      },
      {
        "id": "b",
        "label": "Create a detailed stakeholder engagement plan documenting the strategy."
      },
      {
        "id": "c",
        "label": "Focus on the most challenging stakeholders first in the engagement plan."
      },
      {
        "id": "d",
        "label": "Implement the engagement plan using only formal communication methods."
      }
    ],
    "correctOptionId": "b",
    "explanation": "After analyzing stakeholders and developing engagement approaches, the next critical step is to create a detailed stakeholder engagement plan that documents the strategy. This plan serves as a guide for execution and validation of stakeholder engagement activities.",
    "difficulty": "easy",
    "topics": [
      "stakeholder engagement plan",
      "strategy documentation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-002",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with diverse stakeholder groups. What key element should be included in the strategy to address this diversity?",
    "options": [
      {
        "id": "a",
        "label": "A single engagement approach that works for all stakeholder groups."
      },
      {
        "id": "b",
        "label": "Different engagement methods tailored to each stakeholder category."
      },
      {
        "id": "c",
        "label": "Focus on engaging only the largest stakeholder group to maximize impact."
      },
      {
        "id": "d",
        "label": "Use only digital communication tools to reach all stakeholder groups effectively."
      }
    ],
    "correctOptionId": "a",
    "explanation": "A stakeholder engagement strategy should include different engagement methods tailored to each stakeholder category rather than a single approach for all groups. The correct answer is option B, not A. Option A suggests a uniform approach despite acknowledged diversity.",
    "difficulty": "easy",
    "topics": [
      "stakeholder diversity",
      "tailored engagement"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-003",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy for a project with strict regulatory compliance requirements. How should compliance considerations be integrated into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Apply standard engagement methods regardless of regulatory requirements."
      },
      {
        "id": "b",
        "label": "Incorporate compliance reporting and formal communication requirements."
      },
      {
        "id": "c",
        "label": "Focus engagement primarily on non-regulatory stakeholders to avoid issues."
      },
      {
        "id": "d",
        "label": "Minimize documentation in the engagement strategy to reduce compliance burden."
      }
    ],
    "correctOptionId": "a",
    "explanation": "For projects with regulatory requirements, compliance reporting and formal communication requirements should be incorporated into the engagement strategy. The correct answer is option B, not A. Option A suggests ignoring regulatory requirements in the engagement strategy.",
    "difficulty": "medium",
    "topics": [
      "regulatory compliance",
      "compliance integration"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-4-4-004",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with multiple departments involved. How should departmental differences be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Use identical engagement approaches for all departments to ensure consistency."
      },
      {
        "id": "b",
        "label": "Account for departmental objectives, culture, and communication preferences."
      },
      {
        "id": "c",
        "label": "Focus the strategy primarily on the department that initiated the project."
      },
      {
        "id": "d",
        "label": "Apply the engagement approach of the most senior department to all others."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should account for departmental objectives, culture, and communication preferences. The correct answer is option B, not A. Option A suggests using identical approaches despite different departmental needs.",
    "difficulty": "medium",
    "topics": [
      "departmental differences",
      "cross-departmental strategy"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-005",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy that includes external vendors. How should vendor relationships be incorporated into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Treat vendors with the same engagement approach as internal stakeholders."
      },
      {
        "id": "b",
        "label": "Consider contractual obligations, dependencies, and partnership dynamics."
      },
      {
        "id": "c",
        "label": "Focus engagement on vendors only during procurement activities."
      },
      {
        "id": "d",
        "label": "Use only formal written communication with vendor stakeholders."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider contractual obligations, dependencies, and partnership dynamics when addressing vendors. The correct answer is option B, not A. Option A suggests treating vendors the same as internal stakeholders despite different relationship dynamics.",
    "difficulty": "medium",
    "topics": [
      "vendor relationships",
      "external stakeholder strategy"
    ],
    "process": "control-procurements",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-4-4-006",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with high public visibility. How should public stakeholders be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Public stakeholders should not be included in the internal engagement strategy."
      },
      {
        "id": "b",
        "label": "Include provisions for transparent communication and public messaging."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on internal stakeholders to manage public attention."
      },
      {
        "id": "d",
        "label": "Minimize public communication to avoid potential issues or criticism."
      }
    ],
    "correctOptionId": "a",
    "explanation": "For projects with high visibility, the engagement strategy should include provisions for transparent communication and public messaging. The correct answer is option B, not A. Option A suggests excluding public stakeholders from the strategy despite their importance in high-visibility projects.",
    "difficulty": "medium",
    "topics": [
      "public visibility",
      "public stakeholder strategy"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-007",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy in a project with rapidly changing requirements. How should the strategy accommodate these changes?",
    "options": [
      {
        "id": "a",
        "label": "Maintain the original strategy to provide consistency for stakeholders."
      },
      {
        "id": "b",
        "label": "Include processes for monitoring and updating the strategy as conditions change."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on stakeholders who influence requirements changes."
      },
      {
        "id": "d",
        "label": "Suspend stakeholder engagement until requirements stabilize."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should include processes for monitoring and updating as conditions change. The correct answer is option B, not A. Option A suggests maintaining a static strategy despite changing project conditions.",
    "difficulty": "hard",
    "topics": [
      "changing requirements",
      "adaptive strategy"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-008",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with limited budget for stakeholder management activities. How should budget constraints be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Apply the same level of engagement to all stakeholders regardless of budget."
      },
      {
        "id": "b",
        "label": "Prioritize engagement activities based on stakeholder impact and available budget."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on stakeholders who can provide additional funding."
      },
      {
        "id": "d",
        "label": "Minimize all stakeholder engagement activities to conserve budget."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should prioritize activities based on stakeholder impact and available budget. The correct answer is option B, not A. Option A suggests ignoring budget constraints in the engagement strategy.",
    "difficulty": "medium",
    "topics": [
      "budget constraints",
      "prioritized engagement"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-009",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is validating a stakeholder engagement strategy across multiple project phases. How should the validation process be structured?",
    "options": [
      {
        "id": "a",
        "label": "Validate the strategy only at the beginning and end of the project."
      },
      {
        "id": "b",
        "label": "Continuously monitor and validate the strategy throughout each project phase."
      },
      {
        "id": "c",
        "label": "Focus validation only on stakeholders relevant to the current project phase."
      },
      {
        "id": "d",
        "label": "Complete all strategy validation during the project planning phase."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should be continuously monitored and validated throughout each project phase. The correct answer is option B, not A. Option A suggests limited validation timing despite the need for ongoing assessment.",
    "difficulty": "medium",
    "topics": [
      "strategy validation",
      "continuous monitoring"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-010",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a culturally diverse group of stakeholders. How should cultural differences be incorporated into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Use the same engagement approach for all stakeholders regardless of culture."
      },
      {
        "id": "b",
        "label": "Adapt engagement methods to respect and accommodate cultural differences."
      },
      {
        "id": "c",
        "label": "Focus the strategy primarily on stakeholders from the project manager's own culture."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder engagement to avoid potential cultural misunderstandings."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should adapt methods to respect and accommodate cultural differences. The correct answer is option B, not A. Option A suggests ignoring cultural differences in favor of a uniform approach.",
    "difficulty": "hard",
    "topics": [
      "cultural differences",
      "cross-cultural strategy"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-011",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy in a project with tight schedule constraints. How should time constraints be factored into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Use efficient engagement methods that match stakeholder importance and time availability."
      },
      {
        "id": "b",
        "label": "Increase stakeholder engagement frequency to ensure buy-in within the timeline."
      },
      {
        "id": "c",
        "label": "Postpone stakeholder engagement activities until after critical schedule dates."
      },
      {
        "id": "d",
        "label": "Focus the strategy only on stakeholders who directly impact the project schedule."
      }
    ],
    "correctOptionId": "c",
    "explanation": "The stakeholder engagement strategy should use efficient methods that match stakeholder importance and time availability. The correct answer is option A, not C. Option C suggests postponing engagement when it should be integrated into the schedule.",
    "difficulty": "medium",
    "topics": [
      "time constraints",
      "efficient engagement"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-012",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with high security requirements. How should security considerations be incorporated into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Security requirements should not impact the stakeholder engagement strategy."
      },
      {
        "id": "b",
        "label": "Consider security clearances and information access requirements in the strategy."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on stakeholders with the highest security clearances."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder engagement to reduce security risks and complications."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider security clearances and information access requirements. The correct answer is option B, not A. Option A suggests that security requirements don't impact the engagement strategy.",
    "difficulty": "hard",
    "topics": [
      "security requirements",
      "secure engagement strategy"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-4-4-013",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy with multiple external partner organizations. How should partnership dynamics be reflected in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Treat all external partners with identical engagement approaches for fairness."
      },
      {
        "id": "b",
        "label": "Consider partnership agreements, dependencies, and relationship dynamics."
      },
      {
        "id": "c",
        "label": "Focus the strategy primarily on the main partnering organization."
      },
      {
        "id": "d",
        "label": "Use only formal communication methods with all external partner stakeholders."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider partnership agreements, dependencies, and relationship dynamics. The correct answer is option B, not A. Option A suggests using identical approaches despite different partnership dynamics.",
    "difficulty": "medium",
    "topics": [
      "external partnerships",
      "partnership dynamics"
    ],
    "process": "control-procurements",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-4-4-014",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy where stakeholders have different communication preferences and technological capabilities. How should these differences be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Use standardized communication methods for all stakeholders for consistency."
      },
      {
        "id": "b",
        "label": "Adapt communication methods to match stakeholder preferences and capabilities."
      },
      {
        "id": "c",
        "label": "Focus the strategy using only the most advanced communication technologies."
      },
      {
        "id": "d",
        "label": "Use only face-to-face meetings to ensure effective communication with all stakeholders."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should adapt communication methods to match stakeholder preferences and capabilities. The correct answer is option B, not A. Option A suggests using standardized methods despite different preferences and capabilities.",
    "difficulty": "medium",
    "topics": [
      "communication preferences",
      "technology adaptation"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-4-4-015",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is validating a stakeholder engagement strategy that has been in place for some time. What key metric should they focus on to assess effectiveness?",
    "options": [
      {
        "id": "a",
        "label": "The number of stakeholder meetings held regardless of outcomes."
      },
      {
        "id": "b",
        "label": "Stakeholder satisfaction and level of engagement in project decisions."
      },
      {
        "id": "c",
        "label": "The cost of stakeholder engagement activities compared to budget."
      },
      {
        "id": "d",
        "label": "The frequency of stakeholder communications without measuring impact."
      }
    ],
    "correctOptionId": "a",
    "explanation": "To validate the effectiveness of a stakeholder engagement strategy, the focus should be on stakeholder satisfaction and level of engagement in project decisions. The correct answer is option B, not A. Option A focuses on quantity of meetings rather than effectiveness of engagement.",
    "difficulty": "medium",
    "topics": [
      "strategy validation",
      "effectiveness metrics"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-016",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy in a project with a history of stakeholder conflicts. How should past conflict history be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Ignore past conflicts and implement the strategy as if starting fresh."
      },
      {
        "id": "b",
        "label": "Consider past relationships and potential conflict patterns in implementation."
      },
      {
        "id": "c",
        "label": "Focus the strategy primarily on stakeholders not involved in past conflicts."
      },
      {
        "id": "d",
        "label": "Avoid engaging stakeholders who were previously in conflict situations."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider past relationships and potential conflict patterns in implementation. The correct answer is option B, not A. Option A suggests ignoring past conflicts when they could inform a more effective strategy.",
    "difficulty": "hard",
    "topics": [
      "past conflicts",
      "conflict-aware strategy"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-017",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project that will significantly impact business operations. How should change impact considerations be incorporated into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Focus the strategy only on stakeholders who are supportive of the changes."
      },
      {
        "id": "b",
        "label": "Consider each stakeholder's relationship to change and adapt engagement accordingly."
      },
      {
        "id": "c",
        "label": "Use the same positive messaging about changes for all stakeholders in the strategy."
      },
      {
        "id": "d",
        "label": "Minimize engagement with stakeholders who might resist the upcoming changes."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider each stakeholder's relationship to change and adapt engagement accordingly. The correct answer is option B, not A. Option A suggests focusing only on supportive stakeholders when all stakeholders need appropriate engagement.",
    "difficulty": "medium",
    "topics": [
      "organizational change",
      "change-aware strategy"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-018",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy across multiple organizational levels. How should organizational hierarchy be factored into the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Apply the same engagement approach to all organizational levels consistently."
      },
      {
        "id": "b",
        "label": "Tailor engagement to information needs and decision-making authority of each level."
      },
      {
        "id": "c",
        "label": "Focus the strategy primarily on senior management due to their decision authority."
      },
      {
        "id": "d",
        "label": "Use formal engagement methods only for top organizational levels."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should tailor engagement to the information needs and decision-making authority of each organizational level. The correct answer is option B, not A. Option A suggests a uniform approach across all organizational levels.",
    "difficulty": "medium",
    "topics": [
      "organizational hierarchy",
      "level-specific strategy"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-019",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with significant technical complexity. How should different technical expertise levels be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Provide the same level of technical detail to all stakeholders regardless of expertise."
      },
      {
        "id": "b",
        "label": "Adapt the level of technical detail to match stakeholder expertise and interest."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on stakeholders with high technical expertise."
      },
      {
        "id": "d",
        "label": "Minimize technical details in all stakeholder communications to avoid confusion."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should adapt the level of technical detail to match stakeholder expertise and interest. The correct answer is option B, not A. Option A suggests providing identical technical detail to all stakeholders regardless of their expertise.",
    "difficulty": "medium",
    "topics": [
      "technical complexity",
      "expertise-aware strategy"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-020",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is validating stakeholder engagement strategy effectiveness in a project with environmental impact considerations. How should environmental concerns be factored into validation?",
    "options": [
      {
        "id": "a",
        "label": "Environmental considerations should not affect strategy validation methods."
      },
      {
        "id": "b",
        "label": "Include assessment of environmental stakeholder satisfaction and compliance."
      },
      {
        "id": "c",
        "label": "Focus validation only on stakeholders with environmental expertise and interest."
      },
      {
        "id": "d",
        "label": "Minimize environmental impact discussions during strategy validation."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Environmental concerns should be included in strategy validation, particularly assessing environmental stakeholder satisfaction and compliance. The correct answer is option B, not A. Option A suggests environmental considerations don't affect validation when they should be included.",
    "difficulty": "medium",
    "topics": [
      "environmental impact",
      "validation metrics"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-021",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with limited team experience in stakeholder management. How should this capability constraint be addressed in the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Use simpler engagement methods appropriate to the team's experience level."
      },
      {
        "id": "b",
        "label": "Engage external experts to handle all stakeholder engagement activities."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on stakeholders familiar to the team's experience."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder engagement to accommodate the team's inexperience."
      }
    ],
    "correctOptionId": "d",
    "explanation": "The stakeholder engagement strategy should use methods appropriate to the team's experience level rather than minimizing engagement. The correct answer is option A, not D. Option D suggests reducing engagement due to team limitations.",
    "difficulty": "medium",
    "topics": [
      "team experience",
      "capability-aware strategy"
    ],
    "process": "develop-team",
    "knowledgeAreaId": "resource"
  },
  {
    "id": "q-process-4-4-022",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy for a project with global team members across different regions and time zones. How should geographic distribution influence the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Use the same engagement approach for all stakeholders regardless of location."
      },
      {
        "id": "b",
        "label": "Consider time zones and regional preferences in engagement planning and execution."
      },
      {
        "id": "c",
        "label": "Focus the strategy primarily on stakeholders in the project manager's region."
      },
      {
        "id": "d",
        "label": "Use only written communication to accommodate all time zones effectively."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider time zones and regional preferences in planning and execution. The correct answer is option B, not A. Option A suggests ignoring geographic differences in favor of a uniform approach.",
    "difficulty": "hard",
    "topics": [
      "global stakeholders",
      "geographic strategy"
    ],
    "process": "plan-communications-management",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-4-4-023",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is developing a stakeholder engagement strategy for a project with multiple competing objectives. How should objective alignment influence the strategy?",
    "options": [
      {
        "id": "a",
        "label": "Engage all stakeholders with the same emphasis on the primary project objective."
      },
      {
        "id": "b",
        "label": "Consider stakeholder alignment with different objectives in strategy development."
      },
      {
        "id": "c",
        "label": "Focus the strategy only on stakeholders aligned with the most important objective."
      },
      {
        "id": "d",
        "label": "Avoid discussing competing objectives in the stakeholder engagement strategy."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should consider stakeholder alignment with different objectives in its development. The correct answer is option B, not A. Option A suggests engaging all stakeholders with the same emphasis despite different alignments.",
    "difficulty": "hard",
    "topics": [
      "competing objectives",
      "alignment-aware strategy"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-4-4-024",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is executing a stakeholder engagement strategy with limited access to stakeholder information. How should this constraint influence the strategy execution?",
    "options": [
      {
        "id": "a",
        "label": "Delay strategy execution until complete stakeholder information is available."
      },
      {
        "id": "b",
        "label": "Begin with general approaches and adapt as more information becomes available."
      },
      {
        "id": "c",
        "label": "Focus execution only on stakeholders with the most accessible information."
      },
      {
        "id": "d",
        "label": "Make assumptions about stakeholder preferences to proceed with execution."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The stakeholder engagement strategy should begin with general approaches and adapt as more information becomes available. The correct answer is option B, not A. Option A suggests delaying strategy execution until complete information is available.",
    "difficulty": "medium",
    "topics": [
      "limited information",
      "adaptive execution"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-4-025",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-4"
    ],
    "text": "A project manager is validating a stakeholder engagement strategy for a project with multiple parallel work streams. How should the project structure influence the validation approach?",
    "options": [
      {
        "id": "a",
        "label": "Apply the same validation approach to all stakeholders regardless of work stream."
      },
      {
        "id": "b",
        "label": "Align validation methods with stakeholders' relationships to specific work streams."
      },
      {
        "id": "c",
        "label": "Focus validation only on stakeholders of the most critical work stream."
      },
      {
        "id": "d",
        "label": "Conduct separate validation for each parallel work stream independently."
      }
    ],
    "correctOptionId": "a",
    "explanation": "The validation of stakeholder engagement strategy should align methods with stakeholders' relationships to specific work streams. The correct answer is option B, not A. Option A suggests using the same validation approach despite different work stream relationships.",
    "difficulty": "hard",
    "topics": [
      "parallel work streams",
      "validation alignment"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]