[
  {
    "id": "q-process-4-1-001",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is beginning a new project and needs to analyze stakeholders. What should be their first step in this analysis?",
    "options": [
      {
        "id": "a",
        "label": "Create a communication plan for all identified stakeholders."
      },
      {
        "id": "b",
        "label": "Identify all potential stakeholders and their characteristics."
      },
      {
        "id": "c",
        "label": "Develop engagement strategies for each stakeholder."
      },
      {
        "id": "d",
        "label": "Assign stakeholder roles and responsibilities."
      }
    ],
    "correctOptionId": "b",
    "explanation": "The first step in stakeholder analysis is to identify all potential stakeholders and understand their characteristics, including their interests, influence, and potential impact on the project. Only after identification can the project manager analyze their power, interest, and other factors.",
    "difficulty": "easy",
    "topics": [
      "stakeholder identification",
      "stakeholder analysis"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-002",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders using a power/interest grid. Where should they focus most of their attention?",
    "options": [
      {
        "id": "a",
        "label": "Stakeholders with low power and low interest in the project."
      },
      {
        "id": "b",
        "label": "Stakeholders with high power and high interest in the project."
      },
      {
        "id": "c",
        "label": "Stakeholders with high power but low interest in the project."
      },
      {
        "id": "d",
        "label": "Stakeholders with low power but high interest in the project."
      }
    ],
    "correctOptionId": "a",
    "explanation": "According to stakeholder analysis principles, stakeholders with high power and high interest in the project should receive the most attention and should be managed closely. The correct answer is option B, not A. Option A suggests focusing on stakeholders with low power and low interest, which is incorrect.",
    "difficulty": "easy",
    "topics": [
      "power/interest grid",
      "stakeholder management"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-003",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager has identified a stakeholder who has high influence over the project but is currently unaware of the project. How should this be addressed in the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Ignore this stakeholder since they are unaware of the project."
      },
      {
        "id": "b",
        "label": "Prioritize this stakeholder for awareness-building activities."
      },
      {
        "id": "c",
        "label": "Reassess the stakeholder's level of influence based on awareness."
      },
      {
        "id": "d",
        "label": "Wait for the stakeholder to become aware before engaging them."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Ignoring a stakeholder with high influence just because they're unaware of the project is not appropriate. The correct approach is to prioritize this stakeholder for awareness-building activities. Option A suggests ignoring an influential stakeholder.",
    "difficulty": "medium",
    "topics": [
      "stakeholder influence",
      "awareness building"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-004",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with strict regulatory compliance requirements. Which stakeholder characteristic should receive special attention?",
    "options": [
      {
        "id": "a",
        "label": "The stakeholder's technical expertise in the project domain."
      },
      {
        "id": "b",
        "label": "The stakeholder's authority and ability to impact compliance."
      },
      {
        "id": "c",
        "label": "The stakeholder's availability for project meetings."
      },
      {
        "id": "d",
        "label": "The stakeholder's preference for communication methods."
      }
    ],
    "correctOptionId": "c",
    "explanation": "For a project with strict regulatory compliance requirements, analyzing stakeholder characteristics related to their authority and ability to impact compliance is most important. The correct answer is B, not C. Option C suggests that the stakeholder's availability for meetings is the key factor, which is incorrect.",
    "difficulty": "medium",
    "topics": [
      "regulatory compliance",
      "stakeholder authority"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-005",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project with multiple departments involved. How should they assess stakeholder influence when different departments have competing priorities?",
    "options": [
      {
        "id": "a",
        "label": "Assess influence based only on the stakeholder's formal organizational position."
      },
      {
        "id": "b",
        "label": "Consider both formal authority and informal influence within the organization."
      },
      {
        "id": "c",
        "label": "Focus on the department heads since they have ultimate authority over their teams."
      },
      {
        "id": "d",
        "label": "Rank stakeholders based on their technical knowledge of the project."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Focusing only on department heads ignores the potential influence of other stakeholders within the departments who might be key to project success. The correct approach is considering both formal authority and informal influence within the organization. Option C limits analysis to only department heads.",
    "difficulty": "medium",
    "topics": [
      "organizational influence",
      "departmental dynamics"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-006",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project that involves external vendors. What unique considerations should be included in the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Vendor stakeholders should be analyzed using the same criteria as internal stakeholders."
      },
      {
        "id": "b",
        "label": "Consider vendor contractual power and dependency relationships with the project."
      },
      {
        "id": "c",
        "label": "Exclude vendors from the stakeholder analysis since they are external to the organization."
      },
      {
        "id": "d",
        "label": "Focus solely on vendor cost impact without considering other factors."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Excluding vendors from the stakeholder analysis would ignore important external stakeholders who can significantly impact the project. The correct approach is considering vendor contractual power and dependency relationships with the project. Option C suggests excluding external vendors from stakeholder analysis.",
    "difficulty": "hard",
    "topics": [
      "external stakeholders",
      "vendor analysis"
    ],
    "process": "plan-procurement-management",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-4-1-007",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project with high public visibility. How should public perception influence the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Public perception should not be considered in stakeholder analysis."
      },
      {
        "id": "b",
        "label": "Consider public opinion as an indirect stakeholder influence factor."
      },
      {
        "id": "c",
        "label": "Focus only on internal stakeholders since public opinion is difficult to measure."
      },
      {
        "id": "d",
        "label": "Ignore public stakeholders since they have no direct authority over the project."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Public perception can significantly impact projects with high visibility, so it should be considered in stakeholder analysis. The correct approach is considering public opinion as an indirect stakeholder influence factor. Option A suggests ignoring public perception altogether.",
    "difficulty": "medium",
    "topics": [
      "public perception",
      "visibility impact"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-008",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project with rapidly changing requirements. How should this affect their stakeholder analysis approach?",
    "options": [
      {
        "id": "a",
        "label": "Complete the stakeholder analysis once and use it for the entire project."
      },
      {
        "id": "b",
        "label": "Regularly reassess stakeholder positions and interests as requirements change."
      },
      {
        "id": "c",
        "label": "Focus only on stakeholders who influence requirements definition."
      },
      {
        "id": "d",
        "label": "Delay stakeholder analysis until requirements stabilize."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Completing stakeholder analysis once and using it for the entire project is not appropriate when requirements are rapidly changing, as stakeholder positions and interests may also change. The correct approach is regularly reassessing stakeholder positions and interests as requirements change. Option A suggests a static approach to stakeholder analysis in a dynamic environment.",
    "difficulty": "hard",
    "topics": [
      "changing requirements",
      "dynamic analysis"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-009",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with limited budget for stakeholder management activities. How should this constraint influence their analysis?",
    "options": [
      {
        "id": "a",
        "label": "Focus the analysis on stakeholders who can provide additional funding."
      },
      {
        "id": "b",
        "label": "Identify stakeholders based on their potential impact on the project."
      },
      {
        "id": "c",
        "label": "Skip stakeholder analysis to save resources for other activities."
      },
      {
        "id": "d",
        "label": "Focus analysis only on stakeholders with budget authority."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Skipping stakeholder analysis to save resources would be counterproductive since stakeholder management is essential for project success. The correct approach is identifying stakeholders based on their potential impact on the project. Option C suggests eliminating the stakeholder analysis entirely.",
    "difficulty": "medium",
    "topics": [
      "budget constraints",
      "impact analysis"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-010",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project that has experienced negative publicity. How should this affect their analysis of stakeholder attitudes?",
    "options": [
      {
        "id": "a",
        "label": "Assume all stakeholders have negative attitudes due to the publicity."
      },
      {
        "id": "b",
        "label": "Assess stakeholder attitudes individually regardless of publicity impact."
      },
      {
        "id": "c",
        "label": "Focus only on stakeholders who were not affected by the negative publicity."
      },
      {
        "id": "d",
        "label": "Ignore stakeholder attitudes and focus on technical aspects of the project."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Assuming all stakeholders have negative attitudes due to publicity is not appropriate as individual stakeholder attitudes may vary. The correct approach is assessing stakeholder attitudes individually regardless of publicity impact. Option A makes a generalization about all stakeholders.",
    "difficulty": "medium",
    "topics": [
      "negative publicity",
      "stakeholder attitudes"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-011",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is working with a culturally diverse group of stakeholders. How should cultural differences influence their stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Use the same analysis approach for all stakeholders regardless of culture."
      },
      {
        "id": "b",
        "label": "Consider cultural factors that influence stakeholder communication and expectations."
      },
      {
        "id": "c",
        "label": "Focus analysis only on stakeholders from the project manager's own culture."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder analysis to avoid cultural misunderstandings."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Using the same analysis approach for all stakeholders regardless of culture doesn't account for different cultural factors that can influence stakeholder behavior and expectations. The correct approach is considering cultural factors that influence stakeholder communication and expectations. Option A ignores cultural differences that can significantly impact stakeholder engagement.",
    "difficulty": "hard",
    "topics": [
      "cultural diversity",
      "cross-cultural analysis"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-012",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with multiple phases. How should they approach stakeholder analysis across the project lifecycle?",
    "options": [
      {
        "id": "a",
        "label": "Complete one comprehensive stakeholder analysis at the beginning of the project."
      },
      {
        "id": "b",
        "label": "Analyze stakeholder importance and influence specific to each project phase."
      },
      {
        "id": "c",
        "label": "Focus only on stakeholders relevant to the current project phase."
      },
      {
        "id": "d",
        "label": "Apply the same stakeholder analysis to all project phases."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Completing one comprehensive stakeholder analysis at the beginning of the project doesn't account for changing stakeholder needs and influence across different phases. The correct approach is analyzing stakeholder importance and influence specific to each project phase. Option A suggests a static approach across a dynamic project lifecycle.",
    "difficulty": "medium",
    "topics": [
      "project phases",
      "lifecycle analysis"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-4-1-013",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project that requires high security clearance. How should security requirements influence the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Security requirements should not impact stakeholder analysis."
      },
      {
        "id": "b",
        "label": "Consider security clearances when assessing stakeholder access and influence."
      },
      {
        "id": "c",
        "label": "Focus analysis only on stakeholders with the highest security clearances."
      },
      {
        "id": "d",
        "label": "Exclude stakeholders without security clearance from the analysis."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Excluding stakeholders without security clearance from the analysis would ignore stakeholders who might still have influence or interest in the project. The correct approach is considering security clearances when assessing stakeholder access and influence. Option D suggests excluding stakeholders based solely on security clearance status.",
    "difficulty": "hard",
    "topics": [
      "security requirements",
      "access analysis"
    ],
    "process": "manage-communications",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-4-1-014",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with multiple external partners. How should partner relationships influence the analysis?",
    "options": [
      {
        "id": "a",
        "label": "Analyze all external partners with the same level of detail as internal stakeholders."
      },
      {
        "id": "b",
        "label": "Consider partnership agreements and mutual dependencies in the analysis."
      },
      {
        "id": "c",
        "label": "Focus only on the primary partner relationship and ignore others."
      },
      {
        "id": "d",
        "label": "Minimize analysis of external partners due to limited control over them."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Minimizing analysis of external partners due to limited control would be a mistake, as these partners can significantly impact the project. The correct approach is considering partnership agreements and mutual dependencies in the analysis. Option D suggests reducing analysis of important external stakeholders.",
    "difficulty": "medium",
    "topics": [
      "external partnerships",
      "mutual dependencies"
    ],
    "process": "control-procurements",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-4-1-015",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with tight schedule constraints. How should time constraints influence their stakeholder analysis approach?",
    "options": [
      {
        "id": "a",
        "label": "Allocate all available time to stakeholder analysis, even if it delays other activities."
      },
      {
        "id": "b",
        "label": "Use efficient analysis techniques focusing on stakeholders with greatest impact."
      },
      {
        "id": "c",
        "label": "Postpone stakeholder analysis until after schedule-critical activities are complete."
      },
      {
        "id": "d",
        "label": "Complete only basic stakeholder identification without detailed analysis."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Postponing stakeholder analysis would be inappropriate since understanding stakeholders is critical early in the project. The correct approach is using efficient analysis techniques focusing on stakeholders with greatest impact. Option C suggests delaying stakeholder analysis, which is not recommended.",
    "difficulty": "medium",
    "topics": [
      "time constraints",
      "efficient analysis"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-016",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project with a history of stakeholder conflicts. How should this history influence their current analysis?",
    "options": [
      {
        "id": "a",
        "label": "Ignore past conflicts and analyze stakeholders without historical bias."
      },
      {
        "id": "b",
        "label": "Consider past relationships and potential conflict patterns in the analysis."
      },
      {
        "id": "c",
        "label": "Focus the analysis only on stakeholders who were not involved in past conflicts."
      },
      {
        "id": "d",
        "label": "Avoid analyzing stakeholder relationships to prevent uncovering potential conflicts."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Ignoring past conflicts when analyzing stakeholders could lead to repeating previous issues. The correct approach is considering past relationships and potential conflict patterns in the analysis. Option A suggests ignoring valuable historical information that could inform stakeholder management.",
    "difficulty": "hard",
    "topics": [
      "past conflicts",
      "relationship analysis"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-017",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project that will significantly change business operations. How should change impact influence the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Focus analysis only on stakeholders who will be directly affected by the change."
      },
      {
        "id": "b",
        "label": "Consider both direct and indirect impacts of the change on stakeholders."
      },
      {
        "id": "c",
        "label": "Minimize analysis of stakeholders who resist change to avoid conflict."
      },
      {
        "id": "d",
        "label": "Analyze only the positive impacts of the change on stakeholders."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Minimizing analysis of stakeholders who resist change would ignore important stakeholder groups that could impact the project. The correct approach is considering both direct and indirect impacts of the change on stakeholders. Option C suggests avoiding analysis of resistant stakeholders.",
    "difficulty": "medium",
    "topics": [
      "change impact",
      "stakeholder effects"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-018",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project with multiple organizational levels. How should organizational hierarchy influence the analysis?",
    "options": [
      {
        "id": "a",
        "label": "Focus primarily on stakeholders at the highest organizational level."
      },
      {
        "id": "b",
        "label": "Consider influence and interest at all relevant organizational levels."
      },
      {
        "id": "c",
        "label": "Analyze only senior management since they have decision-making authority."
      },
      {
        "id": "d",
        "label": "Give equal weight to all organizational levels in the analysis."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Analyzing only senior management would ignore stakeholders at other organizational levels who might be critical to project success. The correct approach is considering influence and interest at all relevant organizational levels. Option C suggests analyzing only senior management.",
    "difficulty": "medium",
    "topics": [
      "organizational levels",
      "hierarchy analysis"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-019",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with technical complexity. How should technical requirements influence the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Focus analysis only on stakeholders with technical expertise."
      },
      {
        "id": "b",
        "label": "Consider technical requirements when assessing stakeholder needs and influence."
      },
      {
        "id": "c",
        "label": "Exclude non-technical stakeholders from the analysis due to complexity."
      },
      {
        "id": "d",
        "label": "Minimize analysis of technical aspects to keep it simple for all stakeholders."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Excluding non-technical stakeholders from the analysis would ignore stakeholders who may be impacted by the project despite not having technical expertise. The correct approach is considering technical requirements when assessing stakeholder needs and influence. Option C suggests excluding non-technical stakeholders.",
    "difficulty": "medium",
    "topics": [
      "technical complexity",
      "technical stakeholders"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-020",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with significant environmental impact. How should environmental factors influence the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Environmental factors should not be considered in stakeholder analysis."
      },
      {
        "id": "b",
        "label": "Include environmental groups and regulatory bodies as key stakeholders."
      },
      {
        "id": "c",
        "label": "Focus only on internal stakeholders and ignore environmental concerns."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder analysis to avoid identifying environmental issues."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Focusing only on internal stakeholders while ignoring environmental concerns would be inappropriate for a project with significant environmental impact. The correct approach is including environmental groups and regulatory bodies as key stakeholders. Option C suggests ignoring environmental stakeholders.",
    "difficulty": "medium",
    "topics": [
      "environmental impact",
      "regulatory stakeholders"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-021",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project that has received negative feedback from previous similar projects. How should this history influence their analysis?",
    "options": [
      {
        "id": "a",
        "label": "Ignore the feedback from previous projects and analyze stakeholders independently."
      },
      {
        "id": "b",
        "label": "Consider lessons learned from similar projects in the stakeholder analysis."
      },
      {
        "id": "c",
        "label": "Focus only on stakeholders who were not involved in the previous projects."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder engagement to avoid potential negative feedback."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Ignoring feedback from previous projects would overlook valuable lessons that could inform stakeholder analysis. The correct approach is considering lessons learned from similar projects in the stakeholder analysis. Option A suggests ignoring historical information that could be valuable.",
    "difficulty": "hard",
    "topics": [
      "lessons learned",
      "historical analysis"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-022",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders in a project with global team members across different regions. How should geographic distribution influence the stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Analyze all stakeholders with the same methods regardless of location."
      },
      {
        "id": "b",
        "label": "Consider regional factors, time zones, and cultural differences in the analysis."
      },
      {
        "id": "c",
        "label": "Focus analysis primarily on stakeholders in the project manager's region."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder analysis for remote stakeholders due to distance."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Focusing analysis primarily on stakeholders in the project manager's region would ignore important stakeholders in other locations. The correct approach is considering regional factors, time zones, and cultural differences in the analysis. Option C suggests geographically biased stakeholder analysis.",
    "difficulty": "hard",
    "topics": [
      "global teams",
      "geographic factors"
    ],
    "process": "plan-communications-management",
    "knowledgeAreaId": "communications"
  },
  {
    "id": "q-process-4-1-023",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with multiple competing objectives. How should competing objectives influence stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Analyze stakeholders based only on alignment with the primary project objective."
      },
      {
        "id": "b",
        "label": "Consider how different stakeholder interests align with various objectives."
      },
      {
        "id": "c",
        "label": "Focus on stakeholders who support all project objectives equally."
      },
      {
        "id": "d",
        "label": "Ignore stakeholder preferences for specific objectives to maintain neutrality."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Analyzing stakeholders based only on alignment with the primary project objective would ignore the complexity of competing objectives and stakeholder interests. The correct approach is considering how different stakeholder interests align with various objectives. Option A suggests a narrow view of stakeholder interests.",
    "difficulty": "hard",
    "topics": [
      "competing objectives",
      "stakeholder alignment"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-4-1-024",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with limited access to stakeholder information. How should this constraint influence their approach?",
    "options": [
      {
        "id": "a",
        "label": "Skip stakeholder analysis due to insufficient information."
      },
      {
        "label": "Use available information and plan for iterative updates as more information emerges."
      },
      {
        "id": "c",
        "label": "Focus analysis only on stakeholders with the most accessible information."
      },
      {
        "id": "d",
        "label": "Make assumptions about stakeholders to complete the analysis."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Skipping stakeholder analysis due to limited information is not appropriate as stakeholder management is essential for project success. The correct approach is using available information and planning for iterative updates as more information emerges. Option A suggests eliminating stakeholder analysis entirely.",
    "difficulty": "medium",
    "topics": [
      "limited information",
      "iterative analysis"
    ],
    "process": "identify-stakeholders",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-4-1-025",
    "domainId": "process",
    "taskId": "process-4",
    "enablerIds": [
      "e-process-4-1"
    ],
    "text": "A project manager is analyzing stakeholders for a project with multiple parallel work streams. How should the project structure influence stakeholder analysis?",
    "options": [
      {
        "id": "a",
        "label": "Complete one stakeholder analysis for the entire project without work stream details."
      },
      {
        "label": "Analyze stakeholder interests and influence specific to each work stream."
      },
      {
        "id": "c",
        "label": "Focus analysis only on stakeholders of the most critical work stream."
      },
      {
        "id": "d",
        "label": "Apply the same stakeholder analysis approach to all parallel work streams."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Completing one stakeholder analysis for the entire project without work stream details would not capture the different stakeholder interests that might be specific to each work stream. The correct approach is analyzing stakeholder interests and influence specific to each work stream. Option A suggests a single analysis approach for all work streams.",
    "difficulty": "hard",
    "topics": [
      "parallel work streams",
      "work stream analysis"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  }
]