[
  {
    "id": "q-people-6-2-001",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager is planning a construction project where the scope is clearly defined. To determine the exact number of engineers and laborers required, the project manager breaks down the work packages into specific activities. Which estimation technique is being used?",
    "options": [
      {
        "id": "a",
        "label": "Parametric estimating."
      },
      {
        "id": "b",
        "label": "Analogous estimating."
      },
      {
        "id": "c",
        "label": "Bottom-up estimating."
      },
      {
        "id": "d",
        "label": "Three-point estimating."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because Bottom-up estimating involves estimating resources for each individual activity or work package and rolling them up to get a project total. It is the most accurate method when scope is clear. Option a uses statistical relationships. Option b uses historical data from similar projects (less accurate). Option d addresses uncertainty in time/cost, not specifically the resource count aggregation method here.",
    "difficulty": "medium",
    "topics": [
      "Bottom-up Estimating",
      "Predictive Planning"
    ]
  },
  {
    "id": "q-people-6-2-002",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "An agile team is planning the next release. The product owner has prioritized the backlog. How should the team deduce how many story points they can complete in the upcoming iterations?",
    "options": [
      {
        "id": "a",
        "label": "By asking the project manager to set a target."
      },
      {
        "id": "b",
        "label": "By analyzing their historical velocity."
      },
      {
        "id": "c",
        "label": "By calculating the hours available in the calendar."
      },
      {
        "id": "d",
        "label": "By using the client's desired delivery date."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. In agile, historical velocity (the amount of work completed in previous sprints) is the primary metric used to deduce future capacity and resource requirements. Option a violates self-organization. Option c is used in traditional planning; agile focuses on points/velocity. Option d determines the schedule goal, not the team's actual capacity.",
    "difficulty": "easy",
    "topics": [
      "Agile Velocity",
      "Capacity Planning"
    ]
  },
  {
    "id": "q-people-6-2-003",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager is initiating a project to develop a new AI software. The organization has never done a project like this before. How should the project manager deduce the initial resource requirements?",
    "options": [
      {
        "id": "a",
        "label": "Rely solely on the project sponsor's request."
      },
      {
        "id": "b",
        "label": "Use Expert Judgment by consulting with external industry subject matter experts."
      },
      {
        "id": "c",
        "label": "Copy the resource plan from a previous web development project."
      },
      {
        "id": "d",
        "label": "Wait until the execution phase to hire resources as needed."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. When internal history is lacking (novel project), Expert Judgment is the most reliable tool to deduce requirements. Option a is risky as sponsors may not know technical details. Option c is incorrect because web development differs from AI. Option d is poor planning and introduces high risk.",
    "difficulty": "medium",
    "topics": [
      "Expert Judgment",
      "Novel Projects"
    ]
  },
  {
    "id": "q-people-6-2-004",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "The project manager creates a hierarchical chart that organizes resources by category and type (e.g., Role > Seniority > Skill). What is this document called?",
    "options": [
      {
        "id": "a",
        "label": "Work Breakdown Structure (WBS)."
      },
      {
        "id": "b",
        "label": "Resource Breakdown Structure (RBS)."
      },
      {
        "id": "c",
        "label": "Organizational Breakdown Structure (OBS)."
      },
      {
        "id": "d",
        "label": "Responsibility Assignment Matrix (RAM)."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. The Resource Breakdown Structure (RBS) is a hierarchical representation of resources by category and type. Option a (WBS) breaks down deliverables. Option c (OBS) breaks down the organization by department. Option d (RAM) links resources to tasks (like a RACI).",
    "difficulty": "easy",
    "topics": [
      "Resource Breakdown Structure",
      "Data Representation"
    ]
  },
  {
    "id": "q-people-6-2-005",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager determines that the project requires a specialized database architect for only three weeks in the middle of the project. This specific requirement deduction will most likely influence which plan?",
    "options": [
      {
        "id": "a",
        "label": "The Quality Management Plan."
      },
      {
        "id": "b",
        "label": "The Stakeholder Engagement Plan."
      },
      {
        "id": "c",
        "label": "The Resource Management Plan."
      },
      {
        "id": "d",
        "label": "The Scope Management Plan."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct. The Resource Management Plan describes how resources are categorized, allocated, managed, and released. Identifying a temporary niche resource directly impacts this plan. While others are affected, the resource plan is the primary home for this data.",
    "difficulty": "easy",
    "topics": [
      "Resource Management Plan",
      "Specialized Skills"
    ]
  },
  {
    "id": "q-people-6-2-006",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "While analyzing resource requirements for a software upgrade, the project manager realizes the team needs a specific server hardware configuration to run tests. This is an example of identifying:",
    "options": [
      {
        "id": "a",
        "label": "Human resources."
      },
      {
        "id": "b",
        "label": "Physical resources."
      },
      {
        "id": "c",
        "label": "Project constraints."
      },
      {
        "id": "d",
        "label": "Management reserves."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Resources include both team members (Human) and materials/equipment (Physical). Hardware falls under physical resources. Option c is a factor, but the item itself is a resource. Option d refers to budget buffers.",
    "difficulty": "easy",
    "topics": [
      "Physical Resources",
      "Resource Types"
    ]
  },
  {
    "id": "q-people-6-2-007",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager is defining resource requirements for a project that involves handling hazardous materials. Which input is most critical to ensure the correct safety personnel are requested?",
    "options": [
      {
        "id": "a",
        "label": "Team Charter."
      },
      {
        "id": "b",
        "label": "Enterprise Environmental Factors (EEF)."
      },
      {
        "id": "c",
        "label": "Project Schedule."
      },
      {
        "id": "d",
        "label": "Stakeholder Register."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. EEFs include government regulations and industry safety standards. The project manager must review these to deduce the legal requirement for safety officers or certified handlers. The other documents are internal to the project and may not capture external legal mandates.",
    "difficulty": "medium",
    "topics": [
      "EEF",
      "Compliance"
    ]
  },
  {
    "id": "q-people-6-2-008",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "During the planning phase, the project manager uses data from a similar past project to estimate that the team needs 5 developers for 6 months. What is a primary risk of this 'Analogous Estimating' approach?",
    "options": [
      {
        "id": "a",
        "label": "It is too time-consuming to calculate."
      },
      {
        "id": "b",
        "label": "It relies on the assumption that the current project is very similar to the past one."
      },
      {
        "id": "c",
        "label": "It requires detailed statistical software."
      },
      {
        "id": "d",
        "label": "It cannot be used in the planning phase."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Analogous estimating is fast and cheap but less accurate because it assumes the projects are similar. If the new project has hidden complexities, the resource deduction will be wrong. Options a and c describe Parametric or Bottom-up traits. Option d is false; it is often used in planning.",
    "difficulty": "medium",
    "topics": [
      "Analogous Estimating",
      "Risk Assessment"
    ]
  },
  {
    "id": "q-people-6-2-009",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager calculates that painting the office walls will require 400 hours of labor based on the square footage and standard industry painting rates. Which estimation technique is this?",
    "options": [
      {
        "id": "a",
        "label": "Parametric estimating."
      },
      {
        "id": "b",
        "label": "Three-point estimating."
      },
      {
        "id": "c",
        "label": "Expert judgment."
      },
      {
        "id": "d",
        "label": "Bottom-up estimating."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. Parametric estimating uses a statistical relationship between historical data and other variables (e.g., square footage * rate per foot) to calculate resource needs. Option b uses pessimistic/optimistic/most likely scenarios. Option c relies on opinion. Option d looks at individual tasks, not a formulaic rate.",
    "difficulty": "medium",
    "topics": [
      "Parametric Estimating",
      "Calculation"
    ]
  },
  {
    "id": "q-people-6-2-010",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager is planning a project with a fixed deadline. The initial resource analysis shows that the current team size cannot meet the date. The manager decides to add more resources to the critical path tasks. This strategy is known as:",
    "options": [
      {
        "id": "a",
        "label": "Fast tracking."
      },
      {
        "id": "b",
        "label": "Crashing."
      },
      {
        "id": "c",
        "label": "Resource Leveling."
      },
      {
        "id": "d",
        "label": "Simulation."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Crashing involves adding resources (money/people) to shorten the schedule. The deduction here is that *more* resources are required to meet the time constraint. Option a (Fast Tracking) runs tasks in parallel. Option c (Leveling) usually extends schedules to smooth resource usage.",
    "difficulty": "medium",
    "topics": [
      "Schedule Compression",
      "Crashing"
    ]
  },
  {
    "id": "q-people-6-2-011",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "In a Hybrid project, the development team is using Scrum. The Project Manager needs to report resource requirements to the Finance department for the next quarter. What is the best way to deduce this?",
    "options": [
      {
        "id": "a",
        "label": "Ask the team to create a detailed Gantt chart for the next 3 months."
      },
      {
        "id": "b",
        "label": "Multiply the number of stable team members by their burn rate for the duration."
      },
      {
        "id": "c",
        "label": "Assume the cost will be zero because agile teams are self-managing."
      },
      {
        "id": "d",
        "label": "Wait until the quarter ends and report the actuals."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Agile teams are typically stable (fixed size). Therefore, resource requirements are deduced by taking the fixed team cost (burn rate) and multiplying it by the time period. Option a is anti-agile. Option c is incorrect; people still cost money. Option d fails the planning requirement.",
    "difficulty": "medium",
    "topics": [
      "Agile Budgeting",
      "Stable Teams"
    ]
  },
  {
    "id": "q-people-6-2-012",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager identifies that a project activity requires a forklift. The organization does not own one. What analysis should the project manager perform to deduce the best resource strategy?",
    "options": [
      {
        "id": "a",
        "label": "Make-or-buy analysis."
      },
      {
        "id": "b",
        "label": "Root cause analysis."
      },
      {
        "id": "c",
        "label": "Stakeholder analysis."
      },
      {
        "id": "d",
        "label": "SWOT analysis."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. A Make-or-buy analysis (or Rent-vs-Buy) helps determine whether it is more cost-effective to produce/own a resource internally or acquire/rent it externally. Option b is for problems. Option c is for people. Option d is for strategic position.",
    "difficulty": "easy",
    "topics": [
      "Make-or-Buy",
      "Procurement"
    ]
  },
  {
    "id": "q-people-6-2-013",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A global project requires team members to collaborate across three different time zones. When deducing resource requirements, what is a critical non-human resource the project manager must ensure is available?",
    "options": [
      {
        "id": "a",
        "label": "A large travel budget for weekly face-to-face meetings."
      },
      {
        "id": "b",
        "label": "Robust collaboration tools and virtual meeting licenses."
      },
      {
        "id": "c",
        "label": "A physical office in the central time zone."
      },
      {
        "id": "d",
        "label": "A 24-hour cafeteria."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. For distributed/virtual teams, technology (collaboration software) is a mandatory physical resource requirement to enable communication. Option a is likely cost-prohibitive. Option c negates the virtual nature. Option d is a perk, not a requirement.",
    "difficulty": "easy",
    "topics": [
      "Virtual Teams",
      "Tools and Technology"
    ]
  },
  {
    "id": "q-people-6-2-014",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "The project manager is determining resource requirements and notices that the available Senior Developer has a calendar that shows a 3-week vacation during the project's critical execution phase. Which tool highlighted this availability constraint?",
    "options": [
      {
        "id": "a",
        "label": "Resource Histogram."
      },
      {
        "id": "b",
        "label": "Resource Calendar."
      },
      {
        "id": "c",
        "label": "Requirements Traceability Matrix."
      },
      {
        "id": "d",
        "label": "Project Charter."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Resource Calendars specifically track the availability (working days, holidays, vacations) of specific resources. Option a shows allocation quantity over time but not necessarily specific vacation dates of individuals. Options c and d do not track time availability.",
    "difficulty": "easy",
    "topics": [
      "Resource Calendars",
      "Availability"
    ]
  },
  {
    "id": "q-people-6-2-015",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "While defining the team, the project manager realizes the scope requires a skill set (blockchain programming) that does not exist within the company. This finding primarily drives the creation of which document?",
    "options": [
      {
        "id": "a",
        "label": "The Procurement Statement of Work."
      },
      {
        "id": "b",
        "label": "The Project Scope Statement."
      },
      {
        "id": "c",
        "label": "The Team Charter."
      },
      {
        "id": "d",
        "label": "The Quality Report."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. Deducing that internal resources are insufficient leads to procurement. The Procurement Statement of Work (SOW) describes the work to be outsourced so vendors can bid. Option b defines the project, not the vendor's work specifically. Option c is for team norms. Option d is for defects.",
    "difficulty": "medium",
    "topics": [
      "Procurement",
      "Skill Gap"
    ]
  },
  {
    "id": "q-people-6-2-016",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager is facing budget cuts. To deduce if the project can still proceed, they look for resources that can perform multiple roles (e.g., a developer who can also test). This is an analysis of:",
    "options": [
      {
        "id": "a",
        "label": "Generalized Specialists."
      },
      {
        "id": "b",
        "label": "Resource Smoothing."
      },
      {
        "id": "c",
        "label": "Virtual Teams."
      },
      {
        "id": "d",
        "label": "Pre-assignment."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct. Generalized Specialists (or T-shaped people) reduce the total headcount requirement because one person can cover multiple needs. This is a key deduction strategy when budget is tight. Option b changes the schedule to optimize resources. Option d refers to picking people before the project starts.",
    "difficulty": "medium",
    "topics": [
      "T-Shaped Skills",
      "Resource Optimization"
    ]
  },
  {
    "id": "q-people-6-2-017",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "The project scope changes significantly during execution. What is the immediate next step regarding resource requirements?",
    "options": [
      {
        "id": "a",
        "label": "Keep the existing team to maintain morale."
      },
      {
        "id": "b",
        "label": "Re-evaluate the resource requirements to align with the new scope."
      },
      {
        "id": "c",
        "label": "Automatically double the resource count to be safe."
      },
      {
        "id": "d",
        "label": "Ask the sponsor to cancel the project."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Resource requirements are derived from scope. If scope changes, the resource needs (type and quantity) must be re-deduced. Option a ignores the reality of the work. Option c is wasteful. Option d is an overreaction.",
    "difficulty": "easy",
    "topics": [
      "Change Management",
      "Integrated Planning"
    ]
  },
  {
    "id": "q-people-6-2-018",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager is reviewing the project charter. It states the budget is fixed at $100,000. How does this constrain the deduction of resource requirements?",
    "options": [
      {
        "id": "a",
        "label": "It mandates the use of only junior resources."
      },
      {
        "id": "b",
        "label": "It requires the project manager to balance resource quality/quantity against the cost constraint."
      },
      {
        "id": "c",
        "label": "It means no physical resources can be purchased."
      },
      {
        "id": "d",
        "label": "It forces the project to use an Agile methodology."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. A fixed budget is a constraint. The PM must deduce a mix of resources (seniority, count, duration) that fits within that cap. It doesn't automatically mean 'only junior' (Option a) or 'no physical' (Option c), but rather requires a trade-off analysis.",
    "difficulty": "medium",
    "topics": [
      "Constraints",
      "Budgeting"
    ]
  },
  {
    "id": "q-people-6-2-019",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "During a sprint planning meeting, the team identifies that a user story requires a specific security audit that none of them are qualified to perform. What should the team do?",
    "options": [
      {
        "id": "a",
        "label": "Mark the story as 'Done' and hope no one notices."
      },
      {
        "id": "b",
        "label": "Flag the resource impediment to the Product Owner and Scrum Master/Project Manager immediately."
      },
      {
        "id": "c",
        "label": "Assign the story to the newest team member as a learning opportunity."
      },
      {
        "id": "d",
        "label": "Extend the sprint duration to learn the skill."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. When a team realizes they lack a required resource (skill) to complete an item, they must flag it as an impediment/blocker. The PM/Scrum Master then works to remove the blocker (e.g., bring in an external auditor). Options a and c introduce risk. Option d violates the time-box principle.",
    "difficulty": "medium",
    "topics": [
      "Agile Planning",
      "Impediments"
    ]
  },
  {
    "id": "q-people-6-2-020",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager needs to deduce resources for a high-turnover environment. Which document should be created to ensure that knowledge is not lost if a resource leaves?",
    "options": [
      {
        "id": "a",
        "label": "A strict non-compete agreement."
      },
      {
        "id": "b",
        "label": "A resource management plan that includes knowledge transfer and succession planning."
      },
      {
        "id": "c",
        "label": "A change log."
      },
      {
        "id": "d",
        "label": "A issue log."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. In high-turnover environments, the resource strategy must include provisions for knowledge transfer and backfilling (succession). Option a is legal, not project management. Options c and d track events, not the strategy for resource continuity.",
    "difficulty": "medium",
    "topics": [
      "Knowledge Transfer",
      "Risk Management"
    ]
  },
  {
    "id": "q-people-6-2-021",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "The project manager is identifying resources for a creative design project. Instead of listing names, the PM lists 'Graphic Designer - Level 2' and 'Copywriter - Level 1'. This list represents:",
    "options": [
      {
        "id": "a",
        "label": "Resource pre-assignment."
      },
      {
        "id": "b",
        "label": "Resource requirements by role and competency."
      },
      {
        "id": "c",
        "label": "Virtual team planning."
      },
      {
        "id": "d",
        "label": "Stakeholder engagement assessment."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Deducing requirements usually starts with defining the Role and the Competency (Level) needed, before specific individuals are named. Option a involves naming specific people. Option c and d are unrelated concepts.",
    "difficulty": "easy",
    "topics": [
      "Role Definitions",
      "Competency"
    ]
  },
  {
    "id": "q-people-6-2-022",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager applies 'Resource Smoothing' after deducing the initial requirements. What is the goal of this technique?",
    "options": [
      {
        "id": "a",
        "label": "To finish the project as fast as possible regardless of cost."
      },
      {
        "id": "b",
        "label": "To adjust the activities so that resource requirements do not exceed pre-set limits, without changing the critical path."
      },
      {
        "id": "c",
        "label": "To reduce the scope of the project."
      },
      {
        "id": "d",
        "label": "To ensure every team member works overtime."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Resource Smoothing adjusts the schedule using float to ensure resource usage is even (smooth) and doesn't exceed limits, but typically strictly adheres to the completion date (Critical Path). Resource Leveling (not an option here) often extends the schedule.",
    "difficulty": "hard",
    "topics": [
      "Resource Smoothing",
      "Schedule Optimization"
    ]
  },
  {
    "id": "q-people-6-2-023",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "What is the relationship between the Work Breakdown Structure (WBS) and deducing project resource requirements?",
    "options": [
      {
        "id": "a",
        "label": "There is no relationship."
      },
      {
        "id": "b",
        "label": "The WBS dictionary provides the detailed description of work needed to identify the necessary skills."
      },
      {
        "id": "c",
        "label": "Resources are deduced first, then the WBS is created to fit them."
      },
      {
        "id": "d",
        "label": "The WBS lists the names of the employees."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. You cannot deduce what you need until you know what you are doing. The WBS and its dictionary define the 'what,' allowing the PM to determine the 'who' (skills/resources). Option c is backward. Option d is incorrect; the WBS lists deliverables, not people.",
    "difficulty": "medium",
    "topics": [
      "WBS",
      "Scope to Resource Mapping"
    ]
  },
  {
    "id": "q-people-6-2-024",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "A project manager in a matrix organization needs a specific database administrator. The functional manager refuses, saying the resource is busy. What should the project manager have done during the 'Deduce Resource Requirements' step to prevent this surprise?",
    "options": [
      {
        "id": "a",
        "label": "Hired an external contractor immediately."
      },
      {
        "id": "b",
        "label": "Consulted with functional managers early to assess availability and pre-negotiate needs."
      },
      {
        "id": "c",
        "label": "Complained to the CEO."
      },
      {
        "id": "d",
        "label": "Planned the project without a database."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Deducing requirements isn't just about writing a list; it involves checking the feasibility of those requirements. Early consultation with resource owners (functional managers) validates if the deduced requirements are realistic. The other options are reactive or unrealistic.",
    "difficulty": "medium",
    "topics": [
      "Matrix Organization",
      "Negotiation"
    ]
  },
  {
    "id": "q-people-6-2-025",
    "domainId": "people",
    "taskId": "people-6",
    "enablerIds": [
      "e-people-6-2"
    ],
    "text": "When deducing resource requirements for a project involving proprietary client data, the project manager must ensure the team members have specific legal clearance. This is an example of:",
    "options": [
      {
        "id": "a",
        "label": "Organizational Process Assets (OPA)."
      },
      {
        "id": "b",
        "label": "Project constraints."
      },
      {
        "id": "c",
        "label": "Assumption logging."
      },
      {
        "id": "d",
        "label": "Resource leveling."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. A legal clearance requirement is a limitation or condition (Constraint) placed on the project's resource selection. It restricts the pool of available resources. While it might be documented in assumptions initially, it functions as a hard constraint.",
    "difficulty": "medium",
    "topics": [
      "Constraints",
      "Compliance"
    ]
  }
]
