[
  {
    "id": "q-process-3-2-001",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager has identified several risks during the initial risk identification session. What should be their next step in iteratively assessing and prioritizing these risks?",
    "options": [
      {
        "id": "a",
        "label": "Immediately implement risk responses for all identified risks."
      },
      {
        "id": "b",
        "label": "Perform qualitative risk analysis to prioritize risks based on probability and impact."
      },
      {
        "id": "c",
        "label": "Document all risks in the project plan without further analysis."
      },
      {
        "id": "d",
        "label": "Transfer all risks to external parties to avoid internal impact."
      }
    ],
    "correctOptionId": "b",
    "explanation": "After identifying risks, the next step in risk management is to perform qualitative risk analysis to prioritize risks based on their probability and impact. This allows the project manager to focus on the most significant risks first. Without prioritization, resources might be wasted on less critical risks while more important ones go unaddressed.",
    "difficulty": "easy",
    "topics": [
      "risk analysis",
      "risk prioritization"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-002",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working on a project with limited time for risk assessment. How should they approach iteratively assessing and prioritizing risks?",
    "options": [
      {
        "id": "a",
        "label": "Assess all risks with the same level of detail regardless of time constraints."
      },
      {
        "id": "b",
        "label": "Focus first on high-probability, high-impact risks using efficient assessment methods."
      },
      {
        "id": "c",
        "label": "Skip risk assessment to save time for other project activities."
      },
      {
        "id": "d",
        "label": "Assess risks only at the beginning and end of the project."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Skipping risk assessment to save time would expose the project to unmanaged risks that could cause greater delays. The correct approach is focusing first on high-probability, high-impact risks using efficient assessment methods. Option C abandons risk assessment entirely, which is not appropriate.",
    "difficulty": "medium",
    "topics": [
      "time constraints",
      "risk prioritization"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-003",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is assessing and prioritizing risks for a project with multiple stakeholder groups that have different risk tolerances. How should this influence their approach?",
    "options": [
      {
        "id": "a",
        "label": "Apply a uniform risk threshold to all stakeholder groups."
      },
      {
        "id": "b",
        "label": "Consider stakeholder risk tolerances when assessing and prioritizing risks."
      },
      {
        "id": "c",
        "label": "Prioritize risks only based on the most risk-averse stakeholder group."
      },
      {
        "id": "d",
        "label": "Ignore stakeholder risk tolerances in the risk assessment process."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Applying a uniform risk threshold to all stakeholder groups ignores their different risk tolerances, which should be considered in the risk assessment. The correct approach is considering stakeholder risk tolerances when assessing and prioritizing risks. Option A doesn't account for different stakeholder perspectives that affect project success.",
    "difficulty": "medium",
    "topics": [
      "stakeholder risk tolerance",
      "risk assessment"
    ],
    "process": "plan-risk-management",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-004",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager has identified risks during project execution that were not recognized during planning. How should they incorporate these new risks into the ongoing risk assessment and prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Add the new risks to the risk register but do not reassess priorities."
      },
      {
        "id": "b",
        "label": "Include new risks in the risk assessment and update priorities accordingly."
      },
      {
        "id": "c",
        "label": "Wait until the next planned risk review to consider these new risks."
      },
      {
        "id": "d",
        "label": "Focus only on risks identified during the planning phase."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Focusing only on risks identified during the planning phase ignores new risks that arise during project execution, which is not appropriate. The correct approach is including new risks in the risk assessment and updating priorities accordingly. Option D ignores new information that could significantly impact the project.",
    "difficulty": "medium",
    "topics": [
      "risk monitoring",
      "iterative risk assessment"
    ],
    "process": "monitor-risks",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-005",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is prioritizing risks for a project with a limited budget for risk responses. How should budget constraints influence their risk prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Prioritize risks based only on their potential impact to the project."
      },
      {
        "id": "b",
        "label": "Consider both risk impact and the cost-effectiveness of potential responses."
      },
      {
        "id": "c",
        "label": "Focus on risks that require the most expensive mitigation strategies."
      },
      {
        "id": "d",
        "label": "Ignore budget constraints when prioritizing risks for attention."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Ignoring budget constraints when prioritizing risks is not practical since the project has limited resources for risk responses. The correct approach is considering both risk impact and the cost-effectiveness of potential responses. Option D disregards important resource limitations in risk prioritization.",
    "difficulty": "easy",
    "topics": [
      "budget constraints",
      "cost-effective risk management"
    ],
    "process": "plan-risk-responses",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-006",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working on a project with rapidly changing requirements. How should this affect their approach to assessing and prioritizing risks?",
    "options": [
      {
        "id": "a",
        "label": "Conduct a single comprehensive risk assessment at project start."
      },
      {
        "id": "b",
        "label": "Perform frequent risk assessments as requirements change."
      },
      {
        "id": "c",
        "label": "Focus only on risks related to requirement stability."
      },
      {
        "id": "d",
        "label": "Delay risk assessment until requirements become stable."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Conducting a single comprehensive risk assessment at project start is not appropriate for projects with rapidly changing requirements, as new risks emerge with each change. The correct approach is performing frequent risk assessments as requirements change. Option A doesn't adapt to the dynamic nature of the project.",
    "difficulty": "hard",
    "topics": [
      "changing requirements",
      "iterative risk assessment"
    ],
    "process": "monitor-risks",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-007",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is assessing risks in a project with multiple phases. How should they approach risk prioritization across the project lifecycle?",
    "options": [
      {
        "id": "a",
        "label": "Identify and prioritize all risks for the entire project at the beginning."
      },
      {
        "id": "b",
        "label": "Assess and prioritize risks specific to each phase as the project progresses."
      },
      {
        "id": "c",
        "label": "Focus only on risks related to the current project phase."
      },
      {
        "id": "d",
        "label": "Apply the same risk priorities to all project phases."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Applying the same risk priorities to all project phases doesn't account for the different risks that exist in different phases of the project lifecycle. The correct approach is assessing and prioritizing risks specific to each phase as the project progresses. Option D ignores the phase-specific nature of many project risks.",
    "difficulty": "medium",
    "topics": [
      "project phases",
      "lifecycle risk management"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-3-2-008",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working with a global team across multiple time zones and cultures. How should this influence their approach to risk assessment and prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Use the same risk assessment approach for all team members regardless of location."
      },
      {
        "id": "b",
        "label": "Consider cultural differences in risk perception and global coordination risks."
      },
      {
        "id": "c",
        "label": "Conduct risk assessment only with the project manager's home team."
      },
      {
        "id": "d",
        "label": "Minimize risk assessment to avoid conflicts across cultures."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Minimizing risk assessment to avoid conflicts across cultures would not adequately identify and manage project risks. The correct approach is considering cultural differences in risk perception and global coordination risks. Option D reduces necessary risk assessment activities due to cultural concerns.",
    "difficulty": "hard",
    "topics": [
      "global teams",
      "cultural risk perception"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-009",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is prioritizing risks for a project with strict regulatory compliance requirements. How should compliance considerations influence their prioritization approach?",
    "options": [
      {
        "id": "a",
        "label": "Treat compliance risks the same as other project risks without special priority."
      },
      {
        "id": "b",
        "label": "Give high priority to risks that could result in non-compliance with regulations."
      },
      {
        "id": "c",
        "label": "Focus only on compliance-related risks and ignore other risks."
      },
      {
        "id": "d",
        "label": "Minimize the assessment of compliance risks to avoid additional complexity."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Focusing only on compliance-related risks and ignoring other risks would result in an incomplete risk management approach. The correct approach is giving high priority to risks that could result in non-compliance with regulations. Option C ignores other important project risks in favor of compliance risks only.",
    "difficulty": "medium",
    "topics": [
      "regulatory compliance",
      "risk prioritization"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-3-2-010",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager has identified both positive and negative risks on their project. How should they approach assessing and prioritizing these different types of risks?",
    "options": [
      {
        "id": "a",
        "label": "Focus only on negative risks since opportunities are less important."
      },
      {
        "id": "b",
        "label": "Assess and prioritize both threats and opportunities appropriately."
      },
      {
        "id": "c",
        "label": "Treat threats and opportunities with equal priority."
      },
      {
        "id": "d",
        "label": "Minimize attention to opportunities since they are less critical than threats."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Focusing only on negative risks since opportunities are less important ignores the potential benefits that positive risks (opportunities) can bring to the project. The correct approach is assessing and prioritizing both threats and opportunities appropriately. Option A excludes opportunities from proper risk management.",
    "difficulty": "medium",
    "topics": [
      "threats and opportunities",
      "risk balance"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-011",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working on a project where a risk's probability and impact have changed significantly since the initial assessment. How should they handle this?",
    "options": [
      {
        "id": "a",
        "label": "Keep the original risk priority based on the initial assessment."
      },
      {
        "id": "b",
        "label": "Reassess the risk based on the new probability and impact and update priorities."
      },
      {
        "id": "c",
        "label": "Remove the risk from the register since its characteristics have changed."
      },
      {
        "id": "d",
        "label": "Wait for the next planned risk review to update the risk assessment."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Keeping the original risk priority based on the initial assessment when the risk characteristics have changed significantly would result in inadequate risk management. The correct approach is reassessing the risk based on the new probability and impact and updating priorities. Option A doesn't adapt to changed risk conditions.",
    "difficulty": "medium",
    "topics": [
      "risk monitoring",
      "dynamic risk assessment"
    ],
    "process": "monitor-risks",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-012",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is assessing risks for a project in an industry with rapidly evolving technology. How should this factor influence their risk assessment approach?",
    "options": [
      {
        "id": "a",
        "label": "Conduct a single comprehensive risk assessment using current technology knowledge."
      },
      {
        "id": "b",
        "label": "Plan for regular reassessment of risks due to the changing technology landscape."
      },
      {
        "id": "c",
        "label": "Focus only on technology-related risks and ignore other project risks."
      },
      {
        "id": "d",
        "label": "Minimize risk assessment due to the unpredictable nature of technology changes."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Minimizing risk assessment due to the unpredictable nature of technology changes is not appropriate since risk management is especially important in uncertain environments. The correct approach is planning for regular reassessment of risks due to the changing technology landscape. Option D reduces necessary risk management in a high-risk environment.",
    "difficulty": "hard",
    "topics": [
      "changing technology",
      "iterative risk assessment"
    ],
    "process": "perform-quantitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-013",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is prioritizing risks and has identified some risks that could affect multiple project objectives simultaneously. How should they assess these interconnected risks?",
    "options": [
      {
        "id": "a",
        "label": "Assess each risk in isolation without considering interconnections."
      },
      {
        "id": "b",
        "label": "Consider the combined impact of interconnected risks rather than in isolation."
      },
      {
        "id": "c",
        "label": "Focus only on the most severely impacted objective for each risk."
      },
      {
        "id": "d",
        "label": "Average the impacts across all affected objectives for each risk."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Assessing each risk in isolation without considering interconnections doesn't account for the cumulative effect of risks that affect multiple objectives. The correct approach is considering the combined impact of interconnected risks rather than in isolation. Option A ignores the interconnected nature of many project risks.",
    "difficulty": "hard",
    "topics": [
      "interconnected risks",
      "cumulative risk impact"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-014",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working on a project with external dependencies on vendor deliverables. How should they include these dependencies in their risk assessment and prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Treat vendor-related risks the same as internal project risks without distinction."
      },
      {
        "id": "b",
        "label": "Assess vendor-related risks considering limited control over external factors."
      },
      {
        "id": "c",
        "label": "Exclude vendor risks from the project risk register since they're external."
      },
      {
        "id": "d",
        "label": "Focus only on risks within the project team's direct control."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Excluding vendor risks from the project risk register since they're external ignores significant potential impacts on the project. The correct approach is assessing vendor-related risks considering limited control over external factors. Option C omits important external risks that can significantly impact the project.",
    "difficulty": "medium",
    "topics": [
      "external dependencies",
      "vendor risks"
    ],
    "process": "control-procurements",
    "knowledgeAreaId": "procurement"
  },
  {
    "id": "q-process-3-2-015",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is assessing risks on a project with a high degree of uncertainty. How should uncertainty levels influence their risk assessment approach?",
    "options": [
      {
        "id": "a",
        "label": "Reduce risk assessment activities due to the difficulty of assessment in uncertainty."
      },
      {
        "id": "b",
        "label": "Increase attention to risk assessment since uncertainty increases risk exposure."
      },
      {
        "id": "c",
        "label": "Focus only on certainties and ignore uncertain aspects of the project."
      },
      {
        "id": "d",
        "label": "Apply standard risk assessment methods without considering the uncertainty level."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Reducing risk assessment activities due to the difficulty of assessment in uncertainty is counterproductive when risk management is needed most. The correct approach is increasing attention to risk assessment since uncertainty increases risk exposure. Option A reduces risk management at a time when it's most needed.",
    "difficulty": "hard",
    "topics": [
      "project uncertainty",
      "risk assessment intensity"
    ],
    "process": "identify-risks",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-016",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is prioritizing risks in a project with strict quality requirements. How should quality considerations influence their risk prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Treat quality risks the same as other project risks without special priority."
      },
      {
        "id": "b",
        "label": "Give appropriate priority to risks that could affect quality deliverables."
      },
      {
        "id": "c",
        "label": "Focus only on quality-related risks and ignore other project risks."
      },
      {
        "id": "d",
        "label": "Minimize assessment of quality risks to focus on schedule and budget risks."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Focusing only on quality-related risks and ignoring other project risks would result in incomplete risk management. The correct approach is giving appropriate priority to risks that could affect quality deliverables. Option C excludes other important project risks from consideration.",
    "difficulty": "medium",
    "topics": [
      "quality risks",
      "risk prioritization"
    ],
    "process": "manage-quality",
    "knowledgeAreaId": "quality"
  },
  {
    "id": "q-process-3-2-017",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working with stakeholders who have had negative experiences with risk management in past projects. How should this history influence their approach to risk prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Avoid formal risk prioritization processes due to stakeholder concerns."
      },
      {
        "id": "b",
        "label": "Implement a transparent and simple prioritization approach to build trust."
      },
      {
        "id": "c",
        "label": "Focus only on low-priority risks to avoid stakeholder discomfort."
      },
      {
        "id": "d",
        "label": "Use complex risk matrices to demonstrate comprehensive risk management."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Avoiding formal risk prioritization processes due to stakeholder concerns would compromise project risk management. The correct approach is implementing a transparent and simple prioritization approach to build trust. Option A abandons necessary risk prioritization activities.",
    "difficulty": "hard",
    "topics": [
      "past experiences",
      "stakeholder trust"
    ],
    "process": "manage-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-process-3-2-018",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is iterating through risk assessments and notices that some previously low-priority risks have increased in probability. How should they respond?",
    "options": [
      {
        "id": "a",
        "label": "Maintain the original priority ranking since it was already established."
      },
      {
        "id": "b",
        "label": "Reassess the changed risks and update the priority rankings accordingly."
      },
      {
        "id": "c",
        "label": "Focus only on the originally high-priority risks and ignore changes."
      },
      {
        "id": "d",
        "label": "Wait until the next scheduled risk review to address the changes."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Maintaining the original priority ranking when risk probability has changed would result in misprioritized risk management efforts. The correct approach is reassessing the changed risks and updating the priority rankings accordingly. Option A doesn't adapt to changed risk conditions.",
    "difficulty": "medium",
    "topics": [
      "risk monitoring",
      "priority updating"
    ],
    "process": "monitor-risks",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-019",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working on a project with multiple interdependent work streams. How should they approach assessing and prioritizing risks across these streams?",
    "options": [
      {
        "id": "a",
        "label": "Assess risks in each work stream independently without considering interdependencies."
      },
      {
        "id": "b",
        "label": "Consider how risks in one stream may affect other streams during assessment."
      },
      {
        "id": "c",
        "label": "Focus risk assessment only on the most critical work stream."
      },
      {
        "id": "d",
        "label": "Apply identical risk priorities to all work streams for consistency."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Assessing risks in each work stream independently without considering interdependencies ignores how risks in one area can affect others. The correct approach is considering how risks in one stream may affect other streams during assessment. Option A doesn't account for important interdependencies between work streams.",
    "difficulty": "hard",
    "topics": [
      "work stream interdependencies",
      "integrated risk assessment"
    ],
    "process": "develop-project-management-plan",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-3-2-020",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is prioritizing risks in a project with significant budget constraints. How should financial limitations influence their risk prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Prioritize risks based only on potential financial impact to the project."
      },
      {
        "id": "b",
        "label": "Consider both risk impact and available resources for risk response."
      },
      {
        "id": "c",
        "label": "Focus primarily on risks that are cheapest to mitigate."
      },
      {
        "id": "d",
        "label": "Ignore financial aspects when prioritizing risk responses."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Prioritizing risks based only on potential financial impact to the project ignores the resources needed to address the risks. The correct approach is considering both risk impact and available resources for risk response. Option A focuses only on impact without considering response feasibility.",
    "difficulty": "medium",
    "topics": [
      "budget constraints",
      "resource-aware prioritization"
    ],
    "process": "estimate-costs",
    "knowledgeAreaId": "cost"
  },
  {
    "id": "q-process-3-2-021",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working in an industry with high regulatory oversight. How should compliance requirements influence their risk assessment and prioritization process?",
    "options": [
      {
        "id": "a",
        "label": "Treat regulatory risks like any other project risk without special consideration."
      },
      {
        "id": "b",
        "label": "Give high priority to risks that could result in regulatory violations."
      },
      {
        "id": "c",
        "label": "Focus only on regulatory compliance risks and ignore project-specific risks."
      },
      {
        "id": "d",
        "label": "Minimize risk documentation to avoid regulatory scrutiny."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Focusing only on regulatory compliance risks and ignoring project-specific risks would result in incomplete risk management. The correct approach is giving high priority to risks that could result in regulatory violations. Option C ignores important project risks in favor of compliance risks only.",
    "difficulty": "medium",
    "topics": [
      "regulatory oversight",
      "compliance risk prioritization"
    ],
    "process": "monitor-and-control-project-work",
    "knowledgeAreaId": "integration"
  },
  {
    "id": "q-process-3-2-022",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager has identified a risk that could have a very high impact but with a very low probability of occurrence. How should they approach prioritizing this risk?",
    "options": [
      {
        "id": "a",
        "label": "Ignore the risk due to its low probability of occurrence."
      },
      {
        "id": "b",
        "label": "Consider both probability and impact when determining the risk priority."
      },
      {
        "id": "c",
        "label": "Give the highest priority to any high-impact risk regardless of probability."
      },
      {
        "id": "d",
        "label": "Focus only on risks with high probability regardless of potential impact."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Ignoring a risk due to its low probability of occurrence, even if it has very high impact, is not appropriate risk management. The correct approach is considering both probability and impact when determining the risk priority. Option A dismisses a potentially catastrophic risk due to its low probability.",
    "difficulty": "medium",
    "topics": [
      "probability vs impact",
      "risk matrix"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-023",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is assessing and prioritizing risks for a project with limited risk management expertise on the team. How should this constraint influence their approach?",
    "options": [
      {
        "id": "a",
        "label": "Reduce the scope of risk assessment due to team limitations."
      },
      {
        "id": "b",
        "label": "Simplify risk assessment methods and possibly engage external expertise."
      },
      {
        "id": "c",
        "label": "Focus only on easily identifiable risks to avoid complexity."
      },
      {
        "id": "d",
        "label": "Skip risk assessment since the team lacks expertise in this area."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Skipping risk assessment since the team lacks expertise is not appropriate as risk management is essential for project success. The correct approach is simplifying risk assessment methods and possibly engaging external expertise. Option D eliminates risk assessment entirely due to capability limitations.",
    "difficulty": "medium",
    "topics": [
      "team capability",
      "risk management adaptation"
    ],
    "process": "plan-risk-management",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-024",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is working on a project with a very tight deadline. How should time constraints influence their approach to risk assessment and prioritization?",
    "options": [
      {
        "id": "a",
        "label": "Apply rapid risk assessment techniques focusing on high-impact risks."
      },
      {
        "id": "b",
        "label": "Delay risk assessment until after the immediate deadline concerns are addressed."
      },
      {
        "id": "c",
        "label": "Conduct detailed risk assessments for all identified risks regardless of time."
      },
      {
        "id": "d",
        "label": "Minimize risk assessment to save time for other project activities."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Minimizing risk assessment to save time for other project activities is not appropriate as unmanaged risks could cause greater delays. The correct approach is applying rapid risk assessment techniques focusing on high-impact risks. Option D reduces necessary risk management activities.",
    "difficulty": "medium",
    "topics": [
      "time constraints",
      "rapid risk assessment"
    ],
    "process": "perform-qualitative-risk-analysis",
    "knowledgeAreaId": "risk"
  },
  {
    "id": "q-process-3-2-025",
    "domainId": "process",
    "taskId": "process-3",
    "enablerIds": [
      "e-process-3-2"
    ],
    "text": "A project manager is iteratively assessing and prioritizing risks in a project environment where stakeholder priorities frequently change. How should they adapt their approach?",
    "options": [
      {
        "id": "a",
        "label": "Establish a fixed risk priority list that doesn't change regardless of stakeholder input."
      },
      {
        "id": "b",
        "label": "Regularly reassess risk priorities in light of changing stakeholder needs."
      },
      {
        "id": "c",
        "label": "Focus only on risks that were initially identified and ignore stakeholder changes."
      },
      {
        "id": "d",
        "label": "Minimize stakeholder input in risk prioritization to maintain consistency."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Establishing a fixed risk priority list that doesn't change regardless of stakeholder input doesn't adapt to the dynamic project environment where priorities change. The correct approach is regularly reassessing risk priorities in light of changing stakeholder needs. Option A creates inflexibility in a dynamic environment.",
    "difficulty": "hard",
    "topics": [
      "changing priorities",
      "adaptive risk management"
    ],
    "process": "monitor-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]