[
  {
    "id": "q-people-5-4-001",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project team recently completed a three-day workshop on a new cloud infrastructure platform essential for the upcoming phase. To immediately assess if the team members acquired the necessary knowledge, which method should the project manager use?",
    "options": [
      { "id": "a", "label": "Monitor the team's velocity over the next two iterations to see if it increases." },
      { "id": "b", "label": "Conduct a survey asking the team how much they enjoyed the workshop instructor." },
      { "id": "c", "label": "Administer a post-training assessment test to verify their understanding of the concepts." },
      { "id": "d", "label": "Wait for the first major deliverable to be completed and analyze the defect density." }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because a post-training assessment (Kirkpatrick Level 2) is the most effective way to immediately measure knowledge acquisition. Option a is incorrect because velocity changes are a lagging indicator of application, not immediate knowledge. Option b is incorrect because it measures reaction/satisfaction, not learning. Option d is incorrect because it delays measurement until after potential risks have materialized.",
    "difficulty": "easy",
    "topics": ["Kirkpatrick Model", "Knowledge Verification"]
  },
  {
    "id": "q-people-5-4-002",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "The project manager arranged for an agile coach to train the team on Test-Driven Development (TDD). Three weeks later, the project manager notices the code quality has not improved and defect rates remain high. What should the project manager have done to prevent this uncertainty?",
    "options": [
      { "id": "a", "label": "Established specific, measurable success criteria for the training outcomes prior to the sessions." },
      { "id": "b", "label": "Requested the agile coach to provide a written guarantee that defect rates would drop immediately." },
      { "id": "c", "label": "Asked the team members to sign a commitment document stating they would use TDD daily." },
      { "id": "d", "label": "Doubled the duration of the training sessions to ensure the team had enough practice time." }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because defining clear metrics (e.g., 'defect rate reduction by 10%') allows for objective measurement of training effectiveness. Option b is incorrect as guarantees are unrealistic in complex behaviors. Option c is incorrect because a signature does not ensure competence or application. Option d is incorrect because longer training does not automatically equate to better outcomes without measurement.",
    "difficulty": "medium",
    "topics": ["Success Criteria", "Training Metrics"]
  },
  {
    "id": "q-people-5-4-003",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager observes that despite attending a conflict resolution seminar, two team members continue to have disruptive arguments during daily standups. What is the most appropriate way to measure the failure of this specific training outcome?",
    "options": [
      { "id": "a", "label": "Check the attendance logs to confirm both members were present for the full seminar duration." },
      { "id": "b", "label": "Review the seminar feedback forms to see if they rated the instructor highly." },
      { "id": "c", "label": "Observe the team's behavioral changes and application of conflict resolution techniques." },
      { "id": "d", "label": "Ask the project sponsor to interview the team members about the seminar content." }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because observation focuses on behavioral application (Kirkpatrick Level 3), which is the intended outcome of conflict resolution training. Option a is incorrect because attendance does not equal competence. Option b is incorrect because satisfaction does not equal behavioral change. Option d is incorrect as it escalates the issue unnecessarily without direct measurement.",
    "difficulty": "medium",
    "topics": ["Behavioral Assessment", "Soft Skills"]
  },
  {
    "id": "q-people-5-4-004",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "Your team has adopted a new automated testing tool. You want to evaluate if the training on this tool was effective in terms of Return on Investment (ROI) for the project. which metric is most relevant?",
    "options": [
      { "id": "a", "label": "The number of team members who passed the certification exam for the tool." },
      { "id": "b", "label": "The reduction in time spent on manual regression testing per sprint." },
      { "id": "c", "label": "The average score the team gave the training session on the satisfaction survey." },
      { "id": "d", "label": "The total number of test cases created by the team in the new tool." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it measures the business impact (Kirkpatrick Level 4) by quantifying time/cost savings, which directly relates to ROI. Option a is incorrect because certification proves knowledge, not ROI. Option c is incorrect because satisfaction is subjective. Option d is incorrect because volume of work does not necessarily indicate efficiency or value.",
    "difficulty": "hard",
    "topics": ["ROI Analysis", "Business Impact"]
  },
  {
    "id": "q-people-5-4-005",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager sends a survey to stakeholders immediately after they complete user acceptance testing (UAT) training. The survey asks, 'Did you find the training relevant to your role?' What level of training measurement is this?",
    "options": [
      { "id": "a", "label": "Reaction." },
      { "id": "b", "label": "Learning." },
      { "id": "c", "label": "Behavior." },
      { "id": "d", "label": "Results." }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because measuring 'Reaction' involves asking participants how they felt about the training and its relevance immediately after the session. Option b is incorrect because 'Learning' measures knowledge increase. Option c is incorrect because 'Behavior' measures application on the job. Option d is incorrect because 'Results' measures organizational impact.",
    "difficulty": "easy",
    "topics": ["Kirkpatrick Model", "Surveys"]
  },
  {
    "id": "q-people-5-4-006",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "The team was trained on a new safety protocol. During a site walk-through a week later, the project manager notices several team members bypassing the new safety checks. What does this indicate about the training outcome?",
    "options": [
      { "id": "a", "label": "The training was effective because the team is working faster by skipping steps." },
      { "id": "b", "label": "The training failed to transfer knowledge into applied behavior." },
      { "id": "c", "label": "The training materials were likely missing the specific safety check section." },
      { "id": "d", "label": "The safety protocol itself is flawed and should be discarded immediately." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because the observation confirms that while training occurred, the desired behavior change (application) did not happen. Option a is incorrect because skipping safety checks is a negative outcome, not an efficiency gain. Option c is an assumption not supported by evidence. Option d is incorrect because non-compliance does not necessarily mean the protocol is flawed.",
    "difficulty": "medium",
    "topics": ["Gap Analysis", "Behavioral Application"]
  },
  {
    "id": "q-people-5-4-007",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager implements a 'Lunch and Learn' series to improve cross-functional knowledge. To measure the effectiveness of this informal training, which approach is most suitable?",
    "options": [
      { "id": "a", "label": "Mandatory formal exams after every lunch session." },
      { "id": "b", "label": "Tracking the number of cross-functional collaborations initiated post-lunch." },
      { "id": "c", "label": "Counting how many slices of pizza were consumed per attendee." },
      { "id": "d", "label": "Reducing the project budget to account for the time lost during lunch." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because tracking collaborations is a relevant, outcome-based metric for cross-functional training. Option a is incorrect because formal exams are often too rigid for informal 'Lunch and Learn' settings. Option c is irrelevant. Option d is incorrect because it focuses on cost reduction rather than training value.",
    "difficulty": "medium",
    "topics": ["Informal Training", "Outcome Measurement"]
  },
  {
    "id": "q-people-5-4-008",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "Following a training session on advanced risk management, the project manager reviews the risk register updates made by the team. The manager notices that the quality of risk response plans has significantly improved. This is an example of measuring training outcomes through:",
    "options": [
      { "id": "a", "label": "Subjective feedback questionnaires." },
      { "id": "b", "label": "Artifact analysis and work performance review." },
      { "id": "c", "label": "Pre-training knowledge assessments." },
      { "id": "d", "label": "Instructor performance evaluations." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because analyzing actual project artifacts (the risk register) to judge quality improvement is a direct measure of applied skill. Option a is incorrect because artifacts are objective evidence, not subjective feedback. Option c is incorrect as this is a post-training review. Option d is incorrect because it evaluates the teacher, not the student's work.",
    "difficulty": "medium",
    "topics": ["Artifact Analysis", "Performance Review"]
  },
  {
    "id": "q-people-5-4-009",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A global project team undertakes cultural sensitivity training. What is the best long-term indicator that this training has achieved its objectives?",
    "options": [
      { "id": "a", "label": "A reduction in communication-related conflicts and misunderstandings in the issue log." },
      { "id": "b", "label": "A 100% completion rate of the online cultural training modules by all staff." },
      { "id": "c", "label": "The team creates a list of holidays for all countries involved in the project." },
      { "id": "d", "label": "The project manager receives a certificate of completion for the team file." }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because a reduction in conflicts is a tangible 'Result' (Level 4) indicating the training positively impacted team dynamics. Option b is incorrect because completion rates measure activity, not effectiveness. Option c is a good output but less indicative of behavioral change than reduced conflict. Option d is incorrect because it is administrative only.",
    "difficulty": "hard",
    "topics": ["Cultural Awareness", "Lagging Indicators"]
  },
  {
    "id": "q-people-5-4-010",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager notices that a team member is struggling with a specific technical task despite completing a certification course for it. What is the first step the project manager should take to assess the situation?",
    "options": [
      { "id": "a", "label": "Immediately enroll the team member in a different, more expensive course." },
      { "id": "b", "label": "Pair the member with a senior peer to observe and identify the specific knowledge gap." },
      { "id": "c", "label": "Remove the team member from the project to prevent further delays." },
      { "id": "d", "label": "Ask the training provider to refund the cost of the certification." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because observation (pairing) helps diagnosis whether the issue is a lack of knowledge, lack of confidence, or a different barrier to application. Option a is incorrect because retraining without diagnosis is wasteful. Option c is incorrect as it is a punitive reaction rather than a supportive assessment. Option d is incorrect and unlikely to resolve the immediate project issue.",
    "difficulty": "medium",
    "topics": ["Gap Diagnosis", "Mentoring"]
  },
  {
    "id": "q-people-5-4-011",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "The project team participates in a workshop to learn a new project management software. The project manager wants to ensure the training investment was worthwhile. Which data point provides the strongest evidence of 'Learning' (Kirkpatrick Level 2)?",
    "options": [
      { "id": "a", "label": "Participants rated the workshop venue and lunch very highly." },
      { "id": "b", "label": "Participants successfully completed a simulation exercise during the workshop." },
      { "id": "c", "label": "The software license costs were within the project budget." },
      { "id": "d", "label": "The team expressed excitement about using the new software." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because successfully completing a simulation demonstrates that the participants absorbed the skills (Learning). Option a is incorrect (Reaction). Option c is irrelevant to learning outcomes. Option d is incorrect (Reaction).",
    "difficulty": "easy",
    "topics": ["Kirkpatrick Level 2", "Simulations"]
  },
  {
    "id": "q-people-5-4-012",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project team receives training on regulatory compliance. Six months later, an external audit finds zero non-compliance issues. This audit report serves as:",
    "options": [
      { "id": "a", "label": "A formative assessment of the training instructor." },
      { "id": "b", "label": "A subjective measurement of team morale." },
      { "id": "c", "label": "An objective measurement of the training's organizational impact." },
      { "id": "d", "label": "A justification for increasing the training budget next year." }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because an external audit provides objective, results-oriented data confirming the training achieved its compliance goals. Option a is incorrect because formative assessments happen *during* learning. Option b is incorrect because audits are objective, not subjective. Option d is a potential outcome of the data, not the measurement type itself.",
    "difficulty": "medium",
    "topics": ["Compliance", "Objective Measurement"]
  },
  {
    "id": "q-people-5-4-013",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "You have assigned a junior developer to shadow a senior architect as a form of on-the-job training. How can you best measure if this training is effective?",
    "options": [
      { "id": "a", "label": "Ask the senior architect to write a performance review for the junior developer." },
      { "id": "b", "label": "Monitor if the junior developer can eventually perform the architect's tasks independently." },
      { "id": "c", "label": "Check if the junior developer arrives at the office at the same time as the architect." },
      { "id": "d", "label": "Review the junior developer's timesheet to ensure shadowing hours are logged." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because the goal of shadowing is knowledge transfer leading to autonomy; capability is the best measure. Option a is incorrect because it relies on opinion rather than observable output. Option c is incorrect because attendance doesn't equal skill. Option d is incorrect because it tracks effort, not outcome.",
    "difficulty": "medium",
    "topics": ["On-the-Job Training", "Skill Transfer"]
  },
  {
    "id": "q-people-5-4-014",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "The project sponsor is skeptical about the value of the recent Agile transformation training. Which metric should the project manager present to demonstrate the training's value?",
    "options": [
      { "id": "a", "label": "The number of PowerPoint slides covered during the training sessions." },
      { "id": "b", "label": "The increase in the team's velocity stability and predictability over the last three sprints." },
      { "id": "c", "label": "The list of team members who attended the training sessions." },
      { "id": "d", "label": "The cost savings achieved by holding the training online instead of in-person." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because stable velocity and predictability are key performance indicators (KPIs) of a healthy Agile team, demonstrating the training worked. Option a is irrelevant. Option c tracks attendance, not value. Option d tracks training cost, not training value/effectiveness.",
    "difficulty": "medium",
    "topics": ["Agile Metrics", "Value Demonstration"]
  },
  {
    "id": "q-people-5-4-015",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A team member claims to be proficient in a new programming language after self-study, but their code reviews consistently show basic syntax errors. What should the project manager do?",
    "options": [
      { "id": "a", "label": "Accept the errors as part of the learning curve and do nothing." },
      { "id": "b", "label": "Validate the training outcome by assigning a small, non-critical test task to verify proficiency." },
      { "id": "c", "label": "Immediately hire an external consultant to replace the team member." },
      { "id": "d", "label": "Publicly reprimand the team member for lying about their skills." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because validating the skill gap through a safe, low-risk task helps objectively assess the training outcome and determine next steps. Option a is incorrect because consistent basic errors indicate a failure of training, not just a learning curve. Option c is an extreme reaction. Option d is unprofessional and damages morale.",
    "difficulty": "hard",
    "topics": ["Self-Assessment Verification", "Performance Management"]
  },
  {
    "id": "q-people-5-4-016",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "After a negotiation skills workshop, the project manager observes that the procurement team is still accepting the first offer from vendors without countering. This observation suggests a failure in which area?",
    "options": [
      { "id": "a", "label": "Training content delivery (the instructor spoke too softly)." },
      { "id": "b", "label": "Transfer of training (applying learned skills to the job)." },
      { "id": "c", "label": "Trainee selection (the wrong people were trained)." },
      { "id": "d", "label": "Training scheduling (the session was too early in the morning)." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because 'Transfer of Training' refers to the ability to apply what was learned in the classroom to actual work situations. Option a, c, and d are possible root causes, but the observation specifically identifies the lack of application (transfer).",
    "difficulty": "medium",
    "topics": ["Transfer of Training", "Application Gap"]
  },
  {
    "id": "q-people-5-4-017",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager uses a 'pre-test' and 'post-test' model for a technical workshop. The average score improved from 40% to 85%. However, the project sponsor is unhappy because project defects have not decreased. What is the likely disconnect?",
    "options": [
      { "id": "a", "label": "The pre-test was too difficult, making the improvement look larger than it is." },
      { "id": "b", "label": "The training successfully increased knowledge, but that knowledge is not being applied to reduce defects." },
      { "id": "c", "label": "The post-test answers were leaked to the team before the workshop." },
      { "id": "d", "label": "The project sponsor has unrealistic expectations for training outcomes." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. It highlights the difference between acquiring knowledge (test scores) and applying it (results/behavior). The metric shows learning happened, but the business result is missing. Option a and c are speculative scenarios. Option d dismisses the valid business concern of the sponsor.",
    "difficulty": "hard",
    "topics": ["Learning vs Application", "Metric Discrepancy"]
  },
  {
    "id": "q-people-5-4-018",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "To validate the effectiveness of communication training for virtual teams, the project manager analyzes the team's meeting minutes and chat logs. What specific indicator would best demonstrate improvement?",
    "options": [
      { "id": "a", "label": "An increase in the total word count of the meeting minutes." },
      { "id": "b", "label": "A decrease in the number of requests for clarification or re-explanation of tasks." },
      { "id": "c", "label": "A higher frequency of emoji usage in the team chat channels." },
      { "id": "d", "label": "Faster typing speeds recorded during the chat sessions." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because fewer requests for clarification suggest that initial communication is clearer and more effective. Option a is incorrect; length does not equal quality. Option c and d are irrelevant to communication clarity.",
    "difficulty": "medium",
    "topics": ["Virtual Teams", "Communication Metrics"]
  },
  {
    "id": "q-people-5-4-019",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager is using an iterative approach. After a training spike in Sprint 2, the team commits to measuring the training outcome in Sprint 3. Which activity in Sprint 3 best serves this purpose?",
    "options": [
      { "id": "a", "label": "Allocating story points to a 'Training Review' user story." },
      { "id": "b", "label": "Reviewing the Sprint Retrospective feedback to see if the new skills aided the sprint goal." },
      { "id": "c", "label": "Repeating the exact same training spike to reinforce the learning." },
      { "id": "d", "label": "Stopping all development work to take a written exam." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because the Sprint Retrospective is the agile ceremony designed to inspect and adapt, making it the perfect place to discuss if the training (process improvement) helped the team. Option a is administrative. Option c is wasteful if the first one worked. Option d disrupts the flow of value delivery.",
    "difficulty": "medium",
    "topics": ["Agile Ceremonies", "Retrospectives"]
  },
  {
    "id": "q-people-5-4-020",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "The project team was trained on a new Customer Relationship Management (CRM) system. The project manager tracks 'Time to Resolve Ticket' before and after training. The time increases after training. What is the most reasonable initial interpretation?",
    "options": [
      { "id": "a", "label": "The training was a complete failure and the old system should be reinstated." },
      { "id": "b", "label": "This is a temporary 'learning dip' as the team gets used to the new navigation and features." },
      { "id": "c", "label": "The team is intentionally sabotaging the new system." },
      { "id": "d", "label": "The metrics were calculated incorrectly by the data analyst." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. It is common for performance to dip temporarily immediately after training as users acclimate to new tools (the J-curve of learning). Option a is a knee-jerk reaction. Option c assumes malice without evidence. Option d assumes error without evidence.",
    "difficulty": "medium",
    "topics": ["Learning Curve", "Performance Data Interpretation"]
  },
  {
    "id": "q-people-5-4-021",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A stakeholder complains that the project team lacks the necessary presentation skills. The project manager organizes a workshop. How should the project manager baseline the current skill level before measuring the outcome?",
    "options": [
      { "id": "a", "label": "Assume the stakeholder is correct and skip the baseline assessment." },
      { "id": "b", "label": "Record a mock presentation by team members prior to the workshop to compare with one delivered after." },
      { "id": "c", "label": "Ask the team members to rate their own presentation skills on a scale of 1 to 10." },
      { "id": "d", "label": "Use the average presentation scores from a different department as a baseline." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because a 'pre-training' observation provides a tangible baseline against which to measure post-training improvement. Option a provides no data for measurement. Option c is subjective (Dunning-Kruger effect risk). Option d uses irrelevant data.",
    "difficulty": "hard",
    "topics": ["Baselining", "Skill Assessment"]
  },
  {
    "id": "q-people-5-4-022",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "Which of the following is an example of a qualitative measurement of training effectiveness?",
    "options": [
      { "id": "a", "label": "Test scores improved by 15%." },
      { "id": "b", "label": "Ticket resolution time decreased by 2 hours." },
      { "id": "c", "label": "Team confidence in handling complex tasks noticeably improved during discussions." },
      { "id": "d", "label": "100% of team members attended the session." }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because 'confidence' and 'noticeable improvement' are qualitative, descriptive observations. Options a, b, and d are quantitative (numerical) measurements.",
    "difficulty": "easy",
    "topics": ["Qualitative vs Quantitative", "Measurement Types"]
  },
  {
    "id": "q-people-5-4-023",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A project manager utilizes gamification for training, awarding badges for mastering specific skills. How does this assist in measuring training outcomes?",
    "options": [
      { "id": "a", "label": "It makes the training fun, which is the only metric that matters." },
      { "id": "b", "label": "It provides immediate, visible confirmation (badges) that specific milestones/competencies have been met." },
      { "id": "c", "label": "It increases the cost of training, showing high investment value." },
      { "id": "d", "label": "It replaces the need for the project manager to ever talk to the team about skills." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because the badges serve as a proxy for competency verification, allowing for easy tracking of who has mastered what. Option a is incorrect; fun is not the only metric. Option c is incorrect. Option d is incorrect because automation doesn't replace management.",
    "difficulty": "medium",
    "topics": ["Gamification", "Competency Tracking"]
  },
  {
    "id": "q-people-5-4-024",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "During a project review, the PMO director asks for evidence that the 'Effective Leadership' training given to team leads was successful. Which data set is most compelling?",
    "options": [
      { "id": "a", "label": "The syllabus of the leadership course." },
      { "id": "b", "label": "Employee retention rates and engagement survey scores for the teams managed by those leads." },
      { "id": "c", "label": "The invoice showing the training was paid for." },
      { "id": "d", "label": "A quote from the trainer saying the group was 'very engaged'." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. Leadership training aims to improve team management; retention and engagement scores are direct result metrics (Level 4) of good leadership. Options a, c, and d do not prove effectiveness or outcome.",
    "difficulty": "hard",
    "topics": ["Leadership Metrics", "PMO Reporting"]
  },
  {
    "id": "q-people-5-4-025",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": ["e-people-5-4"],
    "text": "A vendor provides training on a critical project component. The contract states payment is contingent on 'successful training delivery'. To authorize payment, the project manager should:",
    "options": [
      { "id": "a", "label": "Sign the check as soon as the vendor arrives on site." },
      { "id": "b", "label": "Review the defined acceptance criteria for the training (e.g., pass rates, feedback scores) to ensure they were met." },
      { "id": "c", "label": "Ask the vendor if they felt they did a good job." },
      { "id": "d", "label": "Wait one year to see if the project succeeds." }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct. For contractual training, success must be measured against pre-defined acceptance criteria. Option a is reckless. Option c is subjective and biased. Option d takes too long for a payment cycle.",
    "difficulty": "medium",
    "topics": ["Procurement", "Acceptance Criteria"]
  }
]