[
  {
    "id": "q-people-5-3-001",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager has identified a skills gap that requires external training. The training cost exceeds the current allocated training budget, but the management reserve is intact. What should the project manager do first?",
    "options": [
      {
        "id": "a",
        "label": "Immediately use the management reserve to cover the excess cost."
      },
      {
        "id": "b",
        "label": "Submit a change request to increase the budget to cover the training costs."
      },
      {
        "id": "c",
        "label": "Cancel the training and ask the team to self-study using free resources."
      },
      {
        "id": "d",
        "label": "Reduce the project scope to free up funds for the training session."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because budget overruns require a formal change request to be approved before funds are reallocated, especially when exceeding the baseline. Option a is incorrect because management reserves are typically controlled by the sponsor or management, not unilaterally by the PM, and require approval. Option c is incorrect because it ignores the identified critical need. Option d is incorrect because scope reduction is a last resort.",
    "difficulty": "medium",
    "topics": [
      "budget management",
      "change control"
    ]
  },
  {
    "id": "q-people-5-3-002",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "An agile team identifies a need for training on a new testing framework during a retrospective. How should the project manager allocate resources for this training in the upcoming Sprint?",
    "options": [
      {
        "id": "a",
        "label": "Add the training as a non-functional requirement and estimate it as part of the Sprint Backlog."
      },
      {
        "id": "b",
        "label": "Ask the team to complete the training on weekends so velocity remains constant."
      },
      {
        "id": "c",
        "label": "Schedule the training for the 'hardening sprint' at the end of the release."
      },
      {
        "id": "d",
        "label": "Ignore the request until the Product Owner explicitly prioritizes it over features."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because in Agile, training and learning activities (spikes or enablers) should be visualized and estimated in the backlog to account for capacity. Option b is incorrect because it promotes sustainable pace violations. Option c is incorrect because delaying training delays the value it brings. Option d is incorrect because the team knows \"how\" to do the work, and the PM should support their needs.",
    "difficulty": "medium",
    "topics": [
      "agile estimation",
      "capacity planning"
    ]
  },
  {
    "id": "q-people-5-3-003",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project involves a critical compliance update. The only available training facility is booked for the next month, which will delay the project schedule. What is the best resource allocation strategy?",
    "options": [
      {
        "id": "a",
        "label": "Accept the delay and update the project schedule to reflect the new date."
      },
      {
        "id": "b",
        "label": "Evaluate the cost of renting an external facility against the cost of the schedule delay."
      },
      {
        "id": "c",
        "label": "Cancel the training and ask the compliance officer to send an email summary."
      },
      {
        "id": "d",
        "label": "Demand that the other group booking the room vacate it for this critical project."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because the project manager must perform a cost-benefit analysis to determine if paying for an external resource (facility) is worth saving the schedule slippage. Option a is incorrect because it accepts a delay without exploring alternatives. Option c is incorrect because compliance training is usually mandatory. Option d is incorrect and unprofessional.",
    "difficulty": "medium",
    "topics": [
      "logistics",
      "cost-benefit analysis"
    ]
  },
  {
    "id": "q-people-5-3-004",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "The project sponsor questions the high cost of a proposed training program for the team. The project manager needs to justify this resource allocation. What is the most persuasive argument?",
    "options": [
      {
        "id": "a",
        "label": "Argue that the team deserves a break and a morale booster."
      },
      {
        "id": "b",
        "label": "Explain that the training budget was already approved in the charter."
      },
      {
        "id": "c",
        "label": "Demonstrate how the training reduces project risk and increases efficiency (ROI)."
      },
      {
        "id": "d",
        "label": "State that the project cannot proceed without this specific vendor."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because sponsors respond best to business value justifications, such as ROI (Return on Investment) or risk reduction. Option a is incorrect because training is not a vacation. Option b is incorrect because budgets can be challenged even if approved. Option d is incorrect because it sounds like an ultimatum rather than a justification.",
    "difficulty": "medium",
    "topics": [
      "negotiation",
      "ROI"
    ]
  },
  {
    "id": "q-people-5-3-005",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager is creating the schedule. Several team members need a three-day certification course to operate new machinery. This activity is on the critical path. How should this be handled?",
    "options": [
      {
        "id": "a",
        "label": "Schedule the training to occur in parallel with the machinery installation."
      },
      {
        "id": "b",
        "label": "Ask the team to take the course during their planned vacation time."
      },
      {
        "id": "c",
        "label": "Allocate resource calendars to show unavailability during the training days."
      },
      {
        "id": "d",
        "label": "Remove the training from the schedule to shorten the critical path."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because the schedule must accurately reflect resource availability; if they are in training, they are unavailable for project work. Option a is incorrect because they cannot be in two places at once (operating machinery while learning to operate it). Option b is incorrect because it violates labor standards. Option d is incorrect because it creates a false schedule.",
    "difficulty": "medium",
    "topics": [
      "scheduling",
      "resource calendars"
    ]
  },
  {
    "id": "q-people-5-3-006",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "The project budget has been cut by 15%. The training line item is a target for reduction. The project manager believes the training is essential for quality. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Cut the training entirely and hope the team learns on the job."
      },
      {
        "id": "b",
        "label": "Hide the training costs under the 'hardware procurement' budget line."
      },
      {
        "id": "c",
        "label": "Look for lower-cost alternatives like internal mentoring or virtual sessions."
      },
      {
        "id": "d",
        "label": "Refuse to continue the project until the full budget is restored."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because the project manager should try to achieve the training objectives through more efficient resource allocation before giving up. Option a is incorrect because it risks quality. Option b is incorrect because it is unethical. Option d is incorrect because it is an adversarial reaction to a common business constraint.",
    "difficulty": "medium",
    "topics": [
      "budget cuts",
      "efficiency"
    ]
  },
  {
    "id": "q-people-5-3-007",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project team consists of contractors billed by the hour. They need training on internal security protocols. The finance department refuses to pay for 'non-productive' training hours. What is the project manager's best response?",
    "options": [
      {
        "id": "a",
        "label": "Skip the security training and restrict the contractors' access levels."
      },
      {
        "id": "b",
        "label": "Negotiate with the staffing agency to include training time in their overhead."
      },
      {
        "id": "c",
        "label": "Ask the contractors to do the training 'off the clock' (unpaid)."
      },
      {
        "id": "d",
        "label": "Falsify the timesheets to make the training look like development work."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because procurement negotiations can often resolve resource allocation disputes regarding billable hours. Option a is incorrect because it hampers the contractors' utility. Option c is incorrect because it may be illegal or breach contract terms. Option d is incorrect because it is unethical.",
    "difficulty": "hard",
    "topics": [
      "procurement",
      "contractor management"
    ]
  },
  {
    "id": "q-people-5-3-008",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A key stakeholder requires training to use the final product deliverables. The project is running late, and the team is fully utilized on development. How should the project manager allocate resources for this stakeholder training?",
    "options": [
      {
        "id": "a",
        "label": "Pull a developer off the critical path to conduct the training immediately."
      },
      {
        "id": "b",
        "label": "Allocate a business analyst or technical writer to create a self-service user guide."
      },
      {
        "id": "c",
        "label": "Tell the stakeholder they must figure it out themselves due to the delays."
      },
      {
        "id": "d",
        "label": "Hire an expensive external training firm without checking the budget."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it uses a resource not on the critical development path (or less critical) to create a scalable solution (guide) that satisfies the need. Option a is incorrect because it further delays the project. Option c is incorrect because it damages stakeholder satisfaction. Option d is incorrect because it ignores budget governance.",
    "difficulty": "medium",
    "topics": [
      "resource leveling",
      "stakeholder support"
    ]
  },
  {
    "id": "q-people-5-3-009",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "During the execution phase, a new software tool is introduced. The vendor offers five free licenses for training. The team has ten members. How should the project manager allocate these limited resources?",
    "options": [
      {
        "id": "a",
        "label": "Randomly assign the five licenses to ensure fairness."
      },
      {
        "id": "b",
        "label": "Assign licenses to five 'power users' who will then train the rest of the team."
      },
      {
        "id": "c",
        "label": "Reject the free licenses and buy ten full licenses immediately."
      },
      {
        "id": "d",
        "label": "Split the team into two groups and have them share login credentials."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because using a 'Train the Trainer' approach optimizes limited resources. Option a is incorrect because random assignment doesn't ensure the right people learn. Option c is incorrect because it wastes a cost-saving opportunity. Option d is incorrect because sharing credentials often violates security policies and license agreements.",
    "difficulty": "easy",
    "topics": [
      "resource optimization",
      "train the trainer"
    ]
  },
  {
    "id": "q-people-5-3-010",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager is planning a global project. The training budget includes travel expenses for a face-to-face workshop. Due to a sudden health crisis, travel is banned. How should the resources be reallocated?",
    "options": [
      {
        "id": "a",
        "label": "Return the travel funds to the sponsor and cancel the training."
      },
      {
        "id": "b",
        "label": "Delay the project indefinitely until the travel ban is lifted."
      },
      {
        "id": "c",
        "label": "Reallocate the travel budget to invest in high-quality virtual collaboration tools and training."
      },
      {
        "id": "d",
        "label": "proceed with the workshop but ask attendees to travel at their own risk."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it adapts to the constraint by shifting resources from travel to virtual enablement, ensuring the training still happens. Option a is incorrect because the training need still exists. Option b is incorrect because indefinite delays are rarely acceptable. Option d is incorrect because it endangers the team.",
    "difficulty": "medium",
    "topics": [
      "risk response",
      "budget reallocation"
    ]
  },
  {
    "id": "q-people-5-3-011",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A team member requests an expensive certification that is only tangentially related to the current project but valuable for their career. The training budget is tight. What is the best course of action?",
    "options": [
      {
        "id": "a",
        "label": "Approve the request to keep the team member motivated and happy."
      },
      {
        "id": "b",
        "label": "Deny the request as it does not directly benefit the current project's objectives."
      },
      {
        "id": "c",
        "label": "Use the project contingency reserve to pay for the certification."
      },
      {
        "id": "d",
        "label": "Ask the team member to pay for it, then reimburse them if the budget allows later."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because project resources must be allocated to activities that benefit the project. Career development is usually an operational/departmental expense, not a project expense. Option a is incorrect because it misuses project funds. Option c is incorrect because contingency is for risks, not perks. Option d is incorrect because it makes a promise the PM might not keep.",
    "difficulty": "medium",
    "topics": [
      "budget discipline",
      "justification"
    ]
  },
  {
    "id": "q-people-5-3-012",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager manages a cross-functional team. The engineering lead refuses to release their staff for a required two-day project management workshop, citing a tight deadline. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Cancel the workshop for the engineers and train only the other departments."
      },
      {
        "id": "b",
        "label": "Escalate the issue to the project sponsor immediately."
      },
      {
        "id": "c",
        "label": "Negotiate with the lead to break the workshop into shorter modules spread over weeks."
      },
      {
        "id": "d",
        "label": "Force the engineers to attend by citing the project charter authority."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because it addresses the resource conflict (time) through negotiation and flexible scheduling. Option a is incorrect because it leaves a skill gap. Option b is incorrect because the PM should try to solve the problem before escalating. Option d is incorrect because it damages relationships and may not work in a matrix organization.",
    "difficulty": "medium",
    "topics": [
      "negotiation",
      "conflict resolution"
    ]
  },
  {
    "id": "q-people-5-3-013",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project is using a hybrid approach. The predictive component has a fixed budget for training, which is fully spent. The agile component has identified a new critical training need. How can the project manager resolve this?",
    "options": [
      {
        "id": "a",
        "label": "Wait until the next fiscal year to request more money."
      },
      {
        "id": "b",
        "label": "Transfer funds from the quality assurance budget to training."
      },
      {
        "id": "c",
        "label": "Review the agile backlog to reprioritize features and free up capacity/budget."
      },
      {
        "id": "d",
        "label": "Borrow training materials from a competitor."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because in agile, scope is flexible; reprioritizing the backlog allows the team to allocate time/budget to the enabler (training) by potentially dropping low-value features. Option a is incorrect because it delays the project. Option b is incorrect because it sacrifices quality. Option d is incorrect because it is unethical/illegal.",
    "difficulty": "hard",
    "topics": [
      "agile budget",
      "reprioritization"
    ]
  },
  {
    "id": "q-people-5-3-014",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "An external vendor has been hired to train the team. One week before the session, the vendor doubles their fee. The project cannot afford the increase. What is the immediate next step?",
    "options": [
      {
        "id": "a",
        "label": "Check the signed contract for price protection clauses and cancellation terms."
      },
      {
        "id": "b",
        "label": "Immediately pay the new fee to avoid delaying the training."
      },
      {
        "id": "c",
        "label": "Cancel the project entirely due to vendor unreliability."
      },
      {
        "id": "d",
        "label": "S sue the vendor for breach of trust."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because the first step in a procurement dispute is to verify the legal agreement (contract). Option b is incorrect because it accepts a cost overrun without due diligence. Option c is incorrect because it is a severe overreaction. Option d is incorrect because legal action is a last resort after contract review.",
    "difficulty": "medium",
    "topics": [
      "procurement",
      "contracts"
    ]
  },
  {
    "id": "q-people-5-3-015",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "The project team is dispersed across three continents. The project manager needs to allocate resources for a 'Kick-off and Training' event. Bringing everyone to one location consumes 40% of the total project budget. What is the best approach?",
    "options": [
      {
        "id": "a",
        "label": "Proceed with the in-person event as face-to-face interaction is priceless."
      },
      {
        "id": "b",
        "label": "Hold three separate regional training events led by local leads to reduce travel costs."
      },
      {
        "id": "c",
        "label": "Cancel the kick-off and just send an email with the training slides."
      },
      {
        "id": "d",
        "label": "Ask the team members to pay for their own flights."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because it balances the need for interaction with budget responsibility by regionalizing the training. Option a is incorrect because spending 40% of the budget on one event is irresponsible. Option c is incorrect because it removes the value of the kick-off. Option d is incorrect and unprofessional.",
    "difficulty": "medium",
    "topics": [
      "budget constraints",
      "global teams"
    ]
  },
  {
    "id": "q-people-5-3-016",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager realizes that no budget was allocated for 'End User Training' in the initial planning, but it is required for project acceptance. The project is midway through execution. What should be done?",
    "options": [
      {
        "id": "a",
        "label": "Use the contingency reserve to fund the training without telling anyone."
      },
      {
        "id": "b",
        "label": "Inform the sponsor of the oversight and submit a formal change request for funds."
      },
      {
        "id": "c",
        "label": "Cut the testing phase short to save money for the training."
      },
      {
        "id": "d",
        "label": "Deliver the product without training and let operations handle it."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because missing scope/budget requires transparency and a formal change management process. Option a is incorrect because contingency is for risks, not planning errors, and transparency is required. Option c is incorrect because it endangers quality. Option d is incorrect because it likely leads to project rejection.",
    "difficulty": "easy",
    "topics": [
      "change management",
      "transparency"
    ]
  },
  {
    "id": "q-people-5-3-017",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A highly technical team needs training on a new AI tool. There is a government grant available that covers 80% of training costs for AI technologies. How should the project manager proceed?",
    "options": [
      {
        "id": "a",
        "label": "Ignore the grant because the paperwork will take too much time."
      },
      {
        "id": "b",
        "label": "Allocate resources to apply for the grant to maximize the project's budget efficiency."
      },
      {
        "id": "c",
        "label": "Apply for the grant but keep the original budget to use as profit."
      },
      {
        "id": "d",
        "label": "Ask the government to manage the training directly."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because a project manager should seek to optimize resource use; utilizing grants frees up budget for other project risks or needs. Option a is incorrect because it is lazy resource management. Option c is incorrect because it borders on fraud or misappropriation. Option d is incorrect because the government provides funds, not management.",
    "difficulty": "medium",
    "topics": [
      "resource optimization",
      "funding"
    ]
  },
  {
    "id": "q-people-5-3-018",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager is allocating resources for a two-week training block. The functional manager argues that pulling the entire team for two weeks will halt other operational work. What is the best compromise?",
    "options": [
      {
        "id": "a",
        "label": "Split the team into two cohorts and stagger the training schedule."
      },
      {
        "id": "b",
        "label": "Cancel the training to appease the functional manager."
      },
      {
        "id": "c",
        "label": "Ignore the functional manager since the project is the priority."
      },
      {
        "id": "d",
        "label": "Shorten the training to one day to minimize impact."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because staggering the training ensures the project team gets trained while maintaining some operational capacity. Option b is incorrect because the training is needed. Option c is incorrect because it damages the relationship and ignores organizational needs. Option d is incorrect because it compromises the learning outcome.",
    "difficulty": "medium",
    "topics": [
      "resource smoothing",
      "stakeholder negotiation"
    ]
  },
  {
    "id": "q-people-5-3-019",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "The project team identifies a need for a specific software license to practice a new skill. The procurement process for new software takes 60 days, but the training is next week. What is the best interim resource allocation?",
    "options": [
      {
        "id": "a",
        "label": "Delay the training by 60 days."
      },
      {
        "id": "b",
        "label": "Allocate funds to purchase a temporary monthly subscription on a corporate credit card."
      },
      {
        "id": "c",
        "label": "Download a pirated version of the software for temporary use."
      },
      {
        "id": "d",
        "label": "Conduct the training without the software and hope they understand the theory."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because using a temporary procurement vehicle (like a P-card for low-cost items) solves the timing mismatch without violating policy (assuming P-card use is allowed). Option a is incorrect because it delays progress. Option c is incorrect because it is illegal. Option d is incorrect because practice is required.",
    "difficulty": "medium",
    "topics": [
      "procurement",
      "workarounds"
    ]
  },
  {
    "id": "q-people-5-3-020",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager has allocated budget for a specific vendor training. A team member suggests a different, cheaper online course that covers the same material. What should the project manager do?",
    "options": [
      {
        "id": "a",
        "label": "Stick to the original plan because the budget is already allocated."
      },
      {
        "id": "b",
        "label": "Review the learning objectives of the cheaper course to ensure it meets quality standards."
      },
      {
        "id": "c",
        "label": "Immediately switch to the cheaper course and declare the savings."
      },
      {
        "id": "d",
        "label": "Allow the team member to take the cheaper course while the others take the expensive one."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because cost is not the only factor; the PM must verify quality and scope alignment before reallocating resources. Option a is incorrect because it ignores potential efficiency. Option c is incorrect because it acts without verifying quality. Option d is incorrect because it creates inconsistent knowledge.",
    "difficulty": "medium",
    "topics": [
      "quality assurance",
      "cost management"
    ]
  },
  {
    "id": "q-people-5-3-021",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "An agile team decides to perform 'Mob Programming' (the whole team working on one thing) to train junior members. The product owner is concerned that velocity will drop to zero. How should the project manager explain this resource allocation?",
    "options": [
      {
        "id": "a",
        "label": "Admit that velocity will result in zero deliverables for the sprint."
      },
      {
        "id": "b",
        "label": "Explain that this is an investment in capacity that will increase future velocity and quality."
      },
      {
        "id": "c",
        "label": "Promise the product owner that the team will work overtime to make up for it."
      },
      {
        "id": "d",
        "label": "Tell the team to stop Mob Programming immediately."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because allocating resources (time) to upskilling often causes a temporary dip in output for a long-term gain in speed and quality. Option a is incorrect because Mob Programming still produces code, just differently. Option c is incorrect because overtime is not a sustainable Agile practice. Option d is incorrect because it blocks the team's self-organization.",
    "difficulty": "hard",
    "topics": [
      "agile mindset",
      "resource justification"
    ]
  },
  {
    "id": "q-people-5-3-022",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager needs to schedule a training room. The only room available has no projector or internet access. Renting equipment will put the training over budget. What is the most creative resource allocation solution?",
    "options": [
      {
        "id": "a",
        "label": "Conduct the training without visuals or internet."
      },
      {
        "id": "b",
        "label": "Cancel the room and hold the training in the office cafeteria during lunch."
      },
      {
        "id": "c",
        "label": "Borrow portable equipment from another department or project."
      },
      {
        "id": "d",
        "label": "Submit a change request for more money."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because leveraging cross-departmental resources (borrowing) is a zero-cost solution to a resource constraint. Option a is incorrect because it degrades training quality. Option b is incorrect because the cafeteria is noisy and unprofessional. Option d is incorrect if a simpler solution exists.",
    "difficulty": "easy",
    "topics": [
      "resource sharing",
      "problem solving"
    ]
  },
  {
    "id": "q-people-5-3-023",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "The team needs training on a legacy system. No external vendors teach it anymore. There is one retired employee who knows the system. How should the project manager allocate resources?",
    "options": [
      {
        "id": "a",
        "label": "Force the current team to guess how the system works."
      },
      {
        "id": "b",
        "label": "Hire the retired employee as a short-term consultant to conduct the training."
      },
      {
        "id": "c",
        "label": "Replace the legacy system immediately to avoid the training need."
      },
      {
        "id": "d",
        "label": "Assign a junior developer to read the source code for six months."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because allocating budget to hire a specific Subject Matter Expert (SME) is the most effective way to transfer niche knowledge. Option a is incorrect because it risks system failure. Option c is incorrect because system replacement is a massive scope change. Option d is incorrect because it is inefficient and high risk.",
    "difficulty": "medium",
    "topics": [
      "hiring",
      "niche skills"
    ]
  },
  {
    "id": "q-people-5-3-024",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "A project manager observes that the team is exhausted and training sessions scheduled for Friday afternoons have low attendance and retention. How should the scheduling resources be adjusted?",
    "options": [
      {
        "id": "a",
        "label": "Make attendance mandatory with penalties for missing it."
      },
      {
        "id": "b",
        "label": "Move the training to Tuesday mornings when energy levels are higher."
      },
      {
        "id": "c",
        "label": "Cancel the training since the team is too tired."
      },
      {
        "id": "d",
        "label": "Shorten the training to 15 minutes."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because allocating time slots effectively requires understanding human factors; moving training to a high-energy time maximizes the value of the resource (time). Option a is incorrect because it lowers morale. Option c is incorrect because the need remains. Option d is incorrect if the content requires more time.",
    "difficulty": "easy",
    "topics": [
      "scheduling",
      "human factors"
    ]
  },
  {
    "id": "q-people-5-3-025",
    "domainId": "people",
    "taskId": "people-5",
    "enablerIds": [
      "e-people-5-3"
    ],
    "text": "The project uses a 'fixed price' contract with a vendor. The vendor is underperforming due to a lack of skills. The contract does not mention training. The project manager wants to use project funds to train the vendor's staff. Is this appropriate?",
    "options": [
      {
        "id": "a",
        "label": "Yes, if it saves the project, the PM should pay for it immediately."
      },
      {
        "id": "b",
        "label": "No, under a fixed price contract, the vendor is responsible for their own competency."
      },
      {
        "id": "c",
        "label": "Yes, but the vendor must repay the project later."
      },
      {
        "id": "d",
        "label": "No, the PM should fire the vendor immediately."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because in a fixed-price contract, the risk and cost of performance (including skills) lie with the seller. Allocating project funds to train a vendor violates the contract nature unless a change order is processed. Option a is incorrect because it subsidizes the vendor. Option c is incorrect because it complicates the contract. Option d is incorrect because termination has legal implications to be reviewed first.",
    "difficulty": "hard",
    "topics": [
      "contracts",
      "fixed price"
    ]
  }
]
