[
  {
    "id": "q-people-7-1-001",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "During a daily standup, a technical team member mentions they are waiting for a critical security sign-off from an external department, causing a delay that impacts the next five planned user stories. What is the project manager's most appropriate *first* step to determine the severity and nature of this obstacle?",
    "options": [
      {
        "id": "a",
        "label": "Document the dependency in the risk register and immediately schedule a meeting with the external department's manager to escalate the lack of response."
      },
      {
        "id": "c",
        "label": "Ask the team member for a clear definition of the sign-off criteria and the specific consequence of not having it, then seek other temporary workarounds."
      },
      {
        "id": "b",
        "label": "Instruct the team to focus on non-impacted tasks until the sign-off is received, ensuring they update their individual task statuses in the project tracking tool."
      },
      {
        "id": "d",
        "label": "Assign a dedicated team member to continuously follow up with the external department, prioritizing contact until the required security sign-off is granted."
      }
    ],
    "correctOptionId": "c",
    "explanation": "This choice is correct because the first step in addressing a potential blocker is to clearly define it and understand its impact, which involves asking the team member for details on criteria and consequences. This provides the necessary information to *determine* the criticality. That choice is premature escalation without fully understanding the issue. Those choices are implementation/management steps, not the initial determination step.",
    "difficulty": "medium",
    "topics": [
      "blocker identification",
      "criticality assessment"
    ]
  },
  {
    "id": "q-people-7-1-002",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The agile team is experiencing a steady decrease in velocity over the last three sprints. Team members frequently express frustration about the build environment being unstable, but no single defect report has been filed. Which technique should the project manager use to determine the underlying, chronic impediment?",
    "options": [
      {
        "id": "a",
        "label": "Implement a formal defect tracking system for all build environment issues, enforcing mandatory reporting for every instance before engaging the infrastructure team."
      },
      {
        "id": "c",
        "label": "Facilitate a Fishbone (Ishikawa) Diagram session with the team, focusing the analysis on the 'Build Environment' to uncover root causes and contributing factors."
      },
      {
        "id": "b",
        "label": "Hold one-on-one meetings with each team member to determine who is most affected by the issue, and assign that person to resolve the infrastructure problem."
      },
      {
        "id": "d",
        "label": "Prioritize and re-sequence the backlog to minimize reliance on the unstable build environment, allowing the team to focus on documentation and design tasks."
      }
    ],
    "correctOptionId": "c",
    "explanation": "This choice is correct. The Fishbone Diagram (Root Cause Analysis) is a structured tool for *determining* the root cause of a problem (the chronic impediment) when symptoms (decreased velocity, frustration) are known but the exact cause is not clearly defined or reported. That choice addresses symptoms by tracking defects but doesn't proactively determine the root cause. Those choices are inadequate steps for *determining* the critical underlying issue.",
    "difficulty": "hard",
    "topics": [
      "root cause analysis",
      "impediment determination"
    ]
  },
  {
    "id": "q-people-7-1-003",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "In a hybrid project, the hardware procurement team is consistently late delivering specialized components, threatening to delay the integration phase. The project manager needs to assess the *criticality* of this impediment. Which piece of information is most important for this determination?",
    "options": [
      {
        "id": "a",
        "label": "The historical performance data of the procurement team on past projects in this organization and the reasons for their previous delays."
      },
      {
        "id": "b",
        "label": "The total cost associated with the procurement delay, including late penalties and potential cost overruns for the project as a whole."
      },
      {
        "id": "c",
        "label": "The amount of available slack on the project schedule's critical path that precedes the integration phase requiring the components."
      },
      {
        "id": "d",
        "label": "The team's current mood and level of frustration regarding the procurement delays and their suggestions for alternative component vendors."
      }
    ],
    "correctOptionId": "c",
    "explanation": "This choice is correct. An impediment is *critical* if it impacts the project's critical path. The amount of slack on the preceding path directly determines if the delay will cause a project-level deadline slippage. Those choicesnd d provide context or consequences, but the schedule impact on the critical path is the primary measure of *criticality* in project scheduling.",
    "difficulty": "medium",
    "topics": [
      "critical path analysis",
      "impediment criticality"
    ]
  },
  {
    "id": "q-people-7-1-004",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "A project manager observes that a project's core team members are frequently pulled into urgent operational support meetings by a department head not involved in the project. This interference is causing missed deadlines for key deliverables. What is the project manager's best action to *determine* the impact and classification of this issue?",
    "options": [
      {
        "id": "a",
        "label": "Send a formal memorandum to the department head, requesting they cease pulling team members away, and copy the project sponsor for escalation purposes."
      },
      {
        "id": "b",
        "label": "Update the stakeholder engagement plan to include the department head and clearly document the team's working agreements and time commitments to the project."
      },
      {
        "id": "c",
        "label": "Calculate the total lost person-hours and cost variance due to the interruptions, and present the data to the team to get their agreement on the problem's severity."
      },
      {
        "id": "d",
        "label": "Analyze the pattern of interruptions and their correlation with specific task delays, quantifying the schedule impact to categorize it as a severe impediment."
      }
    ],
    "correctOptionId": "d",
    "explanation": "This choice is correct. To *determine* the issue's impact and classification as a severe impediment, the project manager must quantify the consequences, specifically the **schedule impact** (delays). Calculating lost person-hours (That choice) is part of this but linking it directly to the *deliverable delays* (schedule) is more critical for classifying the impediment. Those choices are actions to resolve or manage the stakeholder, not the *determination* step.",
    "difficulty": "medium",
    "topics": [
      "impediment determination",
      "quantifying impact"
    ]
  },
  {
    "id": "q-people-7-1-005",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project team uses an agile approach and has identified several minor process issues in their recent retrospective, such as slow code reviews and unclear acceptance criteria for certain features. How should the project manager or scrum master determine which of these issues is the *most critical* impediment to address in the next iteration?",
    "options": [
      {
        "id": "c",
        "label": "Apply the Pareto Principle (80/20 rule) to the issues, prioritizing the single issue that is estimated to cause the largest number of defects or delays."
      },
      {
        "id": "b",
        "label": "Use a weighted scoring model with the team, scoring each issue based on its impact, urgency, and the estimated effort required to permanently remove it."
      },
      {
        "id": "a",
        "label": "Assign each issue to a different team member for independent investigation and resolution, relying on the team's collective ownership for problem-solving."
      },
      {
        "id": "d",
        "label": "Conduct an anonymous survey among stakeholders to find out which process issue they perceive as having the greatest negative effect on the final product quality."
      }
    ],
    "correctOptionId": "c",
    "explanation": "This choice is correct. The Pareto Principle (80/20 rule) is a fundamental technique for *determining* the most critical issue by focusing on the 'vital few' problems (the 20%) that cause the majority of the negative effects (the 80%). Those choices are useful for prioritization *after* the most critical issues have been *determined*. That choice is premature action.",
    "difficulty": "medium",
    "topics": [
      "prioritization techniques",
      "impediment determination"
    ]
  },
  {
    "id": "q-people-7-1-006",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The team reports frequent communication breakdowns with a co-located external vendor responsible for delivering a key project component. The issues range from missed status updates to conflicting technical specifications. Before taking action, what is the best technique for the project manager to employ to *determine* the core *source* of the communications breakdown?",
    "options": [
      {
        "id": "a",
        "label": "Immediately draft a formal change request to replace the vendor with an in-house team, citing the continuous communication issues as the primary justification for the change."
      },
      {
        "id": "c",
        "label": "Conduct a Communication Requirements Analysis and compare the documented communication methods in the plan to the actual methods being used by the vendor for this project."
      },
      {
        "id": "b",
        "label": "Set up a mandatory daily 15-minute video conference call with all key vendor personnel and internal team members to ensure real-time synchronization of all updates."
      },
      {
        "id": "d",
        "label": "Hold a lessons learned session focused solely on vendor relations to document the issues and use the output to improve future procurement management plans for other projects."
      }
    ],
    "correctOptionId": "c",
    "explanation": "This choice is correct. To *determine* the source of a communication impediment, the project manager should compare the desired (planned) state with the actual state. A **Communication Requirements Analysis** involves reviewing who needs what information, when, and how, allowing for the identification of the gap or conflict that is causing the breakdown. Those choicesnd d are resolution/management steps, not the initial determination of the problem's source.",
    "difficulty": "medium",
    "topics": [
      "communication analysis",
      "impediment determination"
    ]
  },
  {
    "id": "q-people-7-1-007",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is moving into the execution phase, but the project manager notices that two senior developers, key to the architecture, spend an inordinate amount of time discussing theoretical technical debt issues from *past* projects. This is beginning to impact their current task completion rates. What is the project manager's best *determination* step?",
    "options": [
      {
        "id": "c",
        "label": "Review the current project's technical debt register and compare it against the developers' stated concerns to assess if the concerns are truly relevant to current scope."
      },
      {
        "id": "b",
        "label": "Formally assign the developers to a new work package to address their technical debt concerns, allocating a specific amount of time in the current sprint to resolve the issues."
      },
      {
        "id": "a",
        "label": "Reiterate to the developers the importance of their current tasks, reminding them that project schedule adherence is the highest priority for the current phase."
      },
      {
        "id": "d",
        "label": "Have the developers mentor junior staff members on the concepts of technical debt, delegating the responsibility of monitoring the issue to the newly trained staff."
      }
    ],
    "correctOptionId": "c",
    "explanation": "This choice is correct. The issue is a *potential* impediment (misdirected focus) based on *past* project issues. To *determine* if this is a critical impediment for the **current** project, the project manager must first check if those concerns are within the current scope or risk profile. This involves reviewing the project's own technical debt/risk register. The other options are premature actions or management/delegation steps.",
    "difficulty": "easy",
    "topics": [
      "scope validation",
      "impediment determination"
    ]
  },
  {
    "id": "q-people-7-1-008",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The quality assurance (QA) team consistently rejects code from one specific developer, often citing stylistic and minor formatting errors rather than functional defects. The developer is becoming demoralized, and the QA cycle time is increasing. How should the project manager *determine* if the QA process itself is the blocker?",
    "options": [
      {
        "id": "d",
        "label": "Compare the current QA acceptance criteria to the officially approved code standards documentation to identify where the criteria deviate from the defined baselines."
      },
      {
        "id": "b",
        "label": "Immediately mediate a conflict resolution session between the QA team lead and the developer to find a personal compromise on code submission rules and standards."
      },
      {
        "id": "c",
        "label": "Relocate the developer to a different project where the quality assurance requirements are known to be less stringent, thereby resolving the personal conflict efficiently."
      },
      {
        "id": "a",
        "label": "Formally assign the QA lead to conduct a training session for the developer on best coding practices and style guides to eliminate the source of the rejections."
      }
    ],
    "correctOptionId": "d",
    "explanation": "This choice is correct. A blocker in a process is often a deviation from the defined process. To *determine* if the QA process is the blocker, the project manager must compare the *actions* (the rejections) against the *documented standard* (the baseline). Those choicesnd d are actions to manage or resolve the issue, not the initial determination step.",
    "difficulty": "medium",
    "topics": [
      "process analysis",
      "blocker determination"
    ]
  },
  {
    "id": "q-people-7-1-009",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The team uses an external, cloud-based platform for development, but the platform's API documentation is known to be incomplete and contains errors. The team often loses a day or more per sprint to trial-and-error due to this lack of clarity. What should the project manager do *first* to assess the *severity* of this impediment?",
    "options": [
      {
        "id": "a",
        "label": "Contact the cloud platform's support team and demand a formal document update, citing the total project time lost as the reason for the urgent request."
      },
      {
        "id": "d",
        "label": "Ask the team to track and report the cumulative person-hours lost per sprint directly attributable to the incomplete documentation, then analyze the trend."
      },
      {
        "id": "c",
        "label": "Instruct the team to develop their own internal wiki and documentation guide for the platform's API, thus solving the problem internally for future sprints."
      },
      {
        "id": "b",
        "label": "Schedule a meeting with the project sponsor to determine if the financial impact justifies switching to a competing, more stable cloud platform provider."
      }
    ],
    "correctOptionId": "d",
    "explanation": "This choice is correct. To assess the *severity* of a time-consuming impediment, the project manager must *quantify* the impact. Tracking the cumulative person-hours lost per sprint directly measures the cost and schedule impact, which allows for a factual determination of severity. Those choicesnd d are actions to manage or resolve the issue, not the initial determination of severity.",
    "difficulty": "medium",
    "topics": [
      "quantifying impact",
      "severity determination"
    ]
  },
  {
    "id": "q-people-7-1-010",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is subject to numerous regulatory compliance checks. The compliance team, which is external to the project, has recently doubled the review time for all deliverables without any warning. What is the most effective approach for the project manager to *determine* the impact and *criticality* of this change?",
    "options": [
      {
        "id": "a",
        "label": "Communicate the increased review time to the sponsor and team, then immediately add the doubled duration to all compliance review tasks in the project schedule."
      },
      {
        "id": "d",
        "label": "Use the Schedule Network Diagram to identify all upcoming deliverables that require compliance review and recalculate the float on their respective paths."
      },
      {
        "id": "c",
        "label": "Meet with the compliance team manager to negotiate a return to the original review time and discuss the need for future change notifications for this project."
      },
      {
        "id": "b",
        "label": "Update the stakeholder register to reclassify the compliance team as a major blocker and assign the project coordinator to track the review status daily."
      }
    ],
    "correctOptionId": "d",
    "explanation": "This choice is correct. The most effective way to *determine* the *criticality* of a schedule impact is by analyzing the schedule. Using the **Schedule Network Diagram** and recalculating the **float** will show which compliance review tasks are on or near the critical path, thereby quantifying the risk to the project's final deadline. Those choicesnd d are management/resolution steps, not the initial determination of criticality.",
    "difficulty": "hard",
    "topics": [
      "critical path analysis",
      "schedule impact determination"
    ]
  },
  {
    "id": "q-people-7-1-011",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "During a risk review meeting, the team identifies a high probability that the vendor's test environment, which is shared across multiple client projects, will be frequently unavailable for the project team's exclusive use. How should the project manager *quantify* this impediment to *determine* its severity?",
    "options": [
      {
        "id": "a",
        "label": "Ask the vendor to provide the historical utilization data for their test environment, and project the likely percentage of downtime during the testing phase."
      },
      {
        "id": "d",
        "label": "Develop a Monte Carlo simulation model, using the potential downtime as an input to estimate the probability of the project finishing on time with the current schedule."
      },
      {
        "id": "c",
        "label": "Create a new risk response plan that immediately includes the option to build a dedicated in-house test environment as the primary mitigation strategy for the project."
      },
      {
        "id": "b",
        "label": "Document the potential issue in the issue log and schedule daily check-ins with the vendor, relying on their goodwill to prioritize the project's testing needs."
      }
    ],
    "correctOptionId": "d",
    "explanation": "This choice is correct. **Monte Carlo simulation** is a sophisticated quantitative risk analysis technique that uses probability distributions (in this case, the potential unavailability) to model the outcomes and *determine* the overall schedule impact and severity to the project completion date. That choice helps gather data, but b is the step that *quantifies* the severity. Those choices are management actions.",
    "difficulty": "hard",
    "topics": [
      "quantitative risk analysis",
      "severity determination"
    ]
  },
  {
    "id": "q-people-7-1-012",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The team members are consistently failing to update their time tracking and task status in the project management information system (PMIS), leading to inaccurate progress reports. The project manager suspects this is a blocker to effective control. What is the most effective way to *determine* the root cause of this lack of adherence?",
    "options": [
      {
        "id": "a",
        "label": "Issue a formal project policy mandating daily time card submissions and threaten to exclude non-compliant team members from receiving future project bonuses."
      },
      {
        "id": "b",
        "label": "Conduct a brief, anonymous survey asking team members about the perceived complexity, value, and usability of the current time tracking and task update process."
      },
      {
        "id": "c",
        "label": "Delegate the responsibility of collecting and manually entering all missing time and task status information to the Project Management Office (PMO) administrator."
      },
      {
        "id": "d",
        "label": "Review the Project Charter to re-confirm the roles and responsibilities, then hold individual performance review meetings to discuss compliance expectations."
      }
    ],
    "correctOptionId": "b",
    "explanation": "This choice is correct. A process-related impediment often stems from the team's perspective on the process. To *determine* the root cause, the project manager should gather data on the process's **usability, complexity, and perceived value** directly from the users. An anonymous survey is an effective way to gather honest feedback. Those choices are actions that enforce compliance without determining the underlying cause. That choice is a workaround.",
    "difficulty": "medium",
    "topics": [
      "root cause determination",
      "process analysis"
    ]
  },
  {
    "id": "q-people-7-1-013",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is using a new, custom-built database, and team members are expressing general anxiety about its long-term performance scalability under heavy load. The project manager needs to **determine** if this is a critical **impediment** or merely a **risk** to be managed. Which is the most appropriate action?",
    "options": [
      {
        "id": "d",
        "label": "Execute the planned stress testing activities and analyze the performance metrics to see if the system actually fails to meet the defined non-functional requirements."
      },
      {
        "id": "b",
        "label": "Record the team's anxiety in the Issue Log as an impediment and immediately schedule a meeting with the architecture team to design a replacement database."
      },
      {
        "id": "c",
        "label": "Update the Risk Register by increasing the probability of a performance failure, then allocate a significant contingency reserve for future database fixes."
      },
      {
        "id": "a",
        "label": "Remind the team that their fears are unfounded because the database was built to specification, instructing them to focus on the immediate coding tasks."
      }
    ],
    "correctOptionId": "d",
    "explanation": "This choice is correct. An **impediment** is a problem that is *currently* or *surely* occurring. An issue based on *anxiety* is often a **risk**. To *determine* if it has become an impediment (a current problem), the project manager must test the system against the non-functional requirements. If it fails, it's an impediment; otherwise, it remains a managed risk. Those choicesnd d are management actions that preempt the determination step.",
    "difficulty": "medium",
    "topics": [
      "risk vs impediment determination",
      "testing and validation"
    ]
  },
  {
    "id": "q-people-7-1-014",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "A key business stakeholder consistently provides critical feedback on features *after* they have been deployed to the testing environment, instead of during the design review phase as planned. This late feedback is causing significant and costly rework. Which piece of information is most useful for the project manager to **determine** the *root cause* of this deviation?",
    "options": [
      {
        "id": "a",
        "label": "The stakeholder's past project performance and a list of all historical instances of their late feedback across previous projects within the organization."
      },
      {
        "id": "b",
        "label": "An analysis of the design review process to identify any complexity or ambiguity that prevents the stakeholder from providing timely, actionable feedback."
      },
      {
        "id": "c",
        "label": "The total monetary value of the rework caused by the late feedback over the last three iterations, presented as a cost variance report to the project sponsor."
      },
      {
        "id": "d",
        "label": "A revised communication plan that mandates the stakeholder provide feedback within a defined time window or risk having the feature deployed without their approval."
      }
    ],
    "correctOptionId": "b",
    "explanation": "This choice is correct. The problem is a process failure (late feedback). To **determine** the root cause, the project manager should investigate the process the stakeholder is *supposed* to follow (the design review process) to see if there is a **process-related obstacle** like complexity or ambiguity that prevents their adherence. That choice quantifies the impact, and a, and d are management/action steps.",
    "difficulty": "medium",
    "topics": [
      "root cause determination",
      "process analysis"
    ]
  },
  {
    "id": "q-people-7-1-015",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is being developed on an older, proprietary system for which there are only two experts in the entire organization. The team lead has reported a recent increase in support tickets and downtime due to the system's instability. How should the project manager **determine** the *criticality* of this reliance on a few experts?",
    "options": [
      {
        "id": "a",
        "label": "Assess the bus factor for the proprietary system by calculating the minimum number of experts whose absence would halt the project, then use this to assess risk."
      },
      {
        "id": "b",
        "label": "Immediately implement a knowledge transfer plan by assigning junior developers to shadow the two experts, aiming to train two backup experts within one month."
      },
      {
        "id": "c",
        "label": "Document the instability in the Issue Log and schedule a weekly meeting with the two experts to personally review and approve all changes to the proprietary system."
      },
      {
        "id": "d",
        "label": "Formally request that the two experts be released from all other organizational duties and dedicated solely to the project until the proprietary system is replaced."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. The **Bus Factor** (or 'Truck Factor') is a specific metric used to *determine* the criticality of key knowledge reliance on individuals. It quantifies the number of essential team members who, if removed (like being hit by a bus), would render the project unable to continue. Those choicesnd d are resolution or management actions.",
    "difficulty": "hard",
    "topics": [
      "bus factor analysis",
      "criticality assessment"
    ]
  },
  {
    "id": "q-people-7-1-016",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The team's code integration process has a low success rate, with merges failing frequently. The team blames 'incompatible code,' but can't identify the pattern. What should the project manager do *first* to **determine** the root cause of this technical blocker?",
    "options": [
      {
        "id": "a",
        "label": "Analyze the failed merges, applying the Five Whys technique to each failure to trace the ultimate origin of the incompatibility in the team's process."
      },
      {
        "id": "b",
        "label": "Implement a new policy mandating all developers to work on separate, clearly delineated modules, thereby preventing any direct code conflicts from occurring."
      },
      {
        "id": "c",
        "label": "Send the team to a mandatory training on advanced version control and merging techniques, assuming the current skill set is the underlying cause of the failures."
      },
      {
        "id": "d",
        "label": "Delegate the responsibility for all code merging and conflict resolution to a single, experienced developer to streamline the process and minimize further failures."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. The **Five Whys** is a classic root cause analysis technique designed to **determine** the underlying problem by asking 'Why' repeatedly until a non-technical, process, or knowledge-based root cause is found. The team has only identified the symptom ('incompatible code'). Those choicesnd d are resolution/management steps.",
    "difficulty": "medium",
    "topics": [
      "root cause analysis",
      "blocker determination"
    ]
  },
  {
    "id": "q-people-7-1-017",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "A highly matrixed project has multiple functional managers who consistently assign ad-hoc, urgent tasks to the project team members without coordinating with the project manager. The project manager observes a continuous negative variance in project schedule performance. How should the project manager **determine** the *criticality* of this organizational obstacle?",
    "options": [
      {
        "id": "a",
        "label": "Engage the project sponsor to formalize a communication hierarchy that prohibits functional managers from assigning work to the project team without the project manager's approval."
      },
      {
        "id": "b",
        "label": "Calculate the project's **Schedule Performance Index (SPI)** before and after the onset of the ad-hoc tasks and use this data to quantify the delay on the critical path."
      },
      {
        "id": "c",
        "label": "Document all ad-hoc tasks in the Issue Log, recording the assigning manager's name and the specific team member involved to track the history of the interferences."
      },
      {
        "id": "d",
        "label": "Hold a team-building session to reinforce the team's commitment to the project goals, encouraging them to politely refuse any requests not coming directly from the project manager."
      }
    ],
    "correctOptionId": "b",
    "explanation": "This choice is correct. The **Schedule Performance Index (SPI)** is a key Earned Value Management (EVM) metric used to **quantify** the extent of a schedule deviation. Comparing the SPI before and after the interference directly **determines** the **criticality** of the obstacle in terms of project schedule performance. Those choicesnd d are management or tracking actions.",
    "difficulty": "medium",
    "topics": [
      "EVM analysis",
      "criticality assessment"
    ]
  },
  {
    "id": "q-people-7-1-018",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is reliant on a legacy system's output for input data. The system generates files in an obsolete format, requiring the team to spend significant time manually reformatting the data each day. The team views this task as 'just part of the job.' How should the project manager **determine** if this is a *critical* impediment requiring intervention?",
    "options": [
      {
        "id": "a",
        "label": "Calculate the total equivalent working days lost per month due to the manual reformatting effort, and compare this to the project's overall buffer time or management reserve."
      },
      {
        "id": "b",
        "label": "Delegate the reformatting task to a new data entry specialist, which will remove the burden from the core team, solving the current time constraint efficiently."
      },
      {
        "id": "c",
        "label": "Meet with the manager of the legacy system to advocate for an immediate, expensive upgrade to a modern file output format, citing the team's current manual workload."
      },
      {
        "id": "d",
        "label": "Create a new entry in the risk register for 'Data Reformatting Effort' and assign a low probability and low impact, as the team has normalized the task as routine."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. An impediment is *critical* when it significantly consumes resources (time/money) that could be used for project work. By **calculating the total time lost** and comparing it to project buffers, the project manager **determines** the *quantified* severity. The fact that the team has normalized the task is irrelevant to its objective criticality. Those choicesnd d are actions.",
    "difficulty": "medium",
    "topics": [
      "quantifying impact",
      "criticality assessment"
    ]
  },
  {
    "id": "q-people-7-1-019",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project uses a highly customized software configuration management tool. The team reports that the tool's performance degrades significantly when more than five users are concurrently using it, which is the team's normal operating size. What is the best technique to **determine** the specific *bottleneck* in the tool's performance?",
    "options": [
      {
        "id": "a",
        "label": "Implement a formal rotation schedule for team members to ensure no more than four users are on the tool at any time, eliminating the reported concurrent usage issue."
      },
      {
        "id": "b",
        "label": "Conduct a resource utilization analysis that monitors the CPU, memory, and I/O usage of the tool's server during peak usage to pinpoint the constraint over time."
      },
      {
        "id": "c",
        "label": "Contact the vendor of the software configuration tool and demand a copy of the root cause analysis from any previous client who reported similar performance degradation."
      },
      {
        "id": "d",
        "label": "Immediately write a change request to replace the customized tool with an industry-standard commercial off-the-shelf (COTS) solution with known scalability."
      }
    ],
    "correctOptionId": "b",
    "explanation": "This choice is correct. The problem is a *technical bottleneck*. To **determine** the *specific* bottleneck, the project manager needs to perform technical **resource utilization analysis** to see which resource (CPU, memory, disk I/O, etc.) is the constraint, or the 'choke point.' Those choicesnd d are management/resolution steps.",
    "difficulty": "medium",
    "topics": [
      "bottleneck analysis",
      "technical impediment determination"
    ]
  },
  {
    "id": "q-people-7-1-020",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "In an agile environment, the product owner (PO) has become unavailable to the team due to unexpectedly high demands from senior leadership on a separate corporate initiative. The PO's absence is causing delays as the team waits for clarification on user story acceptance criteria. What is the project manager's *most urgent* action to **determine** the *criticality* of this blocker?",
    "options": [
      {
        "id": "a",
        "label": "Immediately inform the project sponsor of the PO's unavailability and request the assignment of a temporary proxy PO to mitigate the delay for the team now."
      },
      {
        "id": "b",
        "label": "Hold a meeting with the team to identify which user stories are blocked and estimate the total predicted schedule delay for the current sprint due to the lack of clarity."
      },
      {
        "id": "c",
        "label": "Re-prioritize the backlog with the team, focusing solely on user stories that have absolutely clear acceptance criteria and deferring all others until the PO returns."
      },
      {
        "id": "d",
        "label": "Update the stakeholder engagement plan to reflect the PO's current engagement level as 'Low' and document the need for a formal communication escalation process."
      }
    ],
    "correctOptionId": "b",
    "explanation": "This choice is correct. The *criticality* is determined by the **quantified impact** on the schedule. The most urgent determination step is to understand **how much delay** the blocker is causing. Those choices are actions to resolve the issue. That choice is a documentation step, not a quantification of the impact.",
    "difficulty": "easy",
    "topics": [
      "quantifying impact",
      "criticality assessment"
    ]
  },
  {
    "id": "q-people-7-1-021",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "A team member consistently produces high-quality work but takes significantly longer than the estimated time for tasks, impacting the predictability of the release. The team lead believes the issue is **perfectionism**. What is the project manager's best approach to *confirm* and *determine* this as the root cause impediment?",
    "options": [
      {
        "id": "a",
        "label": "Review the individual's time reporting and task logs to identify the ratio of 'working on' time to 'revising/re-reviewing' time, looking for disproportionate rework."
      },
      {
        "id": "b",
        "label": "Discuss the issue with the team member's functional manager, requesting that the manager enforce stricter adherence to the project's time estimation policies."
      },
      {
        "id": "c",
        "label": "Immediately assign all high-priority tasks to other team members, isolating the individual to low-priority, non-critical path tasks to minimize schedule risk."
      },
      {
        "id": "d",
        "label": "Conduct a team training session on the 'Minimum Viable Product (MVP)' concept, explaining that 'good enough' is acceptable and necessary for project success."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. The team lead's belief is a hypothesis. To **determine** and **confirm** perfectionism as the root cause, the project manager must seek *objective evidence*. Disproportionate time spent on revision/re-reviewing versus initial work provides measurable data supporting the perfectionism hypothesis. Those choicesnd d are management actions that assume the cause is already determined.",
    "difficulty": "medium",
    "topics": [
      "root cause determination",
      "performance analysis"
    ]
  },
  {
    "id": "q-people-7-1-022",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is stalled because the primary sponsor is overseas and has not signed the necessary purchase order for critical third-party software licenses. The team has identified several non-critical tasks to work on, but their core deliverable is blocked. How should the project manager **determine** the *criticality* of this blocker?",
    "options": [
      {
        "id": "a",
        "label": "Calculate the project's **Planned Value (PV)** for the blocked period, and use this to project the cost and schedule variances if the delay extends for two additional weeks."
      },
      {
        "id": "b",
        "label": "Instruct the team to continue working on the non-critical tasks, using the management reserve to cover the additional cost of any expedited software licenses later."
      },
      {
        "id": "c",
        "label": "Contact the sponsor's office and request a formal proxy to be established, granting another authorized signatory the power to approve the purchase order immediately."
      },
      {
        "id": "d",
        "label": "Document the sponsor's delay in the Issue Log and use a risk breakdown structure to categorize the issue as a 'Resource Availability' problem on this project."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. To **determine** the **criticality**, the project manager needs to quantify the cost/schedule impact. Calculating the **Planned Value (PV)** for the blocked work and projecting the variance for a likely delay period uses an EVM technique to objectively measure the potential damage. Those choices are resolution steps. That choice is a documentation step, not a quantification of criticality.",
    "difficulty": "medium",
    "topics": [
      "EVM analysis",
      "criticality assessment"
    ]
  },
  {
    "id": "q-people-7-1-023",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "During a retrospective, the development team reports that they consistently wait for final acceptance of their completed features by the operations team before deployment. The operations team, external to the project, has a 'first-come, first-served' review policy. What is the project manager's best *initial* step to **determine** if this is a systemic impediment?",
    "options": [
      {
        "id": "a",
        "label": "Collect and analyze the lead time data for the operations review process across the last three sprints, looking for an unacceptable and unpredictable pattern of delays."
      },
      {
        "id": "b",
        "label": "Hold a joint meeting with the development and operations team leads to negotiate a formal Service Level Agreement (SLA) for all future feature acceptances on this project."
      },
      {
        "id": "c",
        "label": "Advocate for implementing a Continuous Integration/Continuous Delivery (CI/CD) pipeline to automate the acceptance and deployment process and reduce reliance on manual review."
      },
      {
        "id": "d",
        "label": "Ask the development team to estimate the total person-hours they spend waiting for the operations team, and report this as a cost variance to the project sponsor."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. The best way to **determine** if a process is a systemic impediment is to **measure its performance**. Collecting and analyzing the **lead time** (the time from submission to acceptance) across multiple cycles will objectively quantify the severity and predictability of the delay. Those choices are resolution steps. That choice is a less comprehensive measure than lead time analysis.",
    "difficulty": "medium",
    "topics": [
      "process analysis",
      "impediment determination"
    ]
  },
  {
    "id": "q-people-7-1-024",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project is nearing completion, and the project manager notices that documentation tasks, which are necessary for final handover, are being repeatedly pushed to the next sprint. The team is consistently meeting their coding velocity goals. What is the project manager's best **determination** step to uncover the *hidden* impediment?",
    "options": [
      {
        "id": "a",
        "label": "Interview team members about their perceived value of documentation and any challenges or lack of skills related to completing documentation tasks."
      },
      {
        "id": "b",
        "label": "Write a new working agreement that mandates a documentation-to-code ratio for every feature and enforce compliance through peer review on this project."
      },
      {
        "id": "c",
        "label": "Assign a dedicated technical writer to the team to take over all documentation tasks, removing the responsibility and impediment from the core development team."
      },
      {
        "id": "d",
        "label": "Re-prioritize the backlog so documentation tasks are placed at the top of the next sprint's work for this project and future sprints to support final handover."
      }
    ],
    "correctOptionId": "a",
    "explanation": "This choice is correct. When an impediment is 'hidden' or a result of social/motivation factors, direct and empathetic communication is the best **determination** technique. Interviewing the team about **perceived value** or **skill gaps** can uncover a non-obvious impediment like low motivation, lack of clarity, or skill deficit. Those choicesnd d are management actions that assume the cause is known.",
    "difficulty": "easy",
    "topics": [
      "social impediment determination",
      "interviewing"
    ]
  },
  {
    "id": "q-people-7-1-025",
    "domainId": "people",
    "taskId": "people-7",
    "enablerIds": [
      "e-people-7-1"
    ],
    "text": "The project involves integrating a new technology with a legacy system. The team reports frequent, unexpected crashes in the legacy system when the new component is tested, but the crashes are random and cannot be easily replicated. What is the most rigorous technique to **determine** the *root cause* of this blocker?",
    "options": [
      {
        "id": "a",
        "label": "Formally request that the legacy system owner provide all original design documentation and maintenance logs to the team for an in-depth code review of the system's core logic."
      },
      {
        "id": "b",
        "label": "Use a **Fault Tree Analysis (FTA)** to visually map the sequence of events and conditions that could lead to the top event (the crash), working backward to potential systemic failures."
      },
      {
        "id": "c",
        "label": "Implement a logging system to capture the stack trace of the legacy system immediately before each crash, assuming the crashes are caused by memory overflow or buffer issues."
      },
      {
        "id": "d",
        "label": "Design a simpler, isolated integration test, eliminating all complex interactions until a reproducible test case is found, thereby reducing the search space for the failure."
      }
    ],
    "correctOptionId": "b",
    "explanation": "This choice is correct. **Fault Tree Analysis (FTA)** is a top-down, deductive root cause analysis method that is highly effective for complex, non-replicable systemic failures. It visually and logically maps the sequence of causes leading to the failure, making it the most rigorous method to **determine** the root cause of an unpredictable blocker. Those choicesnd d are useful but less rigorous or too narrow in scope for determining a systemic, random failure.",
    "difficulty": "hard",
    "topics": [
      "fault tree analysis",
      "root cause determination"
    ]
  }
]
