[
  {
    "id": "people-1",
    "domainId": "people",
    "title": "Develop a common vision",
    "description": "Help ensure a shared vision with key stakeholders., Promote the shared vision., and 2 more actions."
  },
  {
    "id": "people-2",
    "domainId": "people",
    "title": "Manage conflicts",
    "description": "Identify conflict sources., Analyze the context for the conflict., and 4 more actions."
  },
  {
    "id": "people-3",
    "domainId": "people",
    "title": "Lead the project team",
    "description": "Establish expectations at the team level., Empower the team., and 5 more actions."
  },
  {
    "id": "people-4",
    "domainId": "people",
    "title": "Engage stakeholders",
    "description": "Identify stakeholders., Analyze stakeholders., and 4 more actions."
  },
  {
    "id": "people-5",
    "domainId": "people",
    "title": "Align stakeholder expectations",
    "description": "Categorize stakeholders., Identify stakeholder expectations., and 2 more actions."
  },
  {
    "id": "people-6",
    "domainId": "people",
    "title": "Manage stakeholder expectations",
    "description": "Identify internal and external customer expectations., Align and maintain outcomes to internal and external customer expectations., and 1 more actions."
  },
  {
    "id": "people-7",
    "domainId": "people",
    "title": "Develop and manage the project team",
    "description": "Assess current team structure and skills., Plan for team development., and 4 more actions."
  },
  {
    "id": "people-8",
    "domainId": "people",
    "title": "Help ensure knowledge transfer",
    "description": "Identify knowledge critical to the project., Gather knowledge., and 1 more actions."
  },
  {
    "id": "process-1",
    "domainId": "process",
    "title": "Develop an integrated project management plan and plan delivery",
    "description": "Assess project needs, complexity, and magnitude., Recommend a project management development approach (i.e., predictive, adaptive/agile, or hybrid management)., and 7 more actions."
  },
  {
    "id": "process-2",
    "domainId": "process",
    "title": "Develop and manage project scope",
    "description": "Define scope., Obtain stakeholder agreement on project scope., and 1 more actions."
  },
  {
    "id": "process-3",
    "domainId": "process",
    "title": "Help ensure value-based delivery",
    "description": "Identify value components with key stakeholders., Prioritize work based on value and stakeholder feedback., and 4 more actions."
  },
  {
    "id": "process-4",
    "domainId": "process",
    "title": "Plan and manage resources",
    "description": "Define and plan resources based on requirements., Manage and optimize resource needs and availability."
  },
  {
    "id": "process-5",
    "domainId": "process",
    "title": "Plan and manage procurement",
    "description": "Plan procurement., Execute a procurement management plan., and 8 more actions."
  },
  {
    "id": "process-6",
    "domainId": "process",
    "title": "Plan and manage budget",
    "description": "Estimate budget., Create a project budget., and 4 more actions."
  },
  {
    "id": "process-7",
    "domainId": "process",
    "title": "Plan and optimize quality of products/deliverables",
    "description": "Gather quality requirements for project deliverables., Plan quality processes and tools., and 5 more actions."
  },
  {
    "id": "process-8",
    "domainId": "process",
    "title": "Plan and manage schedule",
    "description": "Prepare a schedule based on the selected development approach., Coordinate with other projects and operations., and 6 more actions."
  },
  {
    "id": "process-9",
    "domainId": "process",
    "title": "Evaluate project status",
    "description": "Develop project metrics, analysis, and reconciliation., Identify and tailor needed artifacts., and 6 more actions."
  },
  {
    "id": "process-10",
    "domainId": "process",
    "title": "Manage project closure",
    "description": "Obtain project stakeholder approval of project completion., Determine criteria to successfully close the project or phase., and 2 more actions."
  },
  {
    "id": "process-11",
    "domainId": "process",
    "title": "Plan and manage communications",
    "description": "Determine communication needs., Create a communication plan., and 2 more actions."
  },
  {
    "id": "process-12",
    "domainId": "process",
    "title": "Manage project artifacts",
    "description": "Identify needed artifacts., Help ensure artifacts are created, reviewed, updated, and documented., and 1 more actions."
  },
  {
    "id": "business-1",
    "domainId": "business",
    "title": "Define and establish project governance",
    "description": "Describe and establish the structure, rules, procedures, reporting, ethics, and policies through the use of organizational process assets (OPAs)., Define success metrics., and 1 more actions."
  },
  {
    "id": "business-2",
    "domainId": "business",
    "title": "Plan and manage project compliance",
    "description": "Confirm project compliance requirements (e.g., security, health and safety, sustainability, regulatory compliance)., Classify compliance categories., and 5 more actions."
  },
  {
    "id": "business-3",
    "domainId": "business",
    "title": "Manage and control changes",
    "description": "Execute the change control process., Communicate the status of proposed changes., and 2 more actions."
  },
  {
    "id": "business-4",
    "domainId": "business",
    "title": "Remove impediments and manage issues",
    "description": "Evaluate the impact of impediments., Prioritize and highlight impediments., and 4 more actions."
  },
  {
    "id": "business-5",
    "domainId": "business",
    "title": "Plan and manage risk",
    "description": "Identify risks., Analyze risks., and 5 more actions."
  },
  {
    "id": "business-6",
    "domainId": "business",
    "title": "Continuous improvement",
    "description": "Utilize lessons learned., Help ensure continuous improvement processes are updated., and 1 more actions."
  },
  {
    "id": "business-7",
    "domainId": "business",
    "title": "Support organizational change",
    "description": "Assess organizational culture., Evaluate the impact of organizational change on the project and determine required actions."
  },
  {
    "id": "business-8",
    "domainId": "business",
    "title": "Evaluate external business environment changes",
    "description": "Survey changes to the external business environment (e.g., regulations, technology, geopolitical, market)., Assess and prioritize the impact on project scope/backlog based on changes in the external business environment., and 1 more actions."
  }
]
