[
  {
    "id": "q-people-3-3-001",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A senior developer delivered a feature late but identified several process improvements during the delay. What is the best way for the project manager to determine the appropriate feedback approach?",
    "options": [
      {
        "id": "b",
        "label": "Hold a private conversation that acknowledges the delay, explores causes, and reinforces the value of the improvement ideas."
      },
      {
        "id": "a",
        "label": "Criticize the developer publicly in the next standup to discourage future delays."
      },
      {
        "id": "c",
        "label": "Send an email to the entire team with only the negative aspects of the situation."
      },
      {
        "id": "d",
        "label": "Ignore the delay and give only positive praise to keep morale high."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because a private, balanced conversation allows the project manager to address the performance issue while reinforcing learning and improvement. Option a is incorrect because public criticism can damage trust and psychological safety. Option c is incorrect because one-sided, negative broadcast feedback is demotivating. Option d is incorrect because ignoring the delay misses a coaching opportunity.",
    "difficulty": "easy",
    "topics": [
      "feedback approach",
      "balanced feedback"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-002",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "During a retrospective, a tester becomes defensive when bugs in their area are discussed. What should the project manager consider first when determining how to give feedback?",
    "options": [
      {
        "id": "b",
        "label": "Whether the feedback is better delivered in a one-on-one setting focused on behaviors and outcomes, not personal traits."
      },
      {
        "id": "a",
        "label": "Whether the tester should be excluded from future retrospectives to avoid conflict."
      },
      {
        "id": "c",
        "label": "Whether the project manager can delegate feedback to another team member to avoid involvement."
      },
      {
        "id": "d",
        "label": "Whether to delay feedback indefinitely until the tester raises the topic again."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because choosing a private, behavior-focused conversation can reduce defensiveness and make feedback more effective. Option a is incorrect because excluding the tester avoids the issue rather than supporting growth. Option c is incorrect because delegating difficult feedback may signal avoidance. Option d is incorrect because delaying feedback reduces its relevance.",
    "difficulty": "medium",
    "topics": [
      "psychological safety",
      "one-on-one feedback"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-003",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A junior analyst made an error that caused rework but immediately reported it and suggested fixes. What is the most appropriate feedback approach?",
    "options": [
      {
        "id": "b",
        "label": "Provide timely, supportive feedback that reinforces honesty and focuses on preventing similar errors."
      },
      {
        "id": "a",
        "label": "Wait several months and mention the error only during the annual review."
      },
      {
        "id": "c",
        "label": "Highlight the error repeatedly in meetings to warn others."
      },
      {
        "id": "d",
        "label": "Avoid feedback so as not to discourage the analyst."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because timely, constructive feedback that recognizes transparency encourages learning. Option a is incorrect because delayed feedback loses impact. Option c is incorrect because publicly repeating the error may shame the analyst. Option d is incorrect because no feedback prevents improvement and clarity.",
    "difficulty": "easy",
    "topics": [
      "timely feedback",
      "learning from mistakes"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-004",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "Two team members regularly interrupt others in meetings. Several colleagues have complained privately. What should the project manager do when choosing a feedback approach?",
    "options": [
      {
        "id": "b",
        "label": "Speak with each person separately, describe specific behaviors, and agree on meeting norms to improve participation."
      },
      {
        "id": "a",
        "label": "Call them out by name in front of the full team using harsh language."
      },
      {
        "id": "c",
        "label": "Send an anonymous email to the team assuming they will recognize themselves."
      },
      {
        "id": "d",
        "label": "Ignore the behavior since delivery metrics are currently on track."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because direct, specific, and respectful one-on-one feedback helps individuals understand impact and commit to change. Option a is incorrect because public shaming damages trust. Option c is incorrect because vague anonymous messages rarely lead to targeted action. Option d is incorrect because unaddressed behavior affects team dynamics even if metrics look good.",
    "difficulty": "medium",
    "topics": [
      "meeting behavior",
      "norms"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-005",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A distributed team includes members from cultures where direct criticism is not common. The project manager needs to give corrective feedback about missed handoffs. What is the most appropriate approach?",
    "options": [
      {
        "id": "b",
        "label": "Use clear but respectful language, focus on observable behaviors and impacts, and allow time for questions in a private setting."
      },
      {
        "id": "a",
        "label": "Use sarcasm in group chat so the team understands the problem indirectly."
      },
      {
        "id": "c",
        "label": "Avoid mentioning problems to maintain harmony, even if issues continue."
      },
      {
        "id": "d",
        "label": "Send a blunt, critical email copied to all managers to ensure urgency."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because culturally aware feedback balances clarity with respect and privacy. Option a is incorrect because sarcasm can be misinterpreted and unsafe. Option c is incorrect because ignoring issues lets problems persist. Option d is incorrect because broad, harsh emails may create embarrassment and resistance.",
    "difficulty": "hard",
    "topics": [
      "cross-cultural feedback",
      "corrective feedback"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-006",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "After a successful release, the project manager wants to reinforce effective collaboration between developers and testers. What feedback approach is most appropriate?",
    "options": [
      {
        "id": "b",
        "label": "Provide specific, public positive feedback that highlights collaborative behaviors and their impact on release quality."
      },
      {
        "id": "a",
        "label": "Send a generic message saying \"Good job\" without details."
      },
      {
        "id": "c",
        "label": "Wait until the next performance review to mention the collaboration."
      },
      {
        "id": "d",
        "label": "Recognize only the developers, since testers are expected to find issues."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Option b is correct because timely, specific, and public recognition reinforces the desired teamwork. Option a is incorrect because vague praise is less impactful. Option c is incorrect because delayed feedback misses the momentum. Option d is incorrect because excluding testers undermines their contribution and shared ownership.",
    "difficulty": "easy",
    "topics": [
      "positive feedback",
      "collaboration"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-007",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A team member receives informal, conflicting feedback from different stakeholders. They ask the project manager for clarity. What should the project manager do when determining the feedback approach?",
    "options": [
      {
        "id": "c",
        "label": "Gather input from key stakeholders, synthesize the themes, and provide clear, aligned feedback in a conversation with the team member."
      },
      {
        "id": "b",
        "label": "Tell the team member to listen only to the most senior stakeholder and ignore others."
      },
      {
        "id": "a",
        "label": "Advise the team member to ignore all feedback until it appears in a formal review."
      },
      {
        "id": "d",
        "label": "Share each stakeholder's comments separately without context and let the team member interpret them."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because consolidating and clarifying feedback prevents confusion and supports focused development. Option b is incorrect because over-weighting one voice can distort priorities. Option a is incorrect because ignoring feedback wastes learning opportunities. Option d is incorrect because fragmented feedback leaves the team member with conflicting messages.",
    "difficulty": "medium",
    "topics": [
      "stakeholder feedback",
      "feedback consolidation"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-008",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A team member frequently interrupts retrospectives with side topics, reducing focus. The behavior has persisted despite group norms. What feedback approach is most appropriate?",
    "options": [
      {
        "id": "c",
        "label": "Provide direct, one-on-one feedback citing specific examples and agree on strategies to stay on topic."
      },
      {
        "id": "b",
        "label": "Send a sarcastic chat message during the next retrospective hoping they notice."
      },
      {
        "id": "a",
        "label": "Ask the team to vote anonymously on whether the person should attend retrospectives."
      },
      {
        "id": "d",
        "label": "Avoid raising the issue because it may cause discomfort."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because specific, private feedback with agreed actions is more likely to change behavior. Option b is incorrect because sarcasm can be passive-aggressive. Option a is incorrect because public voting can humiliate the person. Option d is incorrect because avoiding feedback allows the pattern to continue.",
    "difficulty": "easy",
    "topics": [
      "behavioral feedback",
      "retrospectives"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-009",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "One team member reacts strongly to criticism in public but accepts suggestions well in private. How should this influence the project manager's feedback approach?",
    "options": [
      {
        "id": "c",
        "label": "Prioritize private, two-way feedback conversations for sensitive topics and reserve public forums mainly for recognition."
      },
      {
        "id": "b",
        "label": "Increase the amount of criticism in public so the team member gets used to it."
      },
      {
        "id": "a",
        "label": "Provide only written feedback by email to avoid direct interaction."
      },
      {
        "id": "d",
        "label": "Stop giving feedback altogether to maintain harmony."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because adapting feedback channels to individual needs increases its effectiveness while protecting psychological safety. Option b is incorrect because escalating public criticism is harmful. Option a is incorrect because written-only feedback can be misread and lacks dialogue. Option d is incorrect because no feedback limits growth.",
    "difficulty": "medium",
    "topics": [
      "individual preferences",
      "psychological safety"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-010",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A cross-functional team just completed a complex integration ahead of schedule with no major defects. The project manager wants to reinforce effective behaviors. Which feedback approach is best?",
    "options": [
      {
        "id": "c",
        "label": "Share specific examples of how planning, communication, and risk management contributed to success and thank the team publicly."
      },
      {
        "id": "b",
        "label": "Simply tell the team that meeting dates is their job and requires no recognition."
      },
      {
        "id": "a",
        "label": "Recognize only the most visible contributor and ignore the rest."
      },
      {
        "id": "d",
        "label": "Wait until the annual company meeting to mention the success briefly."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because detailed, timely, team-level recognition reinforces the behaviors that led to success. Option b is incorrect because refusing recognition can dampen motivation. Option a is incorrect because overlooking others undermines teamwork. Option d is incorrect because delayed, brief recognition has less impact.",
    "difficulty": "easy",
    "topics": [
      "team feedback",
      "success reinforcement"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-011",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A vendor's developer is not meeting expectations, and the vendor account manager is sensitive about perceived criticism. What feedback approach should the project manager take?",
    "options": [
      {
        "id": "c",
        "label": "Provide specific, factual feedback to the account manager, focusing on impact and expectations rather than personal judgments."
      },
      {
        "id": "b",
        "label": "Complain about the vendor publicly in internal meetings without informing them."
      },
      {
        "id": "a",
        "label": "Send an angry email directly to the developer and copy executive leadership."
      },
      {
        "id": "d",
        "label": "Avoid raising issues with the vendor to preserve the relationship, even if performance stays low."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because objective, impact-focused feedback to the vendor contact respects the relationship and promotes improvement. Option b is incorrect because internal complaining without action does not resolve issues. Option a is incorrect because escalatory emails can damage the partnership. Option d is incorrect because ignoring performance risks project outcomes.",
    "difficulty": "hard",
    "topics": [
      "vendor feedback",
      "contractor performance"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-012",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "Some team members say feedback comes only when something goes wrong. What is the best change to the project manager's feedback approach?",
    "options": [
      {
        "id": "c",
        "label": "Intentionally provide regular positive and developmental feedback to all team members, not only when problems arise."
      },
      {
        "id": "b",
        "label": "Restrict feedback to written warnings to keep a record."
      },
      {
        "id": "a",
        "label": "Wait for team members to explicitly request feedback before offering any."
      },
      {
        "id": "d",
        "label": "Stop giving corrective feedback to avoid negative perceptions."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Option c is correct because balanced, ongoing feedback normalizes feedback as a development tool rather than a punishment. Option b is incorrect because warning-only feedback is reactive and negative. Option a is incorrect because waiting for requests may leave issues unaddressed. Option d is incorrect because eliminating corrective feedback removes opportunities to improve.",
    "difficulty": "easy",
    "topics": [
      "feedback culture",
      "proactive feedback"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-013",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A team member misses several standups but consistently delivers tasks. The project manager suspects this may be affecting team alignment. What feedback approach should be used?",
    "options": [
      {
        "id": "d",
        "label": "Discuss the pattern privately, explain why attendance matters for coordination, and explore any obstacles."
      },
      {
        "id": "b",
        "label": "Publicly reprimand the team member during the next standup."
      },
      {
        "id": "c",
        "label": "Send a group email criticizing all team members for attendance issues."
      },
      {
        "id": "a",
        "label": "Ignore the situation since deliverables are being met."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because a focused, private conversation can clarify expectations and uncover reasons behind the behavior. Option b is incorrect because public reprimands can embarrass the team member. Option c is incorrect because group criticism may feel unfair to others. Option a is incorrect because unaddressed absence may undermine collaboration.",
    "difficulty": "medium",
    "topics": [
      "attendance",
      "expectation setting"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-014",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A new team member joins mid-project and receives feedback from multiple people using different styles. They feel overwhelmed. What should the project manager do?",
    "options": [
      {
        "id": "d",
        "label": "Coordinate feedback so that it is primarily channeled through one main conversation, with a clear structure and time for questions."
      },
      {
        "id": "b",
        "label": "Encourage everyone to give feedback in any way they like, so the new member learns quickly."
      },
      {
        "id": "c",
        "label": "Ask the new member to ignore early feedback until they have been on the project for several months."
      },
      {
        "id": "a",
        "label": "Stop all feedback to the new member to prevent overload."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because coordinated, structured feedback helps a new team member focus on key expectations and reduces confusion. Option b is incorrect because uncoordinated feedback may conflict. Option c is incorrect because early guidance is important. Option a is incorrect because no feedback slows integration.",
    "difficulty": "medium",
    "topics": [
      "onboarding feedback",
      "coordination"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-015",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "The project manager needs to give difficult feedback to a high-performing architect whose tone sometimes intimidates others. What is the most appropriate feedback approach?",
    "options": [
      {
        "id": "d",
        "label": "Schedule a private discussion, use examples of interactions, describe impacts on others, and invite the architect's perspective."
      },
      {
        "id": "b",
        "label": "Avoid giving feedback because the architect is valuable and delivery is strong."
      },
      {
        "id": "c",
        "label": "Share anonymous complaints with the entire team without context."
      },
      {
        "id": "a",
        "label": "Send a short message telling the architect to be nicer without details."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because direct, respectful, evidence-based feedback is needed even for high performers, especially when behavior affects others. Option b is incorrect because ignoring issues may damage team climate. Option c is incorrect because broad sharing of complaints can erode trust. Option a is incorrect because vague requests lack actionable guidance.",
    "difficulty": "hard",
    "topics": [
      "difficult feedback",
      "influential roles"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-016",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "After a sprint, the team misses its commitment. The root cause analysis shows gaps in estimation and risk management. What is the best feedback approach for the team?",
    "options": [
      {
        "id": "d",
        "label": "Facilitate a blameless retrospective that focuses on systems, decisions, and improvements instead of individual blame."
      },
      {
        "id": "b",
        "label": "Identify one person to blame and discuss their mistakes in detail in front of the team."
      },
      {
        "id": "c",
        "label": "Tell the team the miss is unacceptable and demand they work overtime without further discussion."
      },
      {
        "id": "a",
        "label": "Avoid discussing the missed commitment to keep morale high."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because system-focused, blameless feedback supports learning and prevents defensiveness. Option b is incorrect because singling out individuals can reduce trust. Option c is incorrect because only demanding overtime does not address root causes. Option a is incorrect because ignoring the issue prevents improvement.",
    "difficulty": "medium",
    "topics": [
      "team feedback",
      "retrospectives"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-017",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A stakeholder complains about slow responses from the team, but team metrics show most responses are on time. What feedback approach should the project manager use with the team?",
    "options": [
      {
        "id": "d",
        "label": "Share the stakeholder's perception along with data, explore specific examples with the team, and agree on adjustments to communication expectations."
      },
      {
        "id": "b",
        "label": "Tell the stakeholder that the team is meeting targets and no feedback is needed."
      },
      {
        "id": "c",
        "label": "Accuse the team of poor performance without checking facts."
      },
      {
        "id": "a",
        "label": "Ignore the stakeholder's complaint because metrics look positive."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because feedback should consider both perceptions and data and lead to clarified expectations. Option b is incorrect because dismissing perceptions misses opportunities to improve the relationship. Option c is incorrect because blaming the team without analysis is unfair. Option a is incorrect because ignoring the complaint risks stakeholder dissatisfaction.",
    "difficulty": "hard",
    "topics": [
      "perception vs data",
      "stakeholder expectations"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-018",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "Multiple feedback topics need to be discussed with a team member: quality has improved, but communication with stakeholders needs work. What is the best feedback approach?",
    "options": [
      {
        "id": "d",
        "label": "Plan a structured conversation that acknowledges improvements, then addresses communication behaviors with specific examples and suggestions."
      },
      {
        "id": "b",
        "label": "Focus only on the communication problems so the message feels serious."
      },
      {
        "id": "c",
        "label": "Mention both issues quickly in a hallway chat without details."
      },
      {
        "id": "a",
        "label": "Delay feedback until a formal review to cover all topics at once in writing."
      }
    ],
    "correctOptionId": "d",
    "explanation": "Option d is correct because balanced, planned feedback that combines positive and developmental points supports motivation and change. Option b is incorrect because ignoring progress can demotivate. Option c is incorrect because rushed conversations limit understanding. Option a is incorrect because delaying delays improvement.",
    "difficulty": "medium",
    "topics": [
      "balanced feedback",
      "conversation planning"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-019",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "The project manager wants to encourage more peer-to-peer feedback in an agile team. What is the best way to determine an appropriate peer feedback approach?",
    "options": [
      {
        "id": "a",
        "label": "Work with the team to define simple peer feedback guidelines and integrate them into regular ceremonies."
      },
      {
        "id": "b",
        "label": "Ask team members to send anonymous criticism to each other via email."
      },
      {
        "id": "c",
        "label": "Permit only the project manager to give feedback, not peers."
      },
      {
        "id": "d",
        "label": "Require detailed written peer evaluations every day."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because co-created, lightweight guidelines make peer feedback safe and sustainable. Option b is incorrect because anonymous criticism can be harmful. Option c is incorrect because limiting feedback to the manager slows learning. Option d is incorrect because daily evaluations are burdensome and may be ignored.",
    "difficulty": "easy",
    "topics": [
      "peer feedback",
      "team norms"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-020",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A team member appears disengaged during meetings but continues to deliver work. The project manager suspects underlying issues. What is the best initial feedback approach?",
    "options": [
      {
        "id": "a",
        "label": "Schedule a one-on-one to share observations, ask open-ended questions, and listen before suggesting changes."
      },
      {
        "id": "b",
        "label": "Confront the team member in the next meeting and demand they participate more."
      },
      {
        "id": "c",
        "label": "Send a short message telling them to be more engaged without explanation."
      },
      {
        "id": "d",
        "label": "Assume everything is fine because tasks are completed and avoid feedback."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because exploratory, empathetic feedback helps uncover root causes and shows support. Option b is incorrect because public confrontation may worsen disengagement. Option c is incorrect because vague directives lack context. Option d is incorrect because disengagement can precede performance issues.",
    "difficulty": "medium",
    "topics": [
      "engagement",
      "coaching"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-021",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "During code reviews, one senior engineer gives very detailed but harsh comments in the review tool. Several developers feel discouraged. How should the project manager address the feedback approach?",
    "options": [
      {
        "id": "a",
        "label": "Discuss with the engineer how to keep comments specific and respectful, and agree on tone guidelines for reviews."
      },
      {
        "id": "b",
        "label": "Disable code reviews so developers no longer receive harsh comments."
      },
      {
        "id": "c",
        "label": "Tell developers to ignore the tone and only focus on content."
      },
      {
        "id": "d",
        "label": "Allow harsh comments because they show high standards."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because adjusting tone while preserving useful content makes feedback more constructive. Option b is incorrect because removing reviews removes an important quality practice. Option c is incorrect because tone still affects morale. Option d is incorrect because harshness is not required to maintain standards.",
    "difficulty": "hard",
    "topics": [
      "code review feedback",
      "tone"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-022",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A project manager wants to introduce 360-degree feedback as part of development. What is the most important consideration when determining this feedback approach?",
    "options": [
      {
        "id": "a",
        "label": "Ensure confidentiality, clear purpose, and guidance on how feedback will be used for development, not punishment."
      },
      {
        "id": "b",
        "label": "Collect anonymous comments and share them verbatim without context."
      },
      {
        "id": "c",
        "label": "Use 360-degree feedback only to rank people for bonuses."
      },
      {
        "id": "d",
        "label": "Introduce it suddenly without explaining the process to avoid debate."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because psychological safety, clarity of purpose, and developmental framing are critical for effective 360-degree feedback. Option b is incorrect because raw anonymous comments may be hurtful. Option c is incorrect because using 360 solely for rewards can distort responses. Option d is incorrect because lack of explanation generates mistrust.",
    "difficulty": "hard",
    "topics": [
      "360 feedback",
      "trust"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-023",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "A team member frequently meets technical goals but ignores agreed communication protocols. The project manager needs to address this pattern. What feedback approach is most suitable?",
    "options": [
      {
        "id": "a",
        "label": "Hold a direct conversation connecting communication behaviors to team effectiveness and clarify expectations and consequences."
      },
      {
        "id": "b",
        "label": "Send a short chat message asking them to \"communicate better\" without specifics."
      },
      {
        "id": "c",
        "label": "Mention the issue only during the next salary discussion."
      },
      {
        "id": "d",
        "label": "Ignore communication issues as long as technical goals are met."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because clearly linking behaviors to impact and expectations helps drive change. Option b is incorrect because vague requests lack clarity. Option c is incorrect because waiting until compensation discussions creates surprise and defensiveness. Option d is incorrect because communication issues can undermine long-term success.",
    "difficulty": "medium",
    "topics": [
      "communication expectations",
      "behavioral feedback"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-024",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "The project manager wants to normalize feedback so team members see it as supportive rather than punitive. What change in approach would best support this goal?",
    "options": [
      {
        "id": "a",
        "label": "Incorporate short feedback check-ins into regular one-on-ones and team events, covering both strengths and improvements."
      },
      {
        "id": "b",
        "label": "Limit feedback to written performance appraisals once per year."
      },
      {
        "id": "c",
        "label": "Provide only negative feedback so people take it seriously."
      },
      {
        "id": "d",
        "label": "Ask team members to request feedback only when they believe they have a problem."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because frequent, balanced feedback embeds it in everyday work and reduces anxiety. Option b is incorrect because infrequent feedback feels high stakes. Option c is incorrect because negativity alone damages morale. Option d is incorrect because waiting for requests limits timely guidance.",
    "difficulty": "easy",
    "topics": [
      "feedback normalization",
      "routine check-ins"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  },
  {
    "id": "q-people-3-3-025",
    "domainId": "people",
    "taskId": "people-3",
    "enablerIds": [
      "e-people-3-3"
    ],
    "text": "At the end of a project phase, the project manager wants to provide group feedback that motivates the team and informs the next phase. What is the most appropriate feedback approach?",
    "options": [
      {
        "id": "a",
        "label": "Share key accomplishments, recognize specific effective behaviors, and discuss a small number of focused improvement themes."
      },
      {
        "id": "b",
        "label": "List every minor problem encountered, with no mention of successes."
      },
      {
        "id": "c",
        "label": "Give a brief, generic \"thanks\" and move on without details."
      },
      {
        "id": "d",
        "label": "Avoid group feedback because individual reviews will happen later."
      }
    ],
    "correctOptionId": "a",
    "explanation": "Option a is correct because balanced, specific group feedback both recognizes results and sets direction for improvement. Option b is incorrect because an exclusively negative focus can demoralize the team. Option c is incorrect because nonspecific thanks offer little guidance. Option d is incorrect because skipping group feedback misses a shared learning opportunity.",
    "difficulty": "medium",
    "topics": [
      "group feedback",
      "phase-end review"
    ],
    "process": "plan-stakeholder-engagement",
    "knowledgeAreaId": "stakeholder"
  }
]
